{"data": {"id": 10148, "name": "Agenor", "symbol": "AGE", "slug": "agenor", "category": "token", "description": "Agenor (AGE) is a blockchain project focused on bringing masses into the cryptocurrency world powered by AGE coin. In fact, the team at Agenor is aiming to grow cryptocurrency usage and benefit the non- technical audience and new enthusiasts. \r\nAgenor is a blockchain network combining both the Proof of Work (PoW) and Proof of Stake (PoS) consensus algorithms. Agenor using the hybrid system to achieve certain fundamental elements significant to driving mass crypto usage. First, the hybrid PoW and PoS mining system allows Agenor to ensure that blockchain network remains truly decentralized and no small group can dominate the flow of transactions. It makes the Agenor blockchain network efficient in terms of energy consumption; hence more interested stakeholders can participate in the mining process of AGE coin. Finally, the hybrid model reduces the barrier to entry for users interested in network participation. \r\nSimilar to Bitcoin, Agenor blockchain similarly employs PoW as with the classic Nakamoto style. Miners on PoW undertake the important function of producing and submission of new blocks to the network. On the other hand, Agenor PoS participants are responsible for confirming the block and adding it to the rest of the blockchain network. Agenor implemented the PoW mining system up to 100,000th block, fully transitioned to the PoS consensus algorithm. Fundamental to this transition is allowing PoS stakeholders and the community at large to participate in the project’s future development and decision-making. To participate and become a PoS masternode on he Agenor blockchain, a user must commit the required collateral of 10,000 AGE coins before proceeding to set up the masternode system. \r\nAgenor adopts the most practical approach to realize and drive crypto mass adoption and is essentially tied to solving the above industry challenges. Therefore, the Agenor platform will feature the following products and services: \r\nVolengi Marketplace. This will be an international marketplace accessible by anyone around the world. Users accessing the marketplace will be able to buy and sell goods or services with cryptocurrencies. The base currency for transacting on the marketplace will be native cryptocurrency AGE coin, hence introducing the initial utility of the cryptocurrency as a payment’s digital asset. Also, Agenor marketplace allow buyers and sellers to trade using Bitcoin, Ether, Bitcoin Cash, Litecoin, and Doge coin. More crypto assets will be added as user demand in the future. \r\nAgenor Payment Gateway. Agenor Pay allows online merchants to accept payments in various digital assets. The payment gateway also facilitates cross-border transactions enabling us to target and reach a worldwide user base. Agenor Pay will help drive mass adoption by targeting merchants worldwide who want to trade easily to leverage the growing trend of global e-commerce. \r\nCryptocurrency ATMs. A cryptocurrency ATM is a terminal facilitating the purchase of digital assets such as Bitcoin, Ether, Doge coin, among others by use of cash or bank card. The first crypto ATM debuted in 2013, fast forward to 2021, there are over 11,000 ATMs worldwide. However, many of these crypto ATMs are mainly found in the US (79.2% of total global ATMs), Canada, and the Europe. Realizing mass adoption will require distribution of this cryptocurrency solution worldwide and why Agenor is venturing into this business operation. Agenor understands, the crypto revolution does not target only certain economies, in fact, cryptocurrency usage and adoption statistics reveal developing economies are leading ahead of their developed counterparts. Therefore, Agenor will roll out and install crypto ATMs worldwide as per the demand and use of digital currencies usage.", "dateAdded": "2021-05-29T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "114", "dateLaunched": "2021-04-05T00:00:00.000Z", "tags": [], "urls": {"website": ["https://agenorcoin.com"], "technical_doc": ["https://agenorcoin.com/Agenor-Whitepaper-v1.pdf"], "explorer": ["https://agenor.network"], "source_code": ["https://github.com/AgenorCore/Agenor"], "message_board": ["https://medium.com/@AgenorCoin"], "chat": ["https://t.me/AgenorCommunity", "https://discord.com/invite/XzXT2n3fBz"], "announcement": ["https://bitcointalk.org/index.php?topic=5330220"], "reddit": ["https://reddit.com/r/Agenor_Official"], "twitter": ["https://twitter.com/AgenorCoin"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.91186752921941, "priceChangePercentage24h": 34.79177057, "priceChangePercentage7d": 51.71962698}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.36960577973018, "priceChangePercentage24h": 11.29293143, "priceChangePercentage7d": 20.80735424}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.0459154546492, "priceChangePercentage24h": 7.8379693, "priceChangePercentage7d": 18.59631629}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36217183431754, "priceChangePercentage24h": 17.38713656, "priceChangePercentage7d": 26.0655546}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08825297302251, "priceChangePercentage24h": 8.52298553, "priceChangePercentage7d": 23.10265883}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.34948277408693, "priceChangePercentage24h": 5.0744453, "priceChangePercentage7d": 11.19608689}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.84617771491492, "priceChangePercentage24h": 11.4837804, "priceChangePercentage7d": 19.38743017}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884223796591, "priceChangePercentage24h": 6.22962228, "priceChangePercentage7d": 12.74739738}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05344197854214, "priceChangePercentage24h": 4.32002778, "priceChangePercentage7d": 14.49536142}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:50:07.040Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "32", "credit_count": 0}}