{"data": {"id": 10308, "name": "Sushiba", "symbol": "SUSHIBA", "slug": "sushiba", "category": "token", "description": "### What Is Sushiba (SUSHIBA)?\r\n\r\nSushiba is a BEP-20 token created in May 2021 with the aim to bridge the gap between food-related tokens and dog-related tokens, hence the portmanteau Sushiba, coming from Sushi plus Shiba.\r\n\r\nSushiba is a token that will become the centrepiece of an AI-Based decentralized Marketplace with unique, decentralized applications.\r\n\r\nThe features of the token in of itself are:\r\n\r\n 1. Reflect Finance Tokenomics: a set percentage of each transaction is redistributed to   each token holder.\r\n 2. Burn/Transaction Fees: a set percentage of each transaction is automatically burned, therefore, gradually reducing the circulating supply.\r\n\r\nThe Sushiba journey started with the observations of one of its founders that a vast number of features that are taken for granted in modern day applications are not as ubiquitous within the DeFi space. Machine learning systems managing data and user preferences, utilized in major web-applications such as YouTube, Instagram, Amazon, in the meantime can be found everywhere in their company-based counterparts. \r\n\r\nThe application of machine learning algorithms alongside the blockchain technology is the logical solution to creating a better customer experience as it enables the natural  evolution of society in becoming more and more decentralized. Decentralization should however not necessarily mean the loss of the standard AI-based features everyone is used to and is so familiar with today. This gap has motivated the founders to seek out more efficient ways to optimize the user’s experience within decentralized networks.\r\n\r\n\r\n### Who Are the Founders of Sushiba?\r\n\r\nSushiba was launched by two main founders, Andrea Chello and Weiyu Tang.\r\n\r\nChello has had three years of experience as a finance professional, working in various investment and hedge funds. He left the finance space to dive into the world of data science and data analytics as a Data Scientist for two years, due to his fascination with data and technology. This redefined his entire viewpoint when it came to understanding the integral part data plays in the decision making of an individual or company vis-à-vis the financial markets.\r\n\r\nHe has also a bachelor’s degree in Economics and three master’s degrees in corporate finance, investment management and financial engineering respectively.\r\n\r\nAt the time of launch, he noted that many features that are taken for granted in modern day applications such as YouTube, Instagram etc. (i.e. machine learning systems to manage data and user preferences) are not as ubiquitous within the decentralized space as they are in their traditional company-based counterparts.\r\n\r\nChello has also worked extensively as a full-stack web developer as of 2020, building e-commerce websites for shops in need of  adapting to the Covid-19 crisis. This was vital for the shops as they were forced to close for extended periods at a time and were in need of an online presence to continue operating. \r\n\r\n\r\nTang is a recent postgraduate with both bachelor’s degree and master’s degree in Accounting and Finance. Her professional experiences involve working as a risk analyst in the financial industry as well as starting her own start-up during her undergraduate degree. This was aimed at improving the utilisation efficiency of campus resources in major Chinese universities. After years of exploring and accumulation of competences, Tang not only has a solid knowledge base of accounting and finance, but also developed her interests and skills in the technology field. She is an excellent data analyst and programmer, as her projects speak for themselves, one of them being building her own cryptocurrency and blockchain with associated web-app in Flask and creating her own algorithms for it.\r\n\r\nAs a creative and ambitious person, Tang would like to further integrate blockchain and cryptocurrency and bring more real world value to the crypto market.\r\n\r\n#### What Makes Sushiba Unique?\r\n\r\nAs opposed to the majority of tokens, the real-world uniqueness of Sushiba, comes from its goal of creating an AI-based decentralized marketplace on which tokens can be earned or farmed, which will also be spendable on real-world services or goods. One of the issues with cryptocurrencies is that merchants are rather slow in accepting them. A decentralised marketplace with the necessary modern-day features would be one small step towards greater adoption of cryptocurrencies and Sushiba, and would give a real-world value to the token.\r\n\r\nThe rollout of the Sushiba ecosystem will take place in the form of partnerships with suppliers in different industries, providing the tokens with a real use-case and value. Industries like gaming, real estate and retail could benefit from such partnerships by means of creating and providing an alternative to people with the power of decentralisation. This should, in theory, provide more tailored services to a wider range of people. \r\n\r\nAs it has been noted earlier, many features that are taken for granted in modern day applications such as YouTube, Instagram etc. (i.e. machine learning systems to manage data and user preferences) are not as prevalent in the DeFi space.\t\r\n\t\t\t\r\nOne of the vital components of any marketplace is data management. Sushiba recognises the need for data management and will be rolling out custom AI solutions, data analytics and recommendation systems to help foster the integration of a truly decentralised marketplace. \r\n\r\nThis can be imagined as applying the YouTube recommendation algorithm to the retail world on a decentralized network. Shopping recommendations are intelligent and relevant and they take place on a decentralised marketplace. Such algorithms could also be used to improve user experiences and help with fraud detection and prevention, as each product would be fully traceable from the point of manufacture to the point of confirmation of satisfaction from buyers end.\r\n\r\nThe project could be summarised as aiming to become the Amazon of cryptocurrencies. \r\n\t\t\r\n\r\nHow will this be implemented?\r\n\r\nSushiba is only the start, as it represents the foundation onto which the entire ecosystem will be built. New portmanteau services combining food and dog related themes will be introduced as the Sushiba Family. \r\n\r\nEach member of the Sushiba family will act as an individual microservice that will form the basis of our ecosystem. Decentralized apps will range from swaps, to decentralized exchanges, to recommendation systems, to full-fledged data analytics platforms and back-end services to manage each unique combination of tokens.\r\n\r\nSushiba is part of an ever-expanding decentralized industry and will bring real value added by combining the decentralization of the blockchain to more smart and customized experiences with the aid of AI-based services.\r\n\t\r\nThe end goal would be the creation of an AI-based, decentralized marketplace. The creation of such a marketplace will be accompanied by many gamification aspects, such as incentive reward systems and badges, much like the old-school Foursquare gamified badge system. This will be used in conjunction with recommendation algorithms to improve user experience and ultimately give real-world value to each reward in the form of products and services, as well as discounts on said products and services.\r\n\r\n### Where Can I Sushiba (SUSHIBA)?\r\n\r\nSUSHIBA is available for trading on a growing number of exchanges, the main one at the moment is PancakeSwap where you can exchange BNB (Smart Chain) for SUSHIBA.\r\n[https://exchange.pancakeswap.finance/#/swap?outputCurrency=0xa96658cd0d04a8fdcdc30d1156cc65bbfc7591ed]\r\n\r\n#### How Many Sushiba (SUSHIBA) Coins Are There in Circulation?\r\n\r\nThe initial total supply of Sushiba was 1 Quadrillion, with an initial burn of 50%, with transaction has [https://bscscan.com/token/0xa96658cd0d04a8fdcdc30d1156cc65bbfc7591ed?a=0x000000000000000000000000000000000000dead], putting the circulating supply at 500 trillion tokens.", "dateAdded": "2021-06-07T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T11:50:08.000Z", "watchCount": "3230", "dateLaunched": "2021-05-17T00:00:00.000Z", "tags": [], "selfReportedCirculatingSupply": "4.73328E+14", "urls": {"website": ["https://www.sushibatoken.com"], "technical_doc": ["https://sushibatoken.s3.eu-west-2.amazonaws.com/Sushiba+Whitepaper+-+V1+-+23%3A05%3A21.pdf"], "explorer": ["https://bscscan.com/token/0xa96658cd0d04a8fdcdc30d1156cc65bbfc7591ed", "https://bscscan.com/tx/0x9a85eb6ec240f77bc9affd1be1601f71aa61427d68cd653d08d0195c6716d565"], "source_code": ["https://github.com/sushibatoken/sushiba"], "message_board": [], "chat": ["https://t.me/Sushibatokengroup"], "announcement": [], "reddit": ["https://reddit.com/r/SushibaToken"], "twitter": ["https://twitter.com/sushibatoken"]}, "volume": 0.0, "volumeChangePercentage24h": -100.0, "statistics": {"price": 4.4357e-10, "priceChangePercentage1h": 0.49344919, "priceChangePercentage24h": 5.01883073, "priceChangePercentage7d": 3.59866297, "priceChangePercentage30d": -23.55833744, "priceChangePercentage60d": 0.0, "priceChangePercentage90d": 0.0, "marketCap": 0.0, "marketCapChangePercentage24h": 0.0, "fullyDilutedMarketCap": 443568.04, "fullyDilutedMarketCapChangePercentage24h": 0.0, "circulatingSupply": 0.0, "totalSupply": 473328000000000.0, "maxSupply": 1000000000000000.0, "marketCapDominance": 0.0, "rank": 5758, "low24h": 0.0, "high24h": 0.0, "low7d": 0.0, "high7d": 0.0, "low30d": 0.0, "high30d": 0.0, "low90d": 0.0, "high90d": 1e-08, "low52w": 0.0, "high52w": 1e-08, "lowAllTime": 0.0, "highAllTime": 1e-08, "lowAllTimeChangePercentage": 0, "highAllTimeChangePercentage": -95.56, "lowAllTimeTimestamp": "2021-06-07T15:01:03.000Z", "highAllTimeTimestamp": "2021-06-08T15:58:03.000Z", "lowYesterday": 0.0, "highYesterday": 0, "openYesterday": 0.0, "closeYesterday": 0.0, "priceChangePercentageYesterday": 0, "volumeYesterday": 0, "ytdPriceChangePercentage": 0.0}, "platforms": [{"contractId": 1839, "contractAddress": "0xa96658cd0d04a8fdcdc30d1156cc65bbfc7591ed", "contractPlatform": "Binance Smart Chain", "contractPlatformId": 14, "contractChainId": 56, "contractRpcUrl": ["https://bsc-dataseed1.binance.org", "https://bsc-dataseed.binance.org/", "https://bsc-dataseed1.binance.org:443"], "contractNativeCurrencyName": "Binance Chain Native Token", "contractNativeCurrencySymbol": "BNB", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://bscscan.com/", "contractExplorerUrl": "https://bscscan.com/token/0xa96658cd0d04a8fdcdc30d1156cc65bbfc7591ed", "contractDecimals": 9, "platformCryptoId": 1839}], "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.95012133608962, "priceChangePercentage24h": 35.14534198, "priceChangePercentage7d": 51.67063994}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.35385261564175, "priceChangePercentage24h": 11.42971627, "priceChangePercentage7d": 20.53591158}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04597065485341, "priceChangePercentage24h": 7.9713895, "priceChangePercentage7d": 18.70390874}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35127535261967, "priceChangePercentage24h": 16.82483551, "priceChangePercentage7d": 25.48350721}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08818568964251, "priceChangePercentage24h": 8.68090104, "priceChangePercentage7d": 22.9905728}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.35123930522357, "priceChangePercentage24h": 5.26227592, "priceChangePercentage7d": 11.22685562}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.85315809919322, "priceChangePercentage24h": 11.59097836, "priceChangePercentage7d": 19.50061523}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884704433161, "priceChangePercentage24h": 6.2284312, "priceChangePercentage7d": 12.45313593}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05262628984308, "priceChangePercentage24h": 4.4797596, "priceChangePercentage7d": 14.13563895}], "relatedExchanges": [], "wallets": [{"id": 9025, "name": "MetaMask", "tier": 1, "url": "https://metamask.io/", "chains": "ETH,ETZ", "types": "pc", "introduction": "", "star": 1.0, "security": 2.0, "easyToUse": 4.0, "decentration": false, "focusNumber": 0, "rank": 1000013, "logo": "9025.png", "multipleChain": true}, {"id": 9152, "name": "Binance Chain Wallet", "url": "https://www.binance.org/en/blog/binance-extension-wallet/", "chains": "BNB", "types": "", "introduction": "", "star": 0.0, "security": 0.0, "easyToUse": 0.0, "decentration": false, "focusNumber": 0, "logo": "9152.png", "multipleChain": false}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T11:51:15.689Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "9", "credit_count": 0}}