{"data": {"id": 10386, "name": "Bitcoin Latinum", "symbol": "LTNM", "slug": "bitcoin-latinum", "category": "token", "description": "## What Is Bitcoin Latinum?\n\nBitcoin Latinum (LTNM) is a bitcoin hard fork, which aims to pick up where Bitcoin’s  idea of being bankless and peer-to-peer electronic cash system left off.  It is a next generation  Bitcoin hard fork capable of handling large transaction volumes, cybersecurity, and digital asset management. The idea is to solve the inherent problems of scalability and the TPS rate of its parent cryptocurrency, Bitcoin.\n\nIn addition, Bitcoin Latinum has taken a groundbreaking green initiative to achieve a carbon net-zero footprint by deploying a power friendly consensus protocol system. The intent is to introduce a new paradigm for cryptocurrency utility which offers stable, low fees, high scalability and higher transactions per second.\n\nBitcoin Latinum (LTNM) has the following unique features compared with other cryptocurrencies:\n\n\n* Greener, Energy efficient consensus Mechanism. Bitcoin Latinum enforces network nodes' capability and connectivity rules to improve the overall performance of the verification network\n\n* Secure - Bitcoin Latinum nodes implement Workload Protection strategies to secure the network. All these nodes must meet network requirements to become a member of an \"Approved Party\" to access the consensus mechanism to further strengthen the ecosystem. Additionally, Bitcoin features a distributed transaction firewall to safeguard the network\n\n* High TPS Rate - Bitcoin Latinum offers a highly scalable network that supports millions of transactions per day to facilitate retail transactions. Bitcoin Latinum also adopts a larger block size to ensure the network facilitates more transactions per minute at lower transaction fees.\n\n* Fixed Low Fees - Bitcoin Latinum reduces the cost of Bitcoin transactions from the average of multiple dollars to cents per transaction. This is achieved with a variety of mechanisms including the energy efficient consensus protocol, approved  node configuration, high performance node interconnection, larger block size for the network, and shorter confirmation.\n\n* DeFi-Enabled - Bitcoin Latinum formulates a DeFi transaction network that facilitates secure and near-instant digital asset sales of Media, Cloud, and Gaming. The network has a PoS like consensus model, this may allow token holders to participate in the network to earn yield on their holdings.\n\n* Community Governed - Bitcoin Latinum uses a representative government model to achieve greater security in its ecosystem.\nThe goal is to protect Bitcoin Latinum from 51% attacks.\n\n* Insured - A comprehensive insurance program in place to protect Bitcoin Latinum holders in case of internal collusion or external theft. Marsh & McLennan, a leading insurance brokers and risk advisers, to arrange a comprehensive insurance program for Bitcoin Latinum through their Asia division, Marsh Asia. The intent is to secure our community from any possible unfortunate event in the near future.\n\nBitcoin Latinum targets multi billion dollar markets such as Media, Gaming, Cloud Computing and Telecommunications.\n\n### Where Can I Buy Bitcoin Latinum (LTNM)?\n\nLTNM will be available for trading on a large number of exchanges soon.\n\nNew to cryptocurrency? Read CoinMarketCap’s [easy guide](https://coinmarketcap.com/how-to-buy-bitcoin/) to buying Bitcoin or any other token.", "dateAdded": "2021-06-10T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "87", "dateLaunched": "2020-09-15T00:00:00.000Z", "launchPrice": 11.0, "tags": [], "urls": {"website": ["https://www.bitcoinlatinum.com/", "https://app.bitcoinlatinum.com/"], "technical_doc": ["https://www.bitcoinlatinum.com/assets/ltnm-whitepaper.pdf"], "explorer": [], "source_code": ["https://bitcoinlatinum.com/docs"], "message_board": ["https://medium.com/bitcoinlatinum"], "chat": ["https://www.facebook.com/bitcoinlatinum", "https://www.youtube.com/channel/UC57vDbAn_JKe-uco2TLrCrA"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/bitcoinlatinum"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.93913845067335, "priceChangePercentage24h": 35.10541915, "priceChangePercentage7d": 51.63438799}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33773955512395, "priceChangePercentage24h": 11.23981776, "priceChangePercentage7d": 20.41715042}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04592046794645, "priceChangePercentage24h": 8.23029735, "priceChangePercentage7d": 17.9758293}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35127535261967, "priceChangePercentage24h": 16.82483551, "priceChangePercentage7d": 25.48350721}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08803051270921, "priceChangePercentage24h": 8.32754572, "priceChangePercentage7d": 22.77415107}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.35123930522357, "priceChangePercentage24h": 5.26227592, "priceChangePercentage7d": 11.22685562}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.86320486217138, "priceChangePercentage24h": 12.14307618, "priceChangePercentage7d": 19.6744906}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884102685655, "priceChangePercentage24h": 6.39973257, "priceChangePercentage7d": 12.44788409}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05262628984308, "priceChangePercentage24h": 4.4797596, "priceChangePercentage7d": 14.13563895}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:51:48.284Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}