{"data": {"id": 10425, "name": "BSC AMP", "symbol": "BAMP", "slug": "bsc-amp", "category": "token", "description": "The first Decentralised Asset Management Platform built on Binance Smart Chain which offers a wide range of solutions in one platform including lend, borrow, stake, farm, swap through decentralized exchanges etc.\r\n\r\nBSC AMP is a non-custodial and web-based application which is One-Stop destination for all the defi applications on Binance Smart Chain. BSC AMP will bring leading protocols and platforms to allow the users to leverage the maximum potential of decentralized finance on Binance Smart Chain and reduces the time waste occured due to visiting different Platforms.\r\n\r\nEOOSYSTEM\r\n\r\nLend & Borrow :\r\nOur platform provides the top decentralized lending platforms on Binance Smart Chain and allowing users to lend their assets and earn interest passively with optimised rates and borrowing option with collateralization. So that, Users can easily lend and borrow their assets with multiple platforms at a single place.\r\n\r\n\r\nSTAKING :\r\n\r\nBSC AMP will support non-custodial staking services for assets such as BAMP,....(More will announce soon).  We will make it completely decentralized by allowing other projects to use BSC AMP as their Staking Platform. So that, Many Projects might use our platform as their Staking Platform. And also, This will help our users to stake their Multiple Assets on Single Platform.\r\n\r\nEXCHANGE : \r\n\r\nOur Exchange Feature acts as Binance Smart Chain DEX aggregator, which means that it allows users to swap in our platform through an intuitive interface that connects to Decentralised Exchanges on Binance Smart Chain like Pancake Swap, Burger Swap etc.for the cheapest prices and reroutes its customers’ trades between them to try and ensure that they're getting the best prices.\r\n\r\n\r\n\r\nOur algorithm finds the cheapest way to place that trade using all the different decentralized exchanges and liquidity protocols on Binance Smart Chain that can facilitate this trade. The advantage of using our Platform for this is that you can buy Binance Smart Chain Tokens at a cheaper price.\r\n\r\n\r\nFARMING :\r\n\r\nWe discovers and offer the best yield farms on Binance Smart Chain that our users can easily farm on. We will provide an aggregated list of best yield farms on our platform. Through our Aggregated list of yield farms, users can reduce the time loss due to excessive research.  Here, Users can farms the highest yield available from the newest DeFi protocols, and optimizes the yields that are received using the latest farming techniques. BSC AMP provides the best suite of yield-generating products, focused on accessibility, optimization, and longevity.\r\n\r\nBAMP Token :\r\n\r\n$BAMP is the BSC AMP’s native token which will be utilized for various purposes with the core objective of incentivizing the custodian of the token. The team is exploring the following areas through which the $BAMP will add value to the BSC AMP ecosystem.\r\n• Rewards for the users who are providing liquidity.\r\n• Staking\r\n• Reduction in fee on the BSC AMP platform.\r\n• Other Incentives for the platform users and token holders.", "dateAdded": "2021-06-15T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "124515", "dateLaunched": "2021-07-02T00:00:00.000Z", "launchPrice": 0.1, "tags": [], "selfReportedCirculatingSupply": "315000.0", "urls": {"website": ["https://bscamp.finance/"], "technical_doc": ["https://drive.google.com/file/d/13Cw2lKU-UEPhnnkxPlXWmmjfsvp2pgs6/view?usp=drivesdk"], "explorer": [], "source_code": [], "message_board": [], "chat": [], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/BSC_AMP"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.93913845067335, "priceChangePercentage24h": 35.10541915, "priceChangePercentage7d": 51.63438799}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33773955512395, "priceChangePercentage24h": 11.23981776, "priceChangePercentage7d": 20.41715042}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04592046794645, "priceChangePercentage24h": 8.23029735, "priceChangePercentage7d": 17.9758293}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35127535261967, "priceChangePercentage24h": 16.82483551, "priceChangePercentage7d": 25.48350721}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08803051270921, "priceChangePercentage24h": 8.32754572, "priceChangePercentage7d": 22.77415107}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.35123930522357, "priceChangePercentage24h": 5.26227592, "priceChangePercentage7d": 11.22685562}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.86320486217138, "priceChangePercentage24h": 12.14307618, "priceChangePercentage7d": 19.6744906}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884102685655, "priceChangePercentage24h": 6.39973257, "priceChangePercentage7d": 12.44788409}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05262628984308, "priceChangePercentage24h": 4.4797596, "priceChangePercentage7d": 14.13563895}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:52:04.530Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "9", "credit_count": 0}}