{"data": {"id": 10474, "name": "Antimony coin", "symbol": "ATMN", "slug": "antimony-coin", "category": "token", "description": "Launched in 01/05/2021 Antimony Coin,  often  denoted  as  the  ATMN,  is a cryptocurrency  used to purchase  goods and services  and apply a  robust  cryptography online  ledger  to  promote  a  secure  form  of  online transactions.  The  Antimony Coin is  a  new  currency  in  the  market that will  effectively  operate globally.  In  this  instance, the  primary attachment  of  the  currency is  a  prepaid bank,  where transactions  of  the currency  can  be  more  straightforward.  When  the currency  is attached  to  a prepaid bank, an individual  can exchange  it  from  cryptocurrency to a  fiat  currency. At  this  point, the  fiat  currency is  issued  by the  government. On this  note,  the  bank has  complete  control  of  the economy by  determining  the  primary  amount  of  money being printed. An example  of  fiat currency  that  is applicable in  this case is  United  States  dollars. An individual  can withdraw  from a  prepaid ATM  card and perform  the  desired task. Considerably, the  currency is  essential  in expounding online  transactions  and advancing the  need  for  online  transaction security.  The  role of  the  Antimony Coin  is  to  perform smoothly,  facilitating  the  market with  faster transactions, secure peer  to  peer  acknowledgement,  and not  for  last  to become  a  bridge  between  decentralized and  centralized  fiat  markets. The development of the Antimony coin project has two foundations: the company Coinagetrade ltd which is about to receive the license to operate on traditional financial markets and the Antimony coin community which will operate a horizontal development of the project. Both foundations converge on the use of the ATMN blockchain and are described in the available versions of the white paper and community yellowpaper available at antimonycoin.com\r\nWe summarize the fundamental concepts in the following:\r\nCoinage ltd facilitates the adoption of ATMN on traditional markets by ensuring the convertibility of ATMN to USD, EUR, GBP through its namesake registered company based in London with permission to operate in the markets . The Antimony community facilitates ATMN adoption by operating across cryptocurrency markets with community development of the ATMN blockchain and aggressive, unconventional marketing.\r\nBy simultaneously operating centralized and decentralized finance, Antimony's project ensures maximum ATMN coin adoption resulting in a positive effect on the value of the coin. Value increased by the technical features of the ATMN blockchain. A POW-POW hybrid with masternode that in itself is an added value that allows the project to differentiate itself on the market.", "dateAdded": "2021-06-16T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "2021-06-19T02:37:04.000Z", "watchCount": "197", "dateLaunched": "2021-04-30T00:00:00.000Z", "launchPrice": 0.12, "tags": [], "urls": {"website": ["https://www.antimonycoin.com/"], "technical_doc": ["https://www.antimonycoin.com/wp-content/uploads/atmnwhitepaper.pdf"], "explorer": [], "source_code": ["https://github.com/antimonycoin/antimonysourcecd"], "message_board": ["https://www.coinagenews.co.uk/?p=1697"], "chat": ["https://t.me/atmncommunity", "https://discord.gg/NM6PQt4gvV"], "announcement": [], "reddit": ["https://reddit.com/r/Weird-Afternoon-4936"], "twitter": ["https://twitter.com/AntimonyCoin"]}, "volume": 2617.98818592, "volumeChangePercentage24h": 52.0522, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.93913845067335, "priceChangePercentage24h": 35.10541915, "priceChangePercentage7d": 51.63438799}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33773955512395, "priceChangePercentage24h": 11.23981776, "priceChangePercentage7d": 20.41715042}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04592046794645, "priceChangePercentage24h": 8.23029735, "priceChangePercentage7d": 17.9758293}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35127535261967, "priceChangePercentage24h": 16.82483551, "priceChangePercentage7d": 25.48350721}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08803051270921, "priceChangePercentage24h": 8.32754572, "priceChangePercentage7d": 22.77415107}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.35123930522357, "priceChangePercentage24h": 5.26227592, "priceChangePercentage7d": 11.22685562}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.86320486217138, "priceChangePercentage24h": 12.14307618, "priceChangePercentage7d": 19.6744906}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884102685655, "priceChangePercentage24h": 6.39973257, "priceChangePercentage7d": 12.44788409}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05262628984308, "priceChangePercentage24h": 4.4797596, "priceChangePercentage7d": 14.13563895}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:52:24.372Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "16", "credit_count": 0}}