{"data": {"id": 10591, "name": "Safe NFT", "symbol": "SNFT", "slug": "safe-nft", "category": "token", "description": "SafeNFT is an online media platform for news, market information, and research on cryptocurrency markets worldwide. We seek to provide investors with free content as well as paid, independent, proprietary research for cryptocurrency markets, initial DEX offerings (IDOs), and blockchain investments. Our services can be paid for with approved cryptocurrencies, or the SAFENFT Token.\r\n\r\nOur proprietary, subscriber-only research will aggregate public data, trends, market and other information, and sentiment analysis from the platform, and the judgement of our team of advisors. Our goal is to create a place where investors may purchase SafeNFT services as well as publish and monetize their own independent research with NFT technology.\r\n\r\nOur goal is to become the most accessible, reliable, and sought after source of information for investors in cryptocurrency markets worldwide. Our business model seeks to become a disrupting force in promoting the professionalization of cryptocurrency markets and investing.\r\nOur vision is to become the primary resource that people turn to for information and analysis of cryptocurrencies, IDOs, and related topics. Our strategy has three objectives:\r\nProvide curated data, news feeds, and research on cryptocurrency markets, technology,and tokens relevant to investors, prospective investors, research analysts, and visitors to our website with an interest in cryptocurrencies.\r\nEstablish a platform where independent research analysts can publish, validate, and receive compensation for their own research on cryptocurrency markets and tokens.\r\nEstablish an NFT marketplace platform for crypto-related data and research services.\r\nThe SafeNFT team includes seasoned professionals in crypto, blockchain, and investment management with an average of over 30 years of experience as securities analysts and portfolio managers at bulge-bracket Wall Street investment banks and major mutual fund managers in equities, fixed income, foreign exchange, and equities. We have held executive positions at PIMCO, Morgan Stanley, Citigroup, Deutsche Bank, and other leading financial firms.\r\nTo enable compensation in our native token for research and services provided by SafeNFT and by independent providers not affiliated with SafeNFT, we are issuing SAFENFT Tokens, the proceeds of which will be used to finance the development and implementation of the SAFENFT platform and other general corporate purposes.\r\nNo offering is being made and no money or other consideration is being solicited or will be accepted by the Company in connection with the issuance of the SAFENFT Tokens. SAFENFT Tokens will only be offered by SafeNFT to non-US persons in compliance with the registration provided by Regulation D and Regulation S of the United States Securities Exchange Act (the “Act”). For information regarding the terms of distributing the SAFENFT Tokens, please refer to the SafeNFT website.\r\nProceeds from the sale of SAFENFT Tokens will be used to purchase various goods, services, and other items needed to develop and manage the SAFENFT platform. Until such time as funds are required for payment for goods and services, those proceeds will be invested in legally compliant investments as permitted by the Act and all other applicable laws and regulations.", "dateAdded": "2021-06-23T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "47", "dateLaunched": "2021-06-07T00:00:00.000Z", "tags": [], "urls": {"website": ["https://safenft.info"], "technical_doc": ["https://docs.safenft.info"], "explorer": [], "source_code": [], "message_board": [], "chat": ["https://t.me/safenftofficial"], "announcement": [], "reddit": ["https://reddit.com/r/SafeNFT"], "twitter": ["https://twitter.com/safe_nft"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.92977068571834, "priceChangePercentage24h": 35.10039856, "priceChangePercentage7d": 51.55954688}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.32092704825381, "priceChangePercentage24h": 11.27214295, "priceChangePercentage7d": 20.11024999}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04594882968113, "priceChangePercentage24h": 7.93324584, "priceChangePercentage7d": 18.08688784}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35335416203082, "priceChangePercentage24h": 17.01006705, "priceChangePercentage7d": 25.31192844}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08804909629602, "priceChangePercentage24h": 8.32224677, "priceChangePercentage7d": 22.60389594}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.357622264819, "priceChangePercentage24h": 5.41626115, "priceChangePercentage7d": 11.08194781}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.83378431858991, "priceChangePercentage24h": 11.58354766, "priceChangePercentage7d": 19.02039539}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12913193249675, "priceChangePercentage24h": 6.62568219, "priceChangePercentage7d": 12.61310133}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04965334281321, "priceChangePercentage24h": 4.23301954, "priceChangePercentage7d": 13.7174234}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:53:16.567Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "179", "credit_count": 0}}