{"data": {"id": 10631, "name": "Gods Unchained", "symbol": "GODS", "slug": "gods-unchained", "category": "token", "description": "## What Is Gods Unchained (GODS)?\r\n\r\nGods Unchained is a free-to-play tactical card game that gives players true ownership of their in-game items. Led by the former game director of Magic The Gathering: Arena, the game focuses on competitive play, which means players must strategically outsmart their opponents by building decks that are able to combat a wide variety of tactics. In Gods Unchained players completely own their digital items, giving them the freedom to trade, sell and use their cards any way they like – just like owning real, tangible cards.\r\n\r\nGODS is an ERC-20 token used as premium currency within the GU ecosystem. The tokens will be to:\r\n\r\n* Create an NFT.\r\n* Used within the marketplace and for in-game purchases.\r\n* Distributed as a reward to players.\r\n\r\n## How Many GODS Tokens Are There?\r\n\r\nThere’s a hard cap of 20 million GODS tokens. It will be allocated across player incentives, the developers and a public sale.\r\n\r\n## Who’s the team behind Gods Unchained?\r\n\r\nChris Clay (Gods Unchained Game Director): Formerly Game Director at Magic: The Gathering Arena (MTGA), during which it went from low 8-figure to $200M ARR. Chris became a gamer before he could crawl, beating his dad first in Pong and then just a few short years later in Space Invaders on the Atari 2600. His love of gaming continued to evolve into competitive play through the Quake mod Thunderwalker CTF, and creative mapping and modding endeavours with Team 3 for Quake 2. This love of creation led him to join Turbine Inc. in 2000 and he then spent 15 years at Turbine working on MMOs such as Asheron’s Call 1&2, Lord of the Rings Online, and finally the MOBA Infinite Crisis. Progressing from Technical Artist, to Art Direction and finally as a Game System’s Designer focusing on combat and tying together all of the elements of game creation to create responsive systems. Before joining the Immutable team as the Game Director for Gods Unchained, Chris spent the previous three years at Wizards of the Coast working on Magic the Gathering: Arena, first as a Principal Designer and then as Game Director. Chris is passionate about building brand new economies which empower gamers and communities via NFTs. \r\n\r\nJames Ferguson (Co-Founder) Forbes 30 Under 30: James previously led a software development team at a billion dollar eCommerce company. He holds a Bachelor of Laws and a Bachelor of Commerce (Finance) from the University of Sydney. He taught himself how to code by doing the MIT curriculum online, and moving to Silicon Valley in 2014. Together with his brother Robbie, they have previously built multiple businesses, including an ecommerce platform that utilised machine learning to optimise conversion rates, as well as a cryptocurrency arbitrage trading and lending fund. After getting involved with Ethereum in 2015, they fell down the rabbit hole and since then have built the world’s first multiplayer blockchain game, the first blockchain TCG and the first zk-rollup for NFTs.  \r\n\r\nRobbie Ferguson (Co-Founder) Forbes 30 Under 30, Thiel Fellow: Robbie previously built an automated capital gains tax platform at KPMG which was licensed to Australia’s largest cryptocurrency exchange. He became obsessed with Ethereum in 2015, and dropped out of a Computer Science/Law degree at the University of Sydney to found Immutable. He was awarded the Thiel Fellowship in 2020. Robbie believes that future generations will spend most of their waking hours in virtual reality, and wants to ensure the digital worlds they live in are as economically meaningful as the one we currently inhabit.  \r\n\r\n## Related Pages:\r\n\r\nLearn more about Gods Unchained [here](https://godsunchained.com/).\r\n\r\nNew to cryptocurrency? Find all the information you need with [Alexandria](https://coinmarketcap.com/alexandria/categories/crypto-basics), CoinMarketCap’s dedicated education resource.", "dateAdded": "2021-06-25T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "546", "dateLaunched": "2018-09-27T00:00:00.000Z", "tags": [{"slug": "collectibles-nfts", "name": "Collectibles & NFTs", "category": "PROPERTY"}, {"slug": "gaming", "name": "Gaming", "category": "PROPERTY"}, {"slug": "entertainment", "name": "Entertainment", "category": "PROPERTY"}], "urls": {"website": ["https://godsunchained.com/"], "technical_doc": [], "explorer": [], "source_code": [], "message_board": ["https://blog.godsunchained.com/"], "chat": ["https://discord.com/invite/godsunchained", "https://www.twitch.tv/godsunchained/videos"], "announcement": ["https://godsunchained.com/token"], "reddit": ["https://reddit.com/r/GodsUnchained"], "twitter": ["https://twitter.com/GodsUnchained"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.99195551596571, "priceChangePercentage24h": 35.37778497, "priceChangePercentage7d": 51.76126544}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33076201801208, "priceChangePercentage24h": 11.46531284, "priceChangePercentage7d": 19.96789566}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04600186231469, "priceChangePercentage24h": 8.14868791, "priceChangePercentage7d": 18.17285939}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35225527622235, "priceChangePercentage24h": 17.11423849, "priceChangePercentage7d": 25.42822185}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08804213776288, "priceChangePercentage24h": 8.49769861, "priceChangePercentage7d": 22.56837823}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.3483481875156, "priceChangePercentage24h": 5.45162233, "priceChangePercentage7d": 11.05712907}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.82545567829481, "priceChangePercentage24h": 11.69671449, "priceChangePercentage7d": 18.87444725}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.1291243021993, "priceChangePercentage24h": 6.62706083, "priceChangePercentage7d": 12.22580141}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.0504277483724, "priceChangePercentage24h": 4.40139621, "priceChangePercentage7d": 13.80158625}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:53:34.769Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "11", "credit_count": 0}}