{"data": {"id": 10673, "name": "Fruit's Adventures", "symbol": "FRUIT", "slug": "fruits-adventures", "category": "token", "description": "Fruit's Adventures Bring Gaming to Crypto Blockchains!\r\n\r\nFruit's Adventures focus on fun first with our Binance Smart Chain powered fruit adventures. Players can win Fruit tokens by playing our decentralized games.\r\n\r\nThe goal of the FRUIT Token DeFi Project is to use Decentralized Finance blockchains to develop and implement fun, skill-based games to increase the potential footprint of crypto usage on the market.\r\n\r\nFRUIT is dedicated to developing these games one at a time. Currently, all major effort has been focused on recreating the popular Fruit's Adventures slot game and implementing crypto exchange into it. The game has been incredibly popular in Asia for more than 30 years as a street slot game because of its high reward system. You can exchange FRUIT Tokens to play immediately and win more as you play and achieve high marks in the slots!\r\n\r\nThe reason for its popularity is the high payout potential. It uses 8 stake buttons and has 22 units. Nearly every spin will win, with an overall winning rate of over 95%! The maximum potential payout is a x288 - that can turn a small number of FRUIT tokens into a small fortune of FRUIT to exchange on the stack! This method has been used in many variations of the game, but this is the first time it has taken advantage of the DeFi model to bring immediate payout and global accessibility.\r\n\r\nFRUIT runs off of the Binance Smart Chain platform, a proven and powerful trading platform for all things crypto. Its safety and security make Fruit's Adventures the premium DeFi slot game for browser or smartphones. Yes! Fruit's Adventures can be played on the go, to take full advantage of the DeFi network and possibilities of the future of fast-transaction gaming. Every spin is confirmed as soon as it’s made. There is no downtime to wait for a wallet to refresh. As long as you have FRUIT, you have access to the game.\r\n\r\nThe goal for Fruit's Adventures is to expand over time. This includes more listings and cross-chain compatibility so more tokens can be brought in and converted to FRUIT. More games will also come to the BSC that will take advantage of the DeFi method and technology. With more games like Fruit's Adventures there will be more possibilities for high activity and blockchain trading using the FRUIT tokens. FRUIT is also looking into expanding into the NFT market, allowing the trading of digitized goods as blockchain codes with FRUIT tokens.\r\n\r\nFruit's Adventures is bringing the most popular skill-based betting into the world of crypto with FRUIT tokens! All trades are certified and tracked via Binance Smart Contracts, one of the leading open-source crypto development platforms in the world! There are big wins happening all the time. Don't miss your chance to be one of them! Trade FRUIT and play Fruit's Adventures today!\r\n\r\nhttps://www.fruitsadventures.com", "dateAdded": "2021-06-27T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "51", "dateLaunched": "2021-05-24T00:00:00.000Z", "tags": [], "urls": {"website": ["https://www.fruitsadventures.com"], "technical_doc": [], "explorer": [], "source_code": [], "message_board": [], "chat": ["https://t.me/fruitsadventures"], "announcement": [], "reddit": ["https://reddit.com/r/fruitsadventures"], "twitter": ["https://twitter.com/FruitsAdventure"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 45.99195551596571, "priceChangePercentage24h": 35.37778497, "priceChangePercentage7d": 51.76126544}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33076201801208, "priceChangePercentage24h": 11.46531284, "priceChangePercentage7d": 19.96789566}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04600186231469, "priceChangePercentage24h": 8.14868791, "priceChangePercentage7d": 18.17285939}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35225527622235, "priceChangePercentage24h": 17.11423849, "priceChangePercentage7d": 25.42822185}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08804213776288, "priceChangePercentage24h": 8.49769861, "priceChangePercentage7d": 22.56837823}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.3483481875156, "priceChangePercentage24h": 5.45162233, "priceChangePercentage7d": 11.05712907}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.82545567829481, "priceChangePercentage24h": 11.69671449, "priceChangePercentage7d": 18.87444725}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.1291243021993, "priceChangePercentage24h": 6.62706083, "priceChangePercentage7d": 12.22580141}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.0504277483724, "priceChangePercentage24h": 4.40139621, "priceChangePercentage7d": 13.86305219}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:53:55.529Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}