{"data": {"id": 10776, "name": "Signum", "symbol": "SIGNA", "slug": "signum", "category": "coin", "description": "### What is Signum?\nSignum brings a powerful blockchain solution to the world in the most sustainable way.\nLike Bitcoin, Signum provides a digital currency called Signa that is distributed, traded and stored using a decentralized ledger system.\nThere are no intermediaries, payment gateways, or banks. \n\nBut Signum is so much more than a digital currency. As a customizable platform, it has the power to feature unstoppable and censorship-resistant decentralized applications. Anyone can create digital assets (tokens) that can be used in ways only limited by our imagination. Exchanges, marketplaces, financial services, and games barely scratch the surface. And the best part of all: It is truly sustainable when compared to other cryptocurrencies like Bitcoin or Ethereum.\n\nSignum was described in its recent whitepaper as the world’s first truly sustainable blockchain, producing less than 0.002% of Bitcoin’s energy to drive the Blockchain and by using consumer-grade hardware that is easily repurposed, Signum also avoids e-waste (compared to other cryptocurrencies).\n\nApart from true sustainable mining, Signum’s architecture includes easy smart contracts, seamless and secure payment solutions, token generation, peer-to-peer messaging, and customizable data shortcuts (aliases).\n\nIn addition to digital payments, Signum brings you decentralized finance, games, and applications in a way that’s secure and censorship-resistant.\n\n### What is Signa(SIGNA)?\nSigna, Signum’s native digital coin, is the first truly sustainable cryptocurrency.\nIt can be used on all of Signum’s applications. Signa was the first cryptocurrency to use the Proof-of-Capacity consensus algorithm. \n\nWhere can you get Signa(SIGNA)?\nSigna can be bought and traded on different central exchanges.\n\nA full list of CEX can be found here: https://signum.network/exchanges.html \n\nAlternatively, Signa can be traded on BTDEX, Signum’s decentralized exchange system on the blockchain.\nBTDEX implements a unique non-custodial exchange method for cryptocurrencies and conventional fiat currencies based on Signum SmartJ Smart Contracts and on-chain encrypted messages. \n\n### Who stands behind Signum?\nSince 2019, the core development team with its large and engaging tech-community has been working tirelessly on Signum’s foundation. Signum evolved from the former blockchain Burstcoin which had its genesis block in 2014. The Signum Network Association, a Swiss Not-for-Profit Organization stands behind Signum and supports the network to grow and fulfil its vision of a sustainable and innovative blockchain.\n\n### What makes Signum unique?\nSignum is truly sustainable. No energy downsides, no e-waste. The idea of a sustainable blockchain is not new, many have claimed to be so. But Signum is truly at the forefront of the sustainability movement. \n\nSignum introduced the world to the Proof of Commitment (PoC+) decentralized consensus as the evolution of the Proof of Capacity (PoC) consensus. Different than the well-known Proof of Work (PoW) consensus used by Bitcoin and many other coins, which require special power-hungry equipment, PoC+ simply uses available disk space.\n\nThis innovative consensus offers a new way for miners to increase their effective storage capacity - committing a Signa balance (stake) in their account. This will help secure the network and improve their chances of earning mining rewards. PoC+ is a greener option since effective capacity can be increased without purchasing more equipment.\n\nSignum is the foundation for a sustainable digital future. Signum is designed to change the world as it is now. The network combines world class features with fast and secure payment solutions, innovative smart contracts, token generation, peer-to-peer messaging, and customizable data shortcuts (aliases). \n\nSignum was the first platform to run Turing-complete smart contracts on a public blockchain. Signum SmartJ is an extended Signum smart contract framework which aids in the creation and deployment of smart contracts through the easy and general-purpose programming language Java. Signum smart contracts' second unique feature is they can be programmed to self-execute. Most of today’s available smart contracts only react to the transactions they receive. Signum’s self-running smart contracts provide endless potential for new applications such as for example decentralized trustless lotteries that need to run at a specific time. \n\n### Join the movement!\nSignum is the world’s first truly sustainable blockchain, featuring world-class applications on a sustainable leading-edge blockchain architecture.\nSignum powers the cryptocurrency Signa (SIGNA) at a tiny fraction of the energy usage, cost and additional e-waste — compared to other cryptocurrencies.\nSignum empowers users and developers around the world with innovative blockchain solutions for everyday life.", "dateAdded": "2021-07-06T00:00:00.000Z", "status": "active", "notice": "[Burst](https://coinmarketcap.com/currencies/burst/) has rebranded to Signum. Announcement [Link](https://twitter.com/burstflash/status/1406832121306652673?s=20)", "latestUpdateTime": "2021-07-31T11:53:29.000Z", "watchCount": "874", "tags": [], "selfReportedTags": ["Smart Contracts", "Payments", "Mobile Payments", "Shabal-256"], "selfReportedCirculatingSupply": "2129891582", "urls": {"website": ["https://signum.network/"], "technical_doc": [], "explorer": ["https://explorer.signum.network/", "https://explore.signumcoin.ro/"], "source_code": ["https://github.com/signum-network"], "message_board": ["https://medium.com/signum-network"], "chat": ["https://discord.com/invite/D67EpDrGX5"], "announcement": [], "reddit": ["https://reddit.com/r/Signum"], "twitter": ["https://twitter.com/signum_official"]}, "volume": 20225.79208626, "volumeChangePercentage24h": 611.706, "statistics": {"price": 0.0117332016426, "priceChangePercentage1h": -0.60304775, "priceChangePercentage24h": -2.806716, "priceChangePercentage7d": -0.9404801, "priceChangePercentage30d": 0.0, "priceChangePercentage60d": 0.0, "priceChangePercentage90d": 0.0, "marketCap": 25001122.39, "marketCapChangePercentage24h": -2.8067, "fullyDilutedMarketCap": 25001122.39, "fullyDilutedMarketCapChangePercentage24h": 0.0, "circulatingSupply": 2130801392.0, "totalSupply": 2130801392.0, "marketCapDominance": 0.0015, "rank": 598, "low24h": 0.01043723, "high24h": 0.0132691, "low7d": 0.00853138, "high7d": 0.01465019, "low30d": 0.00853138, "high30d": 0.01959464, "low90d": 0.00853138, "high90d": 0.01959464, "low52w": 0.00853138, "high52w": 0.01959464, "lowAllTime": 0.00853138, "highAllTime": 0.01959464, "lowAllTimeChangePercentage": 37.53, "highAllTimeChangePercentage": -40.12, "lowAllTimeTimestamp": "2021-07-27T01:41:05.000Z", "highAllTimeTimestamp": "2021-07-10T10:20:30.000Z", "lowYesterday": 0.01200533, "highYesterday": 0.0132691, "openYesterday": 0.01245002, "closeYesterday": 0.01305528, "priceChangePercentageYesterday": 4.86, "volumeYesterday": 3525.83, "turnover": 0.000809, "ytdPriceChangePercentage": 0.0}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 46.12397158004247, "priceChangePercentage24h": 35.97590292, "priceChangePercentage7d": 52.19688347}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33596831027774, "priceChangePercentage24h": 11.77734443, "priceChangePercentage7d": 20.79969763}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04605728182659, "priceChangePercentage24h": 8.76071574, "priceChangePercentage7d": 18.45447194}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35280381875814, "priceChangePercentage24h": 17.16080009, "priceChangePercentage7d": 25.18888228}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08800314377561, "priceChangePercentage24h": 8.64715236, "priceChangePercentage7d": 22.51409252}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.34857459897508, "priceChangePercentage24h": 5.72113979, "priceChangePercentage7d": 11.05438462}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.82595372878242, "priceChangePercentage24h": 11.87423756, "priceChangePercentage7d": 18.88312147}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884161896118, "priceChangePercentage24h": 6.72652786, "priceChangePercentage7d": 11.98011293}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.0504277483724, "priceChangePercentage24h": 4.40139621, "priceChangePercentage7d": 13.86305219}], "relatedExchanges": [{"id": 478, "name": "BHEX (BlueHelix Exchange)", "slug": "bhex-bluehelix"}, {"id": 514, "name": "Finexbox", "slug": "finexbox"}, {"id": 22, "name": "Bittrex", "slug": "bittrex"}, {"id": 245, "name": "STEX", "slug": "stex"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T11:54:46.638Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "12", "credit_count": 0}}