{"data": {"id": 10805, "name": "Throne", "symbol": "THN", "slug": "throne", "category": "token", "description": "## An open creative economy\r\n\r\nAt Throne, we're excited about a brand new type of digital good often referred to as a non-fungible token, or NFT. NFTs have exciting new properties: they’re unique, provably scarce, liquid, usable across multiple applications and armed with all the programmability of digital assets.\r\n\r\nThrone is an NFT marketplace for the next generation of creators and collectors. A place where everyday users can discover, collect, and sell their work as digital assets.\r\n\r\nA core part of our vision is that open protocols like Ethereum and interoperable standards like [ERC-721](http://erc721.org/) (and [ERC-1155](https://eips.ethereum.org/EIPS/eip-1155)) will enable vibrant new economies where creators and collectors truly own this powerful brand new type of digital item. Because we think open, liquid marketplaces will help power these new creative economies, we're building tools with the help of a community of passionate users, developers, and creators.\r\n\r\nThe importance of technology and contemporary culture is reflected in everything we do, and we have clearly set ourselves apart as a vibrant force in the market because of it.\r\n\r\n\r\n## What is THN?​\r\n\r\nTHN is the utility token of the Throne community, network, and marketplace. By creating our own token economy we are able to provide a commission free platform if creators select to transact in THN, providing a more sensible and sustainable solution by driving forward a new creative economy. \r\n\r\nTHN is an [ERC-20](https://ethereum.org/en/developers/docs/standards/tokens/erc-20/) token on the Ethereum network and allows for execution of smart contracts and for consensus-based transactions. A blockchain system based on the use of tokens, which can be bought, sold, or traded. In the Ethereum system, tokens represent a diverse range of digital assets and the ERC-20  has emerged as the technical standard for all smart contracts on the Ethereum blockchain for token implementation. \r\n\r\nAs an ERC-20 token, THN can function similar, in some respects, to Bitcoin, Litecoin, and any other cryptocurrency; THN is a blockchain-based asset that has value and can be sent and received. The primary difference is that instead of running on their own blockchain, ERC-20 tokens are issued on the Ethereum network. Luckily, because ERC-20 tokens are so popular, there are many different options for wallets, making THN accessible and operational to so many people around the world.\r\n\r\n\r\n## Interoperability\r\n\r\nNon-fungible token standards allow non-fungible tokens to move easily across multiple ecosystems. When a developer launches a new NFT project, these NFTs are immediately viewable inside dozens of different wallet providers, tradable on marketplaces, and, most recently, displayable inside of virtual worlds. This is possible because open standards provide a clear, consistent, reliable API for reading and writing data.\r\n\r\n\r\n## Tradability\r\n\r\nThe most compelling feature of NFTs is free trade on open marketplaces. For the first time, users can move items outside of their original environments and into a marketplace where they can take advantage of sophisticated trading options, like eBay-style auctions, bidding, bundling, and the ability to sell in any currency, like stablecoins.\r\n\r\n\r\n## Liquidity\r\n\r\nInstant tradability of non-fungible tokens will leads to higher liquidity. NFT marketplaces can cater to a variety of audiences—from hardcore traders to more novice players—allowing for greater exposure of the assets to a wider pool of buyers.\r\n\r\n\r\n## Immutability, provable scarcity\r\n\r\nSmart contracts allow developers to place hard caps on the supply of non-fungible tokens and enforce persistent properties that cannot be modified after the NFTs are issued. For example, a developer can enforce that only a specific number of a specific rare item can be created, while keeping the supply of more common items infinite. Developers can also enforce that specific properties do not change over time by encoding them on-chain. This is particularly interesting for art, which relies heavily on the provable scarcity of an original piece.\r\n\r\n\r\n## Programmability\r\n\r\nOf course, like traditional digital assets, NFTs are fully programmable. Many of today’s NFTs have more complex mechanics, like forging, crafting, redeeming, random generation, etc. The design space is full of possibilities.\r\n\r\n\r\n## Non-fungible token standards\r\n\r\nStandards are part of what makes non-fungible tokens powerful. They give developers the guarantee that assets will behave in a specific way and describe exactly how to interact with the basic functionality of the assets.\r\n\r\n\r\n## ERC-721\r\n\r\nERC stands for Ethereum Request for Comment, and 721 is the proposal identifier number. ERCs are application-level standards in the Ethereum ecosystem, they can be a smart contract standard for tokens such as ERC-20, the author of an ERC is responsible for building consensus with the Ethereum community and once the proposal is reviewed and approved by the community it becomes a standard. ERC-721 was created to propose the functionality to track and transfer NFTs within smart contracts.\r\n\r\nWe use the ERC-721 in our ecosystem, it's an open standard that describes how to build Non-Fungible tokens on EVM (Ethereum Virtual Machine) compatible blockchains; it is a standard interface for Non-Fungible tokens; it has a set of rules which make it easy to work with NFTs. NFTs are not only of ERC-721 type; they can also be ERC-1155 tokens. However, at Throne we utilize ERC-721.\r\n\r\nERC-721 defines some functions with compliance to ERC-20. This makes it easier for existing wallets to display simple token information and events defined in the ERC-721 standard:\r\n\r\n\r\n### ERC20-like Functions:\r\n\r\n* name: Used to define the token’s name, which other contracts and applications can identify.\r\n* symbol: Used to define token’s shorthand name or symbol.\r\n* totalSupply: This function is used to define the total number of tokens on the blockchain; the supply doesn’t have to be constant.\r\n* balanceOf: Returns number of NFTs owned by an address.\r\n\r\n\r\n### Ownership Functions:\r\n\r\n* ownerOf: This function returns the address of the owner of a token. As each ERC-721 token is unique and non-fungible, they are represented on the blockchain by an ID. Other users, contracts, apps can use this ID to determine the owner of the token.\r\n* approve: This function grants or approves another entity the permission to transfer tokens on the owner’s behalf.\r\n* takeOwnership: This is an optional function that acts like a withdraw function since an outside party can call it to take tokens out of another user’s account. Therefore, takeOwnership can be used when a user has been approved to own a certain amount of tokens and wishes to withdraw said tokens from another user’s balance.\r\n* transfer: This is another type of transfer function; it allows the owner to transfer the token to another user, just like cryptocurrencies.\r\n* tokenOfOwnerByIndex: This is an optional but recommended function. Each owner can own more than one NFT at the same time. Its unique ID identifies every NFT, and eventually, it can become difficult to keep track of IDs. So the contract stores these IDs in an array and the tokenOfOwnerByIndex function lets us retrieve this information from the array.\r\n\r\n\r\n### Metadata Function:\r\n\r\n* TokenMetadata: This optional feature is an interface that lets us discover a token’s metadata or a link to its data. In Throne's utilization of ERC-721, this function links to the NFT's IPFS location.\r\n\r\n\r\n### Events:\r\n\r\n* Transfer: This event is fired when the ownership of the token changes from one individual to another. It emits the information on which account transferred the token, which account received the token, and which token (by ID) was transferred.\r\n* Approve: This event is fired when a user approves another user to take ownership of the token, i.e., it is fired whenever approve function is executed. It emits the information on which account currently owns the token, which account is approved to take ownership of the token in the future, and which token (by ID) is approved to have its ownership transferred.\r\n\r\n\r\n## Ecosystem\r\n\r\nWhat we do is not solely about technology, crypto is a movement. At Throne we strive to make the journey into the future easy for creators and collectors. That is why we integrate, partner and collaborate with innovators. \r\n\r\n* [MetaMask](https://metamask.io/): A global community of developers and designers dedicated to making the world a better place with blockchain technology. MetaMask is a software cryptocurrency wallet used to interact with the Ethereum blockchain.\r\n* [Coinbase](https://www.coinbase.com/): A cryptocurrency platform that operates remote-first without an official physical headquarters. The company was founded in 2012 by Brian Armstrong and Fred Ehrsam, and as of March 2021, was one of the world's largest cryptocurrency exchanges.\r\n* [Ethereum](https://ethereum.org/): A community-run technology powering the cryptocurrency, ether (ETH) and thousands of decentralized applications. Ethereum is a technology that's home to digital money, global payments, and applications. The community has built a booming digital economy, bold new ways for creators to earn online, and so much more. Most NFTs are built using a consistent standard known as ERC-721 and the ERC-1155 which are standard that allow for semi-fungible tokens which is particularly useful in the realm of gaming.\r\n​* [Trust Wallet](https://trustwallet.com/): The official crypto wallet of Binance. Trust Wallet is a fast and secure multi crypto wallet with Binance DEX support, designed for ease of use and perfect for storing your different crypto assets. Trust provides a secure system that makes it simple to buy and store multiple cryptocurrencies such as Bitcoin, Ethereum, Tron, Litecoin, and many other ERC20, BEP20 and ERC721 tokens.\r\n* [IPFS](https://ipfs.io/): The InterPlanetary File System (IPFS) is a protocol and peer-to-peer network for storing and sharing data in a distributed file system. IPFS uses content-addressing to uniquely identify each file in a global namespace connecting all computing devices. IPFS allows users to not only receive but host content, in a similar manner to BitTorrent. As opposed to a centrally located server, IPFS is built around a decentralized system of user-operators who hold a portion of the overall data, creating a resilient system of file storage and sharing. Any user in the network can serve a file by its content address, and other peers in the network can find and request that content from any node who has it using a distributed hash table (DHT). \r\n* [Magic (formerly known as Fortmatic)](https://fortmatic.com/): An easy-to-use alternative to web3 wallets. It allows users to use a phone number or email address to connect to Ethereum-based applications, all without the need for a browser extension.\r\n* [WalletConnect](https://walletconnect.org/): An open source protocol for connecting decentralised applications to mobile wallets with QR code scanning or deep linking. \r\n\r\n\r\n## Creative community\r\n\r\nWe exist to champion the value of digital culture. The digital realm isn’t a secondary space anymore, it’s where we live our lives, and it’s where the future is coming into focus. We need better systems for investing in creative expression, supporting visionary artists, and connecting the internet’s creative community. We’re building Throne to fill that need, using the possibilities of crypto to expand what’s possible for creators and collectors alike.\r\n\r\nThrone allows collectors to purchase digital assets that aim to push boundaries. Brands, creators and collectors who support them are establishing a new paradigm, and we know that what we build together today will be integral to what comes next.\r\n\r\nWe’ve only just begun scratching the surface of what NFTs mean for creators. It’s incredible to partner with creatives, brands, innovators, influencers, and rights holders to bring content into the NFT realm.\r\n\r\n\r\n## Who we are\r\n\r\nWe’re an ambitious team that’s committed to building a transformational product. Collectively, our teams have spent over a decade developing various scaling solutions with the brightest minds in blockchain, exploring the possibilities of crypto, but we’re also creators and artists in our own right.\r\n\r\nTogether, with some of the leading blockchain infrastructures, we are developing a new creative economy and NFT ecosystem that is both scalable and sustainable. Allowing content creators to preserve distinct and verifiable content in a new economy.", "dateAdded": "2021-07-09T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T11:53:32.000Z", "watchCount": "96", "dateLaunched": "2021-05-25T00:00:00.000Z", "tags": [], "urls": {"website": ["https://www.thr.one/"], "technical_doc": [], "explorer": ["https://etherscan.io/token/0x2e95cea14dd384429eb3c4331b776c4cfbb6fcd9"], "source_code": [], "message_board": [], "chat": ["https://t.me/thronecommunity"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/thronenft"]}, "volume": 0.0, "volumeChangePercentage24h": -100.0, "statistics": {"price": 1.69266173472162, "priceChangePercentage1h": -0.05386698, "priceChangePercentage24h": 5.26837397, "priceChangePercentage7d": 20.20604591, "priceChangePercentage30d": 0.0, "priceChangePercentage60d": 0.0, "priceChangePercentage90d": 0.0, "marketCap": 461470.37, "marketCapChangePercentage24h": 5.2684, "fullyDilutedMarketCap": 3341650574.22, "fullyDilutedMarketCapChangePercentage24h": 0.0, "circulatingSupply": 272630.0, "totalSupply": 1974198687.0, "maxSupply": 1974198687, "marketCapDominance": 0.0, "rank": 1859, "low24h": 1.59764307, "high24h": 1.70852971, "low7d": 1.40656445, "high7d": 1.75709121, "low30d": 0.97773855, "high30d": 1.75709121, "low90d": 0.97773855, "high90d": 1.75709121, "low52w": 0.97773855, "high52w": 1.75709121, "lowAllTime": 0.97773855, "highAllTime": 1.75709121, "lowAllTimeChangePercentage": 73.12, "highAllTimeChangePercentage": -3.67, "lowAllTimeTimestamp": "2021-07-13T06:02:08.000Z", "highAllTimeTimestamp": "2021-07-30T03:20:07.000Z", "lowYesterday": 1.59764307, "highYesterday": 1.75709121, "openYesterday": 1.62876629, "closeYesterday": 1.68957433, "priceChangePercentageYesterday": 3.73, "volumeYesterday": 0, "turnover": 0.0, "ytdPriceChangePercentage": 0.0}, "platforms": [{"contractId": 1027, "contractAddress": "0x2e95cea14dd384429eb3c4331b776c4cfbb6fcd9", "contractPlatform": "Ethereum", "contractPlatformId": 1, "contractChainId": 1, "contractRpcUrl": ["https://bsc-dataseed1.binance.org", "https://bsc-dataseed.binance.org/", "https://bsc-dataseed1.binance.org:443"], "contractNativeCurrencyName": "Ethereum", "contractNativeCurrencySymbol": "ETH", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://etherscan.io", "contractExplorerUrl": "https://etherscan.io/token/0x2e95cea14dd384429eb3c4331b776c4cfbb6fcd9", "contractDecimals": 18, "platformCryptoId": 1027}], "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 46.12397158004247, "priceChangePercentage24h": 35.97590292, "priceChangePercentage7d": 52.19688347}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.33596831027774, "priceChangePercentage24h": 11.77734443, "priceChangePercentage7d": 20.79969763}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04605728182659, "priceChangePercentage24h": 8.76071574, "priceChangePercentage7d": 18.45447194}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35280381875814, "priceChangePercentage24h": 17.16080009, "priceChangePercentage7d": 25.18888228}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08800314377561, "priceChangePercentage24h": 8.64715236, "priceChangePercentage7d": 22.51409252}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.34857459897508, "priceChangePercentage24h": 5.72113979, "priceChangePercentage7d": 11.05438462}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.82595372878242, "priceChangePercentage24h": 11.87423756, "priceChangePercentage7d": 18.88312147}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884161896118, "priceChangePercentage24h": 6.72652786, "priceChangePercentage7d": 11.98011293}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.0504277483724, "priceChangePercentage24h": 4.40139621, "priceChangePercentage7d": 13.86305219}], "relatedExchanges": [], "wallets": [{"id": 9022, "name": "Trust Wallet", "tier": 1, "url": "https://www.trustwallet.com/", "chains": "ETH", "types": "app,trade", "introduction": "", "star": 2.0, "security": 3.0, "easyToUse": 3.0, "decentration": true, "focusNumber": 0, "rank": 1000008, "logo": "9022.png", "multipleChain": true}, {"id": 9025, "name": "MetaMask", "tier": 1, "url": "https://metamask.io/", "chains": "ETH,ETZ", "types": "pc", "introduction": "", "star": 1.0, "security": 2.0, "easyToUse": 4.0, "decentration": false, "focusNumber": 0, "rank": 1000013, "logo": "9025.png", "multipleChain": true}], "isAudited": false, "holders": {"holderCount": 2896, "holderList": [{"address": "0x326262e558082ed41ab52a3b1fae99e49629c8fc", "balance": 1214132192.5, "share": 61.5}, {"address": "0x4fcd4e87fcfb37f9d8ab10bb8306b5170606d2ba", "balance": 360291260.4, "share": 18.25}, {"address": "0xe2080e14383604c3837a527de7c36c2b298218d2", "balance": 251710332.6, "share": 12.75}, {"address": "0xf6af7c4062d74bf62513cd910413d7638bec748b", "balance": 147792271.5, "share": 7.49}, {"address": "0xfe0b65c9233145a5b980c7a8751256b63f0d557e", "balance": 21692.3640674481, "share": 0}, {"address": "0x665076b38d4d4b2d8fda3e932776e5670a83bbe0", "balance": 15000.0, "share": 0}, {"address": "0xac6279a69f3577303177d6c8bb4577dfb7e1dee5", "balance": 14818.11653370766, "share": 0}, {"address": "0x4df15dce2716cba96c60fd21559c47542fba845a", "balance": 11047.199250352734, "share": 0}, {"address": "0x30fa6e7af663b2f3909948b948b0ca9872afd858", "balance": 7927.944937433691, "share": 0}, {"address": "0x754ebedaafc67586a3eda4df240c6b130cce56cb", "balance": 7583.083791600803, "share": 0}, {"address": "0xa2b672994d2af990d9745e31d2b157b42b98f24f", "balance": 7432.684272016191, "share": 0}, {"address": "0x6c22796e59c805da621e3496e7fa934334c5f360", "balance": 4509.149589120037, "share": 0}, {"address": "0x61e05a04ba2f7a18e7fece1f7e6519e6cb7e375d", "balance": 1354.7798108048162, "share": 0}, {"address": "0xdc4ebe4d456652ad96559c54363f635938eb44aa", "balance": 933, "share": 0}, {"address": "0x7ce22ce610811c9cc0f81bc2bf10f56ae464e5aa", "balance": 885, "share": 0}, {"address": "0x96d363e2d86875f429e2e1c6840b97b3f7815cfa", "balance": 845, "share": 0}, {"address": "0x70a7fab0c5afa0997e09fec6da4fd2836b86a751", "balance": 827, "share": 0}, {"address": "0x10049afa579ebb0954a45bafa258899e5bac0dad", "balance": 792, "share": 0}, {"address": "0xc7a4895f14ed2bb35a705332ea73d7094fd23b29", "balance": 781.564234860955, "share": 0}, {"address": "0x6d1d835e1b49ec7db154cb45afd991cc150bc0a7", "balance": 743, "share": 0}, {"address": "0x86984d37108177734db72da91b5fbc0aefe55587", "balance": 730.0, "share": 0}, {"address": "0xa7d0c9e302cbed002e9d13cfd2024496165a2831", "balance": 701.2154038429615, "share": 0}, {"address": "0xec3065e5e6dd493b2b3a9b44df8f481b81fe8ed7", "balance": 673, "share": 0}, {"address": "0x6b8767b5c68267db3c686f9dfdb585c9c60a8c7a", "balance": 571, "share": 0}, {"address": "0xb48578bf5fc54dc2f038e4ee7a0d24577dca5b20", "balance": 530.0, "share": 0}, {"address": "0x1c2956a6b61ae6f9f055f1d76c2e785bef3d6150", "balance": 525, "share": 0}, {"address": "0xc9fba93f5e545840eaab055b423db8fc8c936f32", "balance": 461, "share": 0}, {"address": "0x701647aaebce4d85914ecf9f9723e41d5e2f6df7", "balance": 400.0, "share": 0}, {"address": "0x12870cc6229e79317c02690e6065659acf52f4a9", "balance": 376, "share": 0}, {"address": "0x1764440e368677284804644f4b61b66219e136c5", "balance": 333, "share": 0}, {"address": "0x4edeaa0cfd0fa5f2cded8a4b61fc2a160ec431ce", "balance": 319, "share": 0}, {"address": "0x5bddc0e89331c0caf0ca2457bdbd30834baa7257", "balance": 310.0, "share": 0}, {"address": "0xb03dad50aa1d9316bc0af442212835e040f29b9f", "balance": 297, "share": 0}, {"address": "0x62c8e6d54a8d8730548b4e392519b8e6da7ee9cf", "balance": 250.0, "share": 0}, {"address": "0xaa07a0d74fcc4c545c9c0a64f271a68a064c83d0", "balance": 240.0, "share": 0}, {"address": "0x1a391ef69fdb6f70b2c5ab09278bfc69f2112ff7", "balance": 234, "share": 0}, {"address": "0x827ebd272863d9e0ebf8a62272548a1860bf88a4", "balance": 227, "share": 0}, {"address": "0x4748fa13a6d717a1d492837b959dd553761ef026", "balance": 215, "share": 0}, {"address": "0xc4c36569cfeff6d3ca41833d3943c224764dfa59", "balance": 214, "share": 0}, {"address": "0xe6e5b7a492f6bf86ceaa0758b093b454e7ef05ea", "balance": 214, "share": 0}, {"address": "0x4e4d5f7f77e23f3f1c25ed16b2c614993e384259", "balance": 213, "share": 0}, {"address": "0xec477906b9165808cd3a9cedec2bf11eeeecec97", "balance": 209, "share": 0}, {"address": "0x1ba6d5fd3cc511516a60182421aec765a0a86c6d", "balance": 207, "share": 0}, {"address": "0x9fdc79083c8979171c3faf6e271291b83ac5ef9c", "balance": 205, "share": 0}, {"address": "0xb3f67aeb81a38d3b0b878e81212b0a5979dee569", "balance": 202, "share": 0}, {"address": "0xbe9609914b001d08bc400938a0b26b5de1adc78a", "balance": 202, "share": 0}, {"address": "0x7be986240a4b59bee7ae422cd12cdac2e3b867d9", "balance": 202, "share": 0}, {"address": "0x390f70d01d53bcb5ebef79a45c9d31bdab1d192a", "balance": 200.0, "share": 0}, {"address": "0x731aa97992f014628e867f2e7e11ba6ce5671d5e", "balance": 200.0, "share": 0}, {"address": "0x58a641d9598f0e399866c67d6bf8ac8f6a044730", "balance": 200.0, "share": 0}, {"address": "0xf1791ebc76f5506b2968101a20d3c0003ef3838b", "balance": 200.0, "share": 0}, {"address": "0x9e53bba9be273e6015ca8dd15de071896705f453", "balance": 198, "share": 0}, {"address": "0x9ccdc320ff9c90f928ad4b2666dbfd79657f6ef7", "balance": 198, "share": 0}, {"address": "0x13e8cf677010737f67ef4bfec578cf6419cc9530", "balance": 197, "share": 0}, {"address": "0x9825ed9531279b1a3fdd32bb3bf91d3a71f89456", "balance": 196, "share": 0}, {"address": "0x2a54c1b5a84586e3a15a34e94d2fd2a64600fe68", "balance": 196, "share": 0}, {"address": "0x91fd5b6924042184e29408aa79f13c1466588970", "balance": 196, "share": 0}, {"address": "0x3a8b184fa74f3733ba0e0743694702d6c3cafc87", "balance": 195, "share": 0}, {"address": "0xf71af1bf1545c1d8ce0be7557c5364153f314e6b", "balance": 195, "share": 0}, {"address": "0x7ebc1137de7d504ab813010082e250bcd6b3fb7b", "balance": 195, "share": 0}, {"address": "0x896ddd7c1c81c961f3f540d2ea387e596b248318", "balance": 194, "share": 0}, {"address": "0x07d12f006578c832d289988958f35e9c26420023", "balance": 194, "share": 0}, {"address": "0xe5d9438b84515a149c300ed7c57402795a3f51b0", "balance": 194, "share": 0}, {"address": "0x2ef20d83b682446e5d9a81aced8eb8c18b55e0ce", "balance": 194, "share": 0}, {"address": "0xb48c606619a66efec8a8aa01df69784f1e293ae9", "balance": 194, "share": 0}, {"address": "0xef2dc972682ef20108f1e638d7437b97761600fb", "balance": 193, "share": 0}, {"address": "0x0a77f8cc4c7874e076c0dd7222650b0cde678d78", "balance": 192, "share": 0}, {"address": "0xf88f420940b5fbf8b38458b8911fdedc1ec1bdb4", "balance": 192, "share": 0}, {"address": "0x0c43106a724f09836dd82a976cbe7fe586d8bacb", "balance": 192, "share": 0}, {"address": "0x13e4a0b74d2eeabfc846abf53755cca8c63c5b9f", "balance": 191, "share": 0}, {"address": "0x1207a1220d70b45ef719ee9e43c38c2463dac3b4", "balance": 191, "share": 0}, {"address": "0x8bb3af6892018ca2a3d599f45ead517a9a728837", "balance": 191, "share": 0}, {"address": "0x16790f2c1e998c11f09f3f973eb0091c77cee868", "balance": 191, "share": 0}, {"address": "0x1cc15d317c0bd0ead3bae59927dd4d8c194f9e58", "balance": 190.0, "share": 0}, {"address": "0xb233c1e1936d5f5f2e66294bb57061870e4a20f9", "balance": 190.0, "share": 0}, {"address": "0x9ac4afc2bdd2711d67700a5a17988a31254b190a", "balance": 190.0, "share": 0}, {"address": "0x89fd68903dd4a76437e34f01e34db87ee551b1b1", "balance": 189, "share": 0}, {"address": "0x6cfbf0ab5c02c7db87219fa81096f698c273b47c", "balance": 187, "share": 0}, {"address": "0x60316a9f70159cbc7ce9431f8cefe51547519520", "balance": 186, "share": 0}, {"address": "0x80254a2ceddc705cb8c7819515f694835b0a14ef", "balance": 186, "share": 0}, {"address": "0x2f65ad12cd117a1d709d22427d99b7613c8b1385", "balance": 186, "share": 0}, {"address": "0x1122d1071b654a8d48b0ccb06c79cf8780738fb7", "balance": 186, "share": 0}, {"address": "0x4444715f27c4d098930172abfcdd8de743597556", "balance": 185, "share": 0}, {"address": "0xd4ab5ff03e7289905872b7b9b2acdd3bc57cef02", "balance": 185, "share": 0}, {"address": "0xd604493d326b69a9ab043c31566267fa2c7f8c1f", "balance": 185, "share": 0}, {"address": "0x4fa3e100f8d97698bbc5ec6c4873b603432d4a60", "balance": 185, "share": 0}, {"address": "0x2f866d731eb672a9b3f9994164ab0a2919115925", "balance": 184, "share": 0}, {"address": "0xe9dc69976df0a9c81e94edfeea0f1e5766c9f4a0", "balance": 184, "share": 0}, {"address": "0x34b53ae3e86b27fb2b9d63134956c6b5831b258b", "balance": 184, "share": 0}, {"address": "0x53535470b7b6b7ebac2440d58b1bb093b43eb8fc", "balance": 184, "share": 0}, {"address": "0x5bb805b843dc593ff392476a9574ad2c5beec4ea", "balance": 184, "share": 0}, {"address": "0xfedb364a8a497d5c7ac517193ab7efced41dd088", "balance": 184, "share": 0}, {"address": "0x5a5e8b107b9a02042c9f9329d9e6390b5721b420", "balance": 184, "share": 0}, {"address": "0x2ef09023f692549cba545dce7effe08ce23723cd", "balance": 182, "share": 0}, {"address": "0x14661c5574d63441c72b66ca739a81e0d57e3702", "balance": 182, "share": 0}, {"address": "0x6c1f5b75263684a361f526a988cd8c54dfe6b625", "balance": 182, "share": 0}, {"address": "0x0892895b561ddd0b1efaa84c21bb2036738deed7", "balance": 181, "share": 0}, {"address": "0x7f3bcba63a44db5382e1c27d8ca6d0fd163e3a9e", "balance": 181, "share": 0}, {"address": "0xa01a35078763630d675e53f976b54def54209dcb", "balance": 180.0, "share": 0}, {"address": "0xc8932c47428d9e7a1e820d0e88092a46e1600f81", "balance": 180.0, "share": 0}], "topTenHolderRatio": 99.99, "topTwentyHolderRatio": 99.99, "topFiftyHolderRatio": 99.99, "topHundredHolderRatio": 99.99}}, "status": {"timestamp": "2021-07-31T11:55:00.762Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "8", "credit_count": 0}}