{"data": {"id": 10917, "name": "DefyFarm", "symbol": "DEFY", "slug": "defyfarm", "category": "token", "description": "DefyFarm is a yield farming platform with two very unique approaches to farming: A reflect mechanism that distributes fees to both farmers and token holders (with farmers getting double reward vis a vis token holders) and an impermanent loss protection mechanism that compensates users based on the impermanent loss they might incur when pooling liquidity!\r\n\r\nDefyCoin first version was launched on March 18th, 2021. Later there was an update to second version with impermanent loss protection. DefyCoinV2 has been launched on May 2nd, 2021, with a decreasing supply of 300,000 tokens. The initial liquidity was added by the team and locked via DxSale. There is no mint function within the contract, which means that no new coins can ever be produced.\r\n\r\nThe principal purpose of DEFY token is to create a store of value. The price of a single token is designed to raise with the growing scarcity, ensured by the ever-shrinking supply. To provide a use case, DEFY is going to be used as a native currency in the upcoming sister projects.\r\n\r\n\r\n\r\nTokenomics\r\n\r\nSo far, every single farming token on BSC has suffered from inflation. Allowing the liquidity providers to gain newly-minted coins is unsustainable in a long-term, and always leads to a drastic devaluation of the token, resulting in a classic Ponzi scheme. The first few people to buy the coin – usually developers or developers’ friends – profit at the cost of everybody else. DEFY token aims to solve these problems.\r\n\r\nDeflationary farming in DEFY is possible thanks to the groundbreaking tokenomics – every transaction made with the token (buying, selling, transferring, providing liquidity, removing liquidity) is subject to a 10% tax, split as follows:\r\n\r\n•\t2% of the total amount of tokens from every transaction are burnt forever, further decreasing the supply;\r\n•\t2% are split between all the token holders according to the classic RFI model, proportionally to the held number of tokens;\r\n•\t5% are allocated to the farming pools – farming is done with the LP tokens, which ensures that the liquidity pool stays strong at all times (more on that in the next section);\r\n•\t0.5% are allocated to the impermanent loss protection fund which covers impermanent loss of farmers in DefyFarm.\r\n•\t0.5% go to the team & marketing wallet; please note that no tokens had been allocated to the team before the launch. Therefore, it is in the team’s best interest to keep the project up and running – and to work on increasing the token’s value.\r\n\r\n\r\nFarming\r\n\r\nHalf of the tax (5% of every transaction) is allocated to farming. It is done in the 24-hour- windows, ie. 5% of the entire DEFY trade volume on Monday will be available for farming on Tuesday. In order to be eligible, a token holder needs to add liquidity to a chosen pool, then proceed to stake the LP tokens in the project dashboard (https://v2.defy.farm/dashboard/). The amount of farmed tokens is displayed in the corresponding pool section of the dashboard, with APR calculated in relation to the current TVL and the previous day’s trade volume. \r\n\r\n\r\nWhat is Impermanent Loss?\r\n\r\nLets say, Defy is priced at $5 today. You buy today and pair it with BUSD and started to farm. However, when you decide to withdraw, the Defy price is, unfortunately, $3.50. Now, your harvested DEFY + your originally bought DEFY cant match your initial investment. This is when you are making Impermanent Loss.\r\n\r\nNow that we have explained that, you realize how many times you have been burnt by this?\r\nDEFY Farm will be the first save you from this menace! How? Simple.\r\n\r\nThink, in the above example, when your harvested DEFY + Your originally bought DEFY doesn't fetch your initial amount back, Team Defy steps in, wearing a black hood and red cape and says, here, some more DEFY to you to make you recover initial investment!\r\nThat's what we will do, exactly. Our ILP (Impermanent Loss Protection) smart contract will check for anybody making loss from farming and compensate them from the insurance fund.", "dateAdded": "2021-07-15T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "5", "dateLaunched": "2021-05-01T00:00:00.000Z", "tags": [], "urls": {"website": ["https://v2.defy.farm/"], "technical_doc": ["https://v2.defy.farm/docs/DefyFarm-PitchDeck.pdf"], "explorer": ["https://bscscan.com/token/0x0acbb2c3d3826b82b17c09e2dfa605b5279e0c63"], "source_code": ["https://github.com/DefyFarm/Defy-Contracts"], "message_board": ["https://defyfarm-bsc.medium.com/"], "chat": ["https://t.me/defy_farm_V2"], "announcement": [], "reddit": ["https://reddit.com/r/defy_farm"], "twitter": ["https://twitter.com/DefyFarmv2"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 46.15277603529009, "priceChangePercentage24h": 35.97491332, "priceChangePercentage7d": 52.15383074}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.34964051346751, "priceChangePercentage24h": 11.48864478, "priceChangePercentage7d": 20.65721962}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04606059556592, "priceChangePercentage24h": 8.60454635, "priceChangePercentage7d": 18.52026324}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35073162374456, "priceChangePercentage24h": 17.29500189, "priceChangePercentage7d": 25.00533147}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08805508567185, "priceChangePercentage24h": 8.49406181, "priceChangePercentage7d": 22.66853882}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.33953608915345, "priceChangePercentage24h": 5.35932698, "priceChangePercentage7d": 10.52614735}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.81208358366918, "priceChangePercentage24h": 11.33740637, "priceChangePercentage7d": 18.63805644}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12884983830176, "priceChangePercentage24h": 6.8379087, "priceChangePercentage7d": 12.06023177}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05089512675303, "priceChangePercentage24h": 4.36180993, "priceChangePercentage7d": 14.01964127}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T11:55:51.549Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "458", "credit_count": 0}}