{"data": {"id": 1169, "name": "PIVX", "symbol": "PIVX", "slug": "pivx", "category": "coin", "description": "What Is PIVX (PIVX)?\n--------------------\n\nProtected Instant Verified Transaction (or eXchange) (PIVX), launched January 30th, 2016, is a decentralized, MIT licensed open-source, fair-launch blockchain/cryptocurrency project managed, developed, governed, and stewarded by a community driven decentralized autonomous organization (DAO). It has been designed, engineered, and tested using advanced cryptography protocols to provide, first and foremost, user Financial Data Protection.  PIVX is Financial Data Protection.\n\nWhile PIVX is based on Bitcoin's codebase fundamentally, it has undergone significant custom developments and integrations. PIVX uses a Proof of Stake (PoS) consensus protocol with its native cryptocurrency, denominated as \"PIV\". PIVX in many ways has continued to pioneer the Proof of Stake consensus algorithm. PIVX's advanced PoS is enriched with the Time Protocol v2 as well as the Cold Staking functionality which ensures higher security for coin owners and possibility to secure the network and receive staking rewards while coins are being cold stored offline on a hardware wallet.\n\nThe PIVX user's financial data protection is secured through a highly customized, open-source implementation of the vetted academic anonymity protocol zero-knowledge succinct non-interactive argument of knowledge (zk-SNARKs) Sapling. All of the user's transactional activities are protected by this protocol, called SHIELD.\n\nPIVX is also fully compliant with the Anti-Money Laundering and Counter-Terrorism Financing (AML/CFT) requirements governed by the Financial Action Task Force (FATF). These regulatory bodies maintain regulation and laws concerning the use, transmission, and legality of digital assets and the associated data required to use them.\n\nPIVX integrates other features including a 2nd layer of functionality through a Masternode network that provides a decentralized governance mechanism of voting; and is currently developing new features for this layer such as the Deterministic Masternode Lists, Long Living Masternode Quorums (LLMQs) and more, as well as including the addition of the anonymity protocol zk-SNARKs Sapling to staking and masternodes---all of these heavily customised.\n\nAll the PIVX supply occurs as a direct result of a static/fixed block emission rate plus any monthly budget allocation payouts. PIVX also has a dynamically calibrated coin-supply restrained by burning 100% of the transaction fees on the network. PIVX is an independent, application and payment agnostic blockchain. PIVX uses its native cryptocurrency (PIV) as both a means of rights-preserving, privacy enabling, near instant digital currency exchange as well as the reward for those who help secure, build, decentralize, and govern the PIVX network protocol. PIV is purchased and/or obtained to be held or staked (hot or cold) or locked in masternodes by individuals who want to participate in the network.\n\nThe monetary policy of PIVX is designed to enable a sustainable infrastructure service capable of supporting scalable, decentralized, and resilient node infrastructure, allowing for instant, private transactions globally, without astronomical Quantitative Easing (QE) and the corresponding resulting devaluation of the native coin, as experienced in other cryptocurrency endeavors.\n\nPIVX as a DAO utilizes a decentralized network of masternodes that allow running various apps and services, treasury management, and community governance. PIVX has a built-in governance mechanism which allows masternode owners to vote for or against any submitted proposal.\n\nWhat Makes PIVX Unique?\n-----------------------\n\nPIVX is a decentralized autonomous organization (DAO) that is self-funded and community-driven.\n\nPIVX has the ability to perpetually self-fund development and other PIVX network supporting activities through monthly treasury payouts, which are based on successfully voted community proposals.\n\nPIVX burns 100% of all transaction fees.\n\nPIVX is a pioneer in Proof of Stake Privacy/User Data Protection.  It only requires 1 PIV to stake.\n\nPIVX Utilizes a Tier Two layer to it's network, deploying masternodes to help participate in the governance. Running a masternode requires 10,000 PIV.\n\nPIVX lays claim to numerous cryptocurrency and blockchain firsts, including:\n\n-   First Proof of Stake project with Masternodes \n\n-   First Proof of Stake project with Blockchain based governance \n\n-   First Proof of Stake project with blockchain based community self-sustainable funding \n\n-   First Proof of Stake coin to Control Inflation by burning all the transaction fees\n\n-   First Proof of Stake project to implement the Zerocoin protocol \n\n-   First Crypto project to have its main website natively translated to 30+ languages\n\n-   First Proof of Stake project to implement private staking\n\n-   The first-ever successful implementation of zk-SNARKs based Sapling privacy protocol on Proof of Stake blockchain\n\nPIVX Origins and Founders\n-------------------------\n\nPIVX was announced on bitcointalk.org on November 25th, 2015. On January 30th, 2016 at 04:10:07 UTC  the first block of the PIVX network was created.\n\nWhile the initial idealization of PIVX was originated by three individuals (Coin-Server, s3v3nh4cks, and Stakebox), the development and direction of the project remained stewarded and directed by the community. That being said, none of the initial founders have been active since late 2018.\n\nThe development since 2018 has been spearheaded by three core blockchain developers (Fuzzbawls, Furzy, and Random.Zebra) with over 20 years of combined blockchain development.  Their combined efforts has continuously placed PIVX in the top 10 most actively developed blockchain projects according to messari and cryptomiso.  The rest of the PIVX ecosystem ranging from marketing, web development, business development, and social media has been actively overseen by other members of the community, many of whom have been involved since PIVX's inception.\n\nHow Many PIVX Coins Are In Circulation?\n---------------------------------------\n\nPIVX creates a new block every 60 seconds. Each of these blocks create 5 new PIV, and allocates 1 new PIV.  What does 'allocate' mean? To understand that, the PIVX governance model needs to be understood.\n\nThe PIVX governance model is a system that allows for funding to be generated for community proposals.  Proposals are submitted to the system by the community, and they are voted on once a month. Those proposals that \"pass\" are issued the funds they have requested.  This fund issuance occurs in a \"Super Block\", which occurs every 30 days.  The available funds for each Super Block equals the number of blocks since the last Super Block, times the number of PIV allocated for the Super Block from each block.   The math here is fairly simple, especially since this is where the one 'allocated' PIV comes into play.  One PIV per block, and one block every minute, for 24 hours for 30 days works out to be 30 days x 24 hours a day x 60 minutes per hour x 1 PIV per block.  30x24x60x1 = 43,200 PIV allocated to the Treasury per Super Block.  This forms the \"budget\" available for the proposals.\n\nIt is possible that exactly 43,200 PIV can fund passing proposals, with nothing remaining. But, this is rare.\n\nMost of the time, a very high percentage (Usually 95% or more) of the allocated 43,200 PIV is created to fund proposals. As such, it is reasonable  to estimate inflation to be based on 6 PIV per block being created. However, it is important to realize this is not exact. It is also important to realize that the PIV for Treasury funds is created at the Super Block, whereas the other 5 PIV is created with each standard block.\n\nReward Distribution\n-------------------\n\n-   2 PIV per block is created and paid to the staker that wrote the block.\n\n-   3 PIV per block is created and paid to the next masternode in the payment queue.\n\n-   1 PIV per block is allocated to the Treasury Budget and [may be] created with the Super Block and paid to a funded proposal.\n\nMaximum Coin Supply \n--------------------\n\nThe numbers below represent the theoretical maximum coin supply. The actual number will be determinant upon transaction fee burning and allocated  PIV not required, of the maximum possible monthly budget generation. As a result of these factors, the actual number will most likely be less than these theoretical maximums.\n\nBy June 2040: 125,929,497 PIV \n\nBy June 2060: 189,001,497 PIV", "dateAdded": "2016-02-13T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T08:36:03.000Z", "watchCount": "16300", "dateLaunched": "2016-01-30T00:00:00.000Z", "launchPrice": 0.00115566, "tags": [{"slug": "pos", "name": "PoS", "category": "CONSENSUS_ALGORITHM"}, {"slug": "medium-of-exchange", "name": "Medium of Exchange", "category": "PROPERTY"}, {"slug": "store-of-value", "name": "Store of Value", "category": "PROPERTY"}, {"slug": "privacy", "name": "Privacy", "category": "PROPERTY"}, {"slug": "zero-knowledge-proofs", "name": "Zero Knowledge Proofs", "category": "PROPERTY"}, {"slug": "masternodes", "name": "Masternodes", "category": "PROPERTY"}, {"slug": "staking", "name": "Staking", "category": "PROPERTY"}, {"slug": "dao", "name": "DAO", "category": "PROPERTY"}], "selfReportedTags": ["PoS", "POS 3.0", "PIVX", "Staking", "Masternodes", "DAO", "Privacy", "Zero Knowledge Proofs", "Quantum-Resistant", "Payments", "Store of Value", "Medium of Exchange"], "urls": {"website": ["https://pivx.org"], "technical_doc": ["https://pivx.org/whitepaper"], "explorer": ["https://explorer.pivx.link/", "https://blockbook.pivx.link/", "https://chainz.cryptoid.info/pivx/"], "source_code": ["https://github.com/PIVX-Project/PIVX/"], "message_board": ["https://forum.pivx.org/"], "chat": ["https://discord.pivx.org", "https://t.me/PIVXChat"], "announcement": ["https://bitcointalk.org/index.php?topic=1262920"], "reddit": ["https://reddit.com/r/pivx"], "twitter": ["https://twitter.com/_pivx"]}, "volume": 620679.13611247, "volumeChangePercentage24h": 2.3682, "statistics": {"price": 0.57602141614899, "priceChangePercentage1h": 2.32181007, "priceChangePercentage24h": 5.14569276, "priceChangePercentage7d": 13.9882962, "priceChangePercentage30d": 8.74495291, "priceChangePercentage60d": -31.19630616, "priceChangePercentage90d": -69.1324892, "marketCap": 37545416.86, "marketCapChangePercentage24h": 5.1457, "fullyDilutedMarketCap": 37545416.86, "fullyDilutedMarketCapChangePercentage24h": 15.28, "circulatingSupply": 65180591.91255394, "totalSupply": 65180591.91255394, "marketCapDominance": 0.0023, "rank": 496, "roi": 49735.47601747, "low24h": 0.51593268, "high24h": 0.57651535, "low7d": 0.49327018, "high7d": 0.57651535, "low30d": 0.43214366, "high30d": 0.6500668, "low90d": 0.42947846, "high90d": 2.14148823, "low52w": 0.26740167, "high52w": 4.66162089, "lowAllTime": 0.00042197, "highAllTime": 9.19639206, "lowAllTimeChangePercentage": 136407.67, "highAllTimeChangePercentage": -93.74, "lowAllTimeTimestamp": "2016-02-16T03:09:27.000Z", "highAllTimeTimestamp": "2018-01-23T02:54:07.000Z", "lowYesterday": 0.51593268, "highYesterday": 0.56744917, "openYesterday": 0.53802657, "closeYesterday": 0.55461253, "priceChangePercentageYesterday": 3.08, "volumeYesterday": 676646.57, "turnover": 0.01653142, "ytdPriceChangePercentage": 81.4776}, "relatedCoins": [{"id": 1908, "name": "Nebulas", "slug": "nebulas-token", "price": 0.33441811627088, "priceChangePercentage24h": -0.45263377, "priceChangePercentage7d": 10.12211704}, {"id": 3992, "name": "COTI", "slug": "coti", "price": 0.14043007905819, "priceChangePercentage24h": 6.37697634, "priceChangePercentage7d": 14.24252337}, {"id": 5957, "name": "DFI.Money", "slug": "yearn-finance-ii", "price": 3231.28242787981, "priceChangePercentage24h": 28.31161121, "priceChangePercentage7d": 21.54606228}, {"id": 3911, "name": "Ocean Protocol", "slug": "ocean-protocol", "price": 0.47651822201064, "priceChangePercentage24h": 3.20719477, "priceChangePercentage7d": 22.25064488}, {"id": 2765, "name": "XYO", "slug": "xyo", "price": 0.00616076579414, "priceChangePercentage24h": -2.35801389, "priceChangePercentage7d": 38.32479565}, {"id": 4769, "name": "EOS Force", "slug": "eos-force", "price": 0.02167080728287, "priceChangePercentage24h": 11.56281176, "priceChangePercentage7d": -8.22716493}, {"id": 4691, "name": "Zano", "slug": "zano", "price": 2.50369162175619, "priceChangePercentage24h": 1.16843373, "priceChangePercentage7d": -7.58145699}, {"id": 7737, "name": "API3", "slug": "api3", "price": 4.24010818230717, "priceChangePercentage24h": 15.62763691, "priceChangePercentage7d": 25.38415584}, {"id": 6187, "name": "Serum", "slug": "serum", "price": 3.8553289630899, "priceChangePercentage24h": 6.31949705, "priceChangePercentage7d": 33.34669926}, {"id": 3783, "name": "Ankr", "slug": "ankr", "price": 0.08357775185461, "priceChangePercentage24h": 0.60331581, "priceChangePercentage7d": 34.58295846}], "relatedExchanges": [{"id": 270, "name": "Binance", "slug": "binance"}, {"id": 311, "name": "KuCoin", "slug": "kucoin"}, {"id": 495, "name": "Folgory", "slug": "folgory"}, {"id": 22, "name": "Bittrex", "slug": "bittrex"}, {"id": 350, "name": "CoinEx", "slug": "coinex"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T08:36:43.282Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "17", "credit_count": 0}}