{"data": {"id": 2524, "name": "Universa", "symbol": "UTNP", "slug": "universa", "category": "token", "description": "## What Is Universa Blockchain?\n\nUniversa Blockchain is the platform and the protocol intended for decentralized storage of the trust/validity for modifiable smart contracts, focused on real-world businesses and digitizing/tokenizing the business processes with minimum interference to the established existing infrastructure. Each smart contract in Universa is a [Ricardian-style contract](https://en.wikipedia.org/wiki/Ricardian_contract), a structured document that can store the static data (both invariant and modifiable), as well as a set of permissions, roles, references to other documents, and requirements needed to edit the stored data. This allows for easy digitizing and “tokenizing” a wide spectrum of various documents, from regular fungible assets (currencies/fungible tokens/commodities) to non-fungible entities (“square meters” of land of different class, real estate, unique items and objects of art) or any other complex documents – including but not limited the role-access-based DAO management controlling issuance of these documents.\n\nTo prevent the Sybil attacks possible in permission-less blockchains, the Universa Blockchain uses the permissioned approach to nodes, requiring a license for node ownerships and doing the liberal but mandatory real-world verification of the node owners, preventing unsolicited collection of the network control power by one party (or related parties). The consensus mechanism is **Proof-of-Authority**, and the network uses the **BFT-safe** algorithms raising the limits of attack from “51% of the network” typical for other blockchains to “**90% + 1**” for positive consensus.\n\nThese features, as well as off-chain storage of smart contract data and “immediate consistency” of network-stored data (compared to typical “eventual consistency” of many other blockchains), all of that backed by **25,000+ TPS** capable network, and the transaction fees programmatically bound to be as low as **€0.01** in most basic scenarios, make Universa Blockchain a good option for not just the “financial transactions” or “money/asset transfer” but for digitizing the document workflow and business processes in real world.\n\n**UTN** is the native utility token in Universa Blockchain needed for:\n\n* paying the network fees for registering any transaction in Universa Mainnetwork,\n* staking/locking the amount when licensing a node in Universa Mainnetwork,\n* paying the network fees and running the nodes, when deploying any Universa-based private networks in official partnership with Universa,\n* also, to pay for technical utilization of some other subsystems of Universa Blockchain ecosystem (such as UBots).\n\nTo simplify obtaining the Universa-based UTN token at existing exchanges, a “placeholder” **UTNP** token created in Ethereum network as ERC20 token, swappable to native UTN token 1:1 (+ involved network fees).\n\nThere are many subsystems, sites and products forming the Universa infrastructure and ecosystem, such as (but not limited to):\n\n* [Knowledge Base](https://kb.universablockchain.com/), an extensive and comprehensible place with all the data, specifications and technical information on Universa in one single place.\n* [UBots](https://kb.universablockchain.com/ubots/207) is the Universa approach to decentralized computing, allowing people to run the dApps written on regular modern JavaScript. The dApps can be executed with controllable granularity (number of UBot executions to launch, consensus level to require) and don’t require additional “oracles” to access the real-world APIs as they can access the out-of-blockchain data just directly. UBots are controlled and billed through the Universa smart contracts.\n* [Hypertokens](https://kb.universablockchain.com/basics_and_main_concepts/59) subsystem makes it possible to represent the cryptocurrencies external to Universa (Bitcoin, Ether) in a form of Universa smart contracts/tokens (uBTC, uETH) which can be then used in regular Universa smart contract references, attached to other smart contracts, used as smart contract conditions etc.\n* [Parsec](https://kb.universablockchain.com/parsec_1_specifications/303) is the work-in-progress family of protocols merging together decentralized control on the domain names (normally performed through centralized DNS system), and the decentralized control over network security certificates (and normally performed through the infrastructure of centralized SSL Certificate Authorities), effectively making the domains and certificates end-user controlled, having their data stored in Universa smart contracts.\n* UDNS, or UNS2, is the subsystem of Parsec which can be used independently of it, to ensure non-authority-revocable (or -overridable) domain names management. It can be deployed on enterprise/regional/country scale and be transparently accessed by end users through regular DNS/DoH protocols, while still storing the data in a decentralized way in Universa smart contracts.\n* [U8](https://kb.universablockchain.com/u8/150) is the in-house built JavaScript runtime, based on V8 JS engine, with numerous performance and asynchronous execution improvements specifically for Universa purposes, used throughout many Universa projects as a server-side backend (used in UBot servers, UDNS, Parsec servers, to run the test Universa nodes etc) but can also be used for any Universa-connected applications, or even for regular non-Universa apps.\n* [UDC](https://kb.universablockchain.com/udc/251) is the ready-to-launch country/enterprise scale solution for deploying a CBDC-style digital currency. Fully supports DAO-style management of the DC issuance, flexible role-based access control (through the standard Universa smart contracts features as well), end-user wallet applications, PoS usage, etc. Among the other users, a notable usage case is the DC deployed in Tunisia by Universa Hub Africa.\n* [UnitedFi](https://borodich.medium.com/defi-universa-united-fi-e8664a6d4b2b) is the DeFi solution announced late 2020, which doesn’t just try to squeeze profits for its users by automated algorithmic models from various “token-only” operations (as most DeFis do), but merges the world of real businesses and real-world assets generating income, with the ecosystem of smart contracts and blockchains, tokenizing the real-world income for its DeFi users.\n\n### How Many UTN/UTNP Tokens Are There in Circulation?\n\nThe UTN/UTNP token sale **lasted from October 28, 2017 to December 09, 2017**, and the total amount of tokens calculated after the token sale completion was **4,997,891,952**. This is the maximum possible supply of UTN or UTNP, as the new tokens cannot be generated subsequently, “get mined” or somehow else appear after the initial Token Generation Event. The total supply is fixed by the means of Solidity source in ERC20 UTNP contracts, and by creating the UTN smart contract as a fungible one but without the permissions for any possible future re-issues.\n\nThe live and functioning Testnet (and the end user web client, together with CLI tools for developers) was launched during the second week of token sale, on **November 07, 2017**; and on **April 12, 2018**, the Mainnet went live.\n\nWhen UTN and UTNP tokens were created, both were created with 4,997,891,952 total supply; but for every amount of UTN tokens in circulation, there is an according amount of UTNP tokens locked in swap system (due to UTN and UTNP being swappable 1:1), and vice versa. This makes the maximum circulating supply of token strictly equal to **4,997,891,952**, no matter if in UTN or UTNP form (cause the rest, in a different form, is locked for future swaps). The factual circulating supply may be lower due the tokens never claimed, never yet moved, untouched team tokens etc.\n\nUTN tokens are used to pay fees for network usage of Universa Blockchain (and its subsystems); the fees are then split 80% / 20% between all the nodes using the network and the Universa Foundation. Universa Foundation reserves the right to “burn” up to 1% of received fees so the total / circulating supplies can decrease in the future.\n\n## What Makes Universa Blockchain Unique?\n\nUniversa Blockchain aims to merge the blockchain concepts and the real world easily and transparently, not requiring to replace the existing established businesses processes but supplementing them, and it is heavily focused on bringing the benefits of blockchains to real businesses and satisfying the needs of these businesses (thus bringing them into the blockchain world), rather than focusing on the internal needs of pre-existent blockchain community.\n\nAs a major and one of the defining aspects, the primary “building block” and processed concept in Universa Blockchain is a Ricardian-style smart contract (unlike something like “a value transfer”, or “a dApp deployment/execution”), a serialized structured document. Contrary to the approach popular since Ethereum, the smart contract is not a dApp (an active actor that performs operations defined in program code); but it is a passive binary structured document, with the rules and references and requirements defined in it, editable throughout its life cycle and maintaining its own integrity. All the other concepts (including the value transfers e.g. tokens, DAO management, complex condition-based cases of asset ownership etc) can be defined in a form of such documents.\n\nAlso, contrary to the blockchain practice since the Bitcoin launch, the raw data of the transactions (registrations and modifications of the smart contract data) and their history is typically not stored in the blockchain – it is the responsibility of the client side to store it and provide a valid and bit-invariant version of the previous smart contract to register a new revision, somewhat similar to Pay-to-Script-Hash concept in Bitcoin. The Mainnet clients and users of the Universa web client can use the Crypto Cloud storing these smart contracts with end-user-encryption; the enterprise clients can utilize this feature to easily extend the existing data storage warehouses with blockchain features (rather than replacing them), or to use different data storage approaches (like, a complete smart contract can be stored inside the NFC tag on a shipping container).\n\nDue to the Proof-of-Authority consensus and real-world checks of the node owners, the network can be truly decentralized, not just theoretically or academically. Also, for the same reason, the network structure is rather stable and predictable, what increases the overall network performance (25,000+ TPS depending on transaction scenarios) and makes it possible to ensure predictably fast consensus: the network consensus in Universa is not “eventual”, and the transaction cannot be reverted just due to the different orphan/uncle chain mined. Therefore with Universa, the user doesn’t have to wait for “6/12 confirmation blocks” to be *reasonably* sure his transaction of interest won’t be rolled back by the network; if the Universa network made a consensus on a data, it won’t revert it anymore, so a “0 confirmation blocks” estimate can be used to be *definitely* sure in transaction.\n\n\n## Who Are the Founders of Universa Blockchain?\n\nUniversa Blockchain was founded by Alexander Borodich (CEO) and Sergey Chernov (CTO) in 2017, as a result of numerous years of collaboration and past cryptography projects, in a need to bridge the gap between the theoretical perfectionism of blockchain projects and practical rationalism of real-world businesses.\n\nFormer marketing director of Mail.ru Group, Alexander Borodich establishes [real-world connections and partnerships](https://borodich.medium.com/from-national-blockchain-to-defi-f1431eed5370), ranging from turning Universa into the basement for [national blockchain in Tunisia](https://tn24.tn/fr/article/tunisie-internet-et-universa-hub-africa-lancent-le-premier-reseau-national-de-blockchain-en-tunisie-278631), to tokenizing the raw sugar and [setting up the raw sugar commodity exchange](https://www.dmcc.ae/news/dmcc-al-khaleej-sugar-and-universa-launch-online-sugar-trading-platform) in Dubai together with Al Khaleej Sugar and DMCC.\n\nWith [30+ years of industry experience](https://www.linkedin.com/in/sergey-chernov-32a10418/), former CTO and head of development in Cybiko (one of the earliest handheld computers) Sergey Chernov brings his skills, security expertise and team management capabilities to direct the team of developers, distributed over multiple countries, as well as supporting the stability and the availability of Universa Blockchain network, similarly distributed over multiple continents and datacenters.\n\n## Where Can I Buy Universa Blockchain tokens (UTNP or UTN)?\n\nUTNP (ERC20 token) is available for trading on various exchanges, most notably IDCM ([UTNP/ETH](https://www.idcm.cc/trading/UTNP_ETH) and [UTNP/BTC](https://www.idcm.cc/trading/UTNP_BTC) pairs) and Bilaxy ([UTNP/ETH](https://bilaxy.com/trade/UTNP_ETH) pair). \n\nUTN (native Universa token) is not yet traded on any exchange directly.", "dateAdded": "2018-02-15T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T08:44:33.000Z", "watchCount": "2449", "dateLaunched": "2017-07-28T00:00:00.000Z", "launchPrice": 0.01, "tags": [{"slug": "marketplace", "name": "Marketplace", "category": "PROPERTY"}, {"slug": "enterprise-solutions", "name": "Enterprise solutions", "category": "PROPERTY"}], "selfReportedTags": ["Smart Contracts", "Enterprise solutions", "DApp", "Ethereum", "PoA", "PoA"], "urls": {"website": ["https://universablockchain.com/"], "technical_doc": ["https://universablockchain.com/files/whitepaper.pdf"], "explorer": ["https://etherscan.io/token/0x9e3319636e2126e3c0bc9e3134AEC5e1508A46c7", "https://ethplorer.io/address/0x9e3319636e2126e3c0bc9e3134AEC5e1508A46c7", "https://universaexplorer.com/"], "source_code": ["https://github.com/UniversaBlockchain/"], "message_board": [], "chat": ["https://t.me/Uplatform"], "announcement": [], "reddit": ["https://reddit.com/r/Universa"], "twitter": ["https://twitter.com/Universa_News"]}, "volume": 2654.7255269, "volumeChangePercentage24h": -56.7072, "statistics": {"price": 0.00403699247804, "priceChangePercentage1h": 0.80717985, "priceChangePercentage24h": 14.02326606, "priceChangePercentage7d": 35.95292852, "priceChangePercentage30d": 57.81993216, "priceChangePercentage60d": 27.86666218, "priceChangePercentage90d": -11.34929268, "marketCap": 0.0, "marketCapChangePercentage24h": 0.0, "fullyDilutedMarketCap": 20176452.22, "fullyDilutedMarketCapChangePercentage24h": 73.01, "circulatingSupply": 0.0, "totalSupply": 4997891952.0, "maxSupply": 4997891952, "marketCapDominance": 0.0, "rank": 4459, "roi": -59.62290067, "low24h": 0.00339471, "high24h": 0.00404101, "low7d": 0.00233139, "high7d": 0.00404101, "low30d": 0.0009836, "high30d": 0.00404101, "low90d": 0.0009836, "high90d": 0.00564719, "low52w": 0.00083175, "high52w": 0.00808756, "lowAllTime": 0.0007787, "highAllTime": 0.05475812, "lowAllTimeChangePercentage": 418.43, "highAllTimeChangePercentage": -92.63, "lowAllTimeTimestamp": "2019-02-14T17:36:03.000Z", "highAllTimeTimestamp": "2018-02-17T13:09:21.000Z", "lowYesterday": 0.00321225, "highYesterday": 0.00403944, "openYesterday": 0.0037381, "closeYesterday": 0.00399421, "priceChangePercentageYesterday": 6.85, "volumeYesterday": 4899.71, "ytdPriceChangePercentage": 76.0473}, "platforms": [{"contractId": 1027, "contractAddress": "0x9e3319636e2126e3c0bc9e3134AEC5e1508A46c7", "contractPlatform": "Ethereum", "contractPlatformId": 1, "contractChainId": 1, "contractRpcUrl": ["https://bsc-dataseed1.binance.org", "https://bsc-dataseed.binance.org/", "https://bsc-dataseed1.binance.org:443"], "contractNativeCurrencyName": "Ethereum", "contractNativeCurrencySymbol": "ETH", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://etherscan.io", "contractExplorerUrl": "https://etherscan.io/token/0x9e3319636e2126e3c0bc9e3134AEC5e1508A46c7", "contractDecimals": 18, "platformCryptoId": 1027}], "relatedCoins": [{"id": 6810, "name": "CYCLUB", "slug": "cyclub", "price": 0.03292734801586, "priceChangePercentage24h": 7.79586113, "priceChangePercentage7d": 29.16668776}, {"id": 8175, "name": "COVER Protocol", "slug": "cover-protocol-new", "price": 234.97247218644387, "priceChangePercentage24h": 1.280701, "priceChangePercentage7d": 5.32576707}, {"id": 7859, "name": "Badger DAO", "slug": "badger-dao", "price": 12.19324417173584, "priceChangePercentage24h": 3.63859119, "priceChangePercentage7d": 46.97907857}, {"id": 7747, "name": "reflect.finance", "slug": "reflect-finance", "price": 0.12384367520213, "priceChangePercentage24h": 23.50278285, "priceChangePercentage7d": 14.67144811}, {"id": 7749, "name": "Paypolitan Token", "slug": "paypolitan-token", "price": 0.08368295983293, "priceChangePercentage24h": 2.47865922, "priceChangePercentage7d": 16.39180695}, {"id": 6811, "name": "Fee Active Collateral Token", "slug": "fee-active-collateral-token", "price": 0.02395128071732, "priceChangePercentage24h": 2.65542755, "priceChangePercentage7d": 11.86315428}, {"id": 7718, "name": "Combo", "slug": "combo", "price": 0.00150330502636, "priceChangePercentage24h": 2.37776276, "priceChangePercentage7d": 4.11953378}, {"id": 7425, "name": "PayAccept", "slug": "payaccept", "price": 0.05709304152541, "priceChangePercentage24h": 3.13263661, "priceChangePercentage7d": 12.35865649}, {"id": 7720, "name": "DefHold", "slug": "defhold", "price": 49.40755677216127, "priceChangePercentage24h": 3.47995912, "priceChangePercentage7d": 15.40095928}, {"id": 6870, "name": "OIN Finance", "slug": "oin-finance", "price": 0.12624974858803, "priceChangePercentage24h": 7.80176372, "priceChangePercentage7d": 3.16713568}], "relatedExchanges": [{"id": 421, "name": "IDCM", "slug": "idcm"}, {"id": 415, "name": "Bilaxy", "slug": "bilaxy"}], "wallets": [{"id": 9022, "name": "Trust Wallet", "tier": 1, "url": "https://www.trustwallet.com/", "chains": "ETH", "types": "app,trade", "introduction": "", "star": 2.0, "security": 3.0, "easyToUse": 3.0, "decentration": true, "focusNumber": 0, "rank": 1000008, "logo": "9022.png", "multipleChain": true}, {"id": 9025, "name": "MetaMask", "tier": 1, "url": "https://metamask.io/", "chains": "ETH,ETZ", "types": "pc", "introduction": "", "star": 1.0, "security": 2.0, "easyToUse": 4.0, "decentration": false, "focusNumber": 0, "rank": 1000013, "logo": "9025.png", "multipleChain": true}], "isAudited": false, "holders": {"holderCount": 12257, "holderList": [{"address": "0x884191033518be08616821d7676ca01695698451", "balance": 1834313924.7, "share": 36.7}, {"address": "0x4ec8654aa6a412846562d168f6183cf7667fd88a", "balance": 790019386.57, "share": 15.81}, {"address": "0x37d15d5aaf275ae46dec6974a665f0a5ee21b5e4", "balance": 149074065.1, "share": 2.98}, {"address": "0xfc368dde12587f61366a0496bde025ad381f8617", "balance": 135674542.32051602, "share": 2.71}, {"address": "0x9408a1d6faec18417555fe11157809f9926a8aff", "balance": 103518276, "share": 2.07}, {"address": "0x2a1dcbdf3fc17c7263529aa7fb1f90e3d4624ed2", "balance": 80000000.0, "share": 1.6}, {"address": "0x91d829093be98b32d09afd2ad94b0c5675b3cb6f", "balance": 64172812, "share": 1.28}, {"address": "0x8a81602f78d984c90ed37224328ef949313dfe0b", "balance": 50000000.0, "share": 1}, {"address": "0x151b8c9b88a01e825a01bec51cf76536e75db670", "balance": 47816667.84, "share": 0.96}, {"address": "0x0e416b0ff3820fc1b4b8d6b634b98c33afcf9610", "balance": 37995906, "share": 0.76}, {"address": "0x0dd51923795165259f6c37fe10fd99462bced28e", "balance": 37767084.8898097, "share": 0.76}, {"address": "0xcce8d59affdd93be338fc77fa0a298c2cb65da59", "balance": 36418818.81682726, "share": 0.73}, {"address": "0x8072b46aaf546579a58411a19ab2bb800652f809", "balance": 31013229.97930126, "share": 0.62}, {"address": "0x8b2b3d18230661157d399226686d91b2fc340a30", "balance": 31009886.25603596, "share": 0.62}, {"address": "0x1419d2c182dfaf335d87a67088940f183236f6e5", "balance": 30211782, "share": 0.6}, {"address": "0x3d3b13d3a1ece4b9b19ccc4092451321810e4b3b", "balance": 30000000.0, "share": 0.6}, {"address": "0xd701edf8f9c5d834bcb9add73ddeff2d6b9c3d24", "balance": 26918462.145624164, "share": 0.54}, {"address": "0xa12431d0b9db640034b0cdfceef9cce161e62be4", "balance": 21853346.30680216, "share": 0.44}, {"address": "0xc7bae6a7983dbc0516b55385ba1409d44bd369a8", "balance": 20900000.0, "share": 0.42}, {"address": "0xbe41d37eb2d2859143b9f1d29c7bc6d7e59174da", "balance": 18428011.31641308, "share": 0.37}, {"address": "0x0d9a115b6c0688bbf5b41d17452e31688f3ce013", "balance": 16890481.66079955, "share": 0.34}, {"address": "0x559607e1254ebc3504bc3fe2025773e84adf3773", "balance": 15987772, "share": 0.32}, {"address": "0x742d35cc6634c0532925a3b844bc454e4438f44e", "balance": 14000000.0, "share": 0.28}, {"address": "0x625decb5b5311e41fad95898a8e813b53722a277", "balance": 13500000.0, "share": 0.27}, {"address": "0x0430280925dbf60d0cc8fb8792db4286ff45e969", "balance": 13105081.15, "share": 0.26}, {"address": "0x6a355e7e89301245566eb49130e2f3a45f26aa8b", "balance": 12637682.94054397, "share": 0.25}, {"address": "0x187498a336554e81ffd58c55731da128c7d78ebc", "balance": 12006002.58000004, "share": 0.24}, {"address": "0xb39c00f0ad385812d9053337541dd6eab58e29af", "balance": 10000006, "share": 0.2}, {"address": "0x11b9a831e17b12385d816ce1438f8774113a3000", "balance": 10000000.0, "share": 0.2}, {"address": "0x48f192fd78d73912e29b5f3aa01574f6af16f9dd", "balance": 9701244.36025654, "share": 0.19}, {"address": "0xac0bab03a269c3502299b7b0a4060aa3bbd7efeb", "balance": 9568204.27584529, "share": 0.19}, {"address": "0x7b78d9e658950a8a8fe876d0e022f4dc70f2d711", "balance": 9562981.07, "share": 0.19}, {"address": "0x055fdee77b507b2dddd5502e1769ed2ed758a923", "balance": 9468308.46671166, "share": 0.19}, {"address": "0x35a7b8deaa8b481a686665d0162dfcc6453b6c50", "balance": 9401975.43629, "share": 0.19}, {"address": "0x4a726e541194ea7eb2a17f5f6fe8c0805d2fa616", "balance": 9180910.98309602, "share": 0.18}, {"address": "0x9afbfe85c2eda0f46815974c74a1f663672b9079", "balance": 8354159.23, "share": 0.17}, {"address": "0x30c064cca6cdacc045c63973beab0fbd27aedb78", "balance": 8345213.84, "share": 0.17}, {"address": "0xf1b5c07534633f74eed018f02047f42a10bb6263", "balance": 8000000.0, "share": 0.16}, {"address": "0x6ee06cd090937e6b768461fc81825762815e223a", "balance": 7974561.472750815, "share": 0.16}, {"address": "0x109fba4915eaceca2d583a8df803528f70328436", "balance": 7840000.0, "share": 0.16}, {"address": "0x8ce803a51f77951b174c6c8bcd9531f3bf1b96eb", "balance": 7397909.74552953, "share": 0.15}, {"address": "0x69fe038b2d84762c3d5d08b33895a0081c39e607", "balance": 7378674.09149466, "share": 0.15}, {"address": "0x7c6db7bb72bddf978b3d5d13925fb348636856a9", "balance": 6792398.5340801, "share": 0.14}, {"address": "0x20885e9108156b4fc9fea621d733b6d67f5c5bab", "balance": 6498096.19491757, "share": 0.13}, {"address": "0x47bb370779e93d8b999e7470dcf81475ecbded82", "balance": 6400000.0, "share": 0.13}, {"address": "0x650cff4b2754dbdd3eb71e3fe84329c26687b9db", "balance": 6315986, "share": 0.13}, {"address": "0xb4e97aa92eb79313d9e470b66416a5a8054f9230", "balance": 6307582.1, "share": 0.13}, {"address": "0xdd8b2ab5c63c0a6c69be5dd6e256f4b564cb9b4b", "balance": 6303602, "share": 0.13}, {"address": "0xb00fc3352b0468437922de3d48d8ee42d61b4729", "balance": 6250000.0, "share": 0.13}, {"address": "0xc5a3b7c20a8bf1ebaf242cf3e7e2566ca70d2ef7", "balance": 6231532.84, "share": 0.12}, {"address": "0xe3f221a6675d8662ec37b8e2e3e319dee0f4de70", "balance": 6207460.71157077, "share": 0.12}, {"address": "0x8c83dfd8d6f6a11d6572d3938d7de433b2422fd8", "balance": 6200000.0, "share": 0.12}, {"address": "0xa3d5ef50485b12fadf7416b2c6aa42521b4379d6", "balance": 6199516.42030663, "share": 0.12}, {"address": "0x19ecebac736252471550c3577a4f7a4c6bf0666c", "balance": 6198277.673224662, "share": 0.12}, {"address": "0xc60e8c2eea5834b227626cabdfee06c84b4fea93", "balance": 6083848.7626464, "share": 0.12}, {"address": "0x17b142bf8763a794db1e9529ca3844890e633484", "balance": 5914000.0, "share": 0.12}, {"address": "0x4937f2fadee252dd3c485c20b4d13899c100071f", "balance": 5714285, "share": 0.11}, {"address": "0xef4bb63791329e073dba5be08c3565ae31fbf52d", "balance": 5448867.7084565, "share": 0.11}, {"address": "0xffe6b4d0088ddacd9eeeeafc2ce50bd4fb3e9bbd", "balance": 5286225.87, "share": 0.11}, {"address": "0xf035beb8075a31a6282d68dd3334eec3a75df8fb", "balance": 5131181.59969824, "share": 0.1}, {"address": "0x67024ab10761114c2c7276f6ce57a8d5fcc4e176", "balance": 5062853.9999, "share": 0.1}, {"address": "0x5b8e9c2e1aea9576317093c435cf531ad0c7249b", "balance": 5000000.0, "share": 0.1}, {"address": "0x80a143613d2146a80fdfeed0f040351d848f3144", "balance": 5000000.0, "share": 0.1}, {"address": "0x21b13ac3e5d5d8d1f80f5f8e7c289c515969fb5b", "balance": 5000000.0, "share": 0.1}, {"address": "0x9b7936646e8074c86affe702df84db1fa203cdd1", "balance": 5000000.0, "share": 0.1}, {"address": "0x7584016a294065599b5223b45ea2b72dc984b49f", "balance": 5000000.0, "share": 0.1}, {"address": "0x740dc0614918c3f1a4ad176bcb8f4dcc39a9bf62", "balance": 4920722.86946155, "share": 0.1}, {"address": "0x932db57710c5fe4aef41cd513fe682ef04a73f25", "balance": 4634856.42, "share": 0.09}, {"address": "0xccfd9bfcfc679f2633c1c835f3113cf7f985b5a7", "balance": 4558318.35088617, "share": 0.09}, {"address": "0x557a65b74812231dc40c95104c66c0a5f4bda63f", "balance": 4542295.56782608, "share": 0.09}, {"address": "0x5b88702b2f389035f140e6ddd76057410d0852b7", "balance": 4536613, "share": 0.09}, {"address": "0xe89d04d7e1bea0194f455b9e47f612c478c8756f", "balance": 4402146.89, "share": 0.09}, {"address": "0x9e3319636e2126e3c0bc9e3134aec5e1508a46c7", "balance": 4344324.685724881, "share": 0.09}, {"address": "0x5ff24fd33a847529bf3d76d1652c2a2892c01451", "balance": 4300000.35222489, "share": 0.09}, {"address": "0xa6f2b7c395f7c63d7e1f562f0d76a38afa67cba0", "balance": 4180728.51, "share": 0.08}, {"address": "0xa99dbd6640adeda8642200d61b9f7aa800079b70", "balance": 4172350.0, "share": 0.08}, {"address": "0x1e5761b9c4848cb01fc9f4768a419b25ca5fcf65", "balance": 4163178.98973044, "share": 0.08}, {"address": "0xe81ca78909ae6afdc7fa14ab8a1636df43c1420a", "balance": 4136109.738002, "share": 0.08}, {"address": "0xf7f232c8227fa5999b34a61021147ef460747b8f", "balance": 4091723, "share": 0.08}, {"address": "0x18ba96208d43a6999b13d1f0d155117f571d846b", "balance": 4069535.95, "share": 0.08}, {"address": "0x289bc7d85f26aa4251ae8048ccd99fa9d7e2e2c3", "balance": 4055227.67, "share": 0.08}, {"address": "0x7c705fb17ef8ebe969e282825fa9eed390e152e7", "balance": 4050000.19430092, "share": 0.08}, {"address": "0x5ccb581c9c61fa945a3b588dbcf4d441620a8443", "balance": 4029403.55692658, "share": 0.08}, {"address": "0x9fd652895c43e24bb6a6987bef244ec042578ea4", "balance": 4000000.0, "share": 0.08}, {"address": "0xba7a7b442fda39d8c3d069a32c70b0a7bbebde3e", "balance": 3999780.16, "share": 0.08}, {"address": "0x0c446fa7237fcf2f91ecdff54cf64afa23805c3e", "balance": 3969875, "share": 0.08}, {"address": "0xf20e4bc86c482b1232556fc7f7aa1d7479bc6c45", "balance": 3958660.4125615, "share": 0.08}, {"address": "0xd4347d76580428400522642e77fb44606b742348", "balance": 3941901, "share": 0.08}, {"address": "0x07fb9f51685c55c2051e7dce13ca8196b01ddaa7", "balance": 3902075, "share": 0.08}, {"address": "0x2bab67cef4e7dca647893a02031f32c82668ad57", "balance": 3896355.21601111, "share": 0.08}, {"address": "0x0187936855d8de17665075f12358797b01596be3", "balance": 3895709.9116677, "share": 0.08}, {"address": "0xd74333c493f4ff20cc4d7b1d171b79046cbb4e2b", "balance": 3835132.62485551, "share": 0.08}, {"address": "0x80743cf9e97e03a65f5ee59749eb56a6117db06f", "balance": 3726127, "share": 0.07}, {"address": "0x59dc2e818cc72c66ea50a7ae01ca4814f683bc6b", "balance": 3717871.2533175573, "share": 0.07}, {"address": "0x5a9683aeb2e8d6efd6fd3fddb789bbc39243e41d", "balance": 3601425.86682624, "share": 0.07}, {"address": "0xf36ed944da8b048a4298569cc17ae3d301da99dd", "balance": 3592659, "share": 0.07}, {"address": "0xbf620c55e0561be09f1ac2609aa8d4a67915b61d", "balance": 3500000.0, "share": 0.07}, {"address": "0x5518f84c36c5a79b834651bbebde2b766692d1cd", "balance": 3421418.19223135, "share": 0.07}, {"address": "0xd91dae95838e7df436956541377bc65e94adac88", "balance": 3413710.0, "share": 0.07}, {"address": "0x2b9e0e92dd8d23f14296fe65b6a4d428b85e8e6e", "balance": 3369779.008291, "share": 0.07}], "topTenHolderRatio": 65.87, "topTwentyHolderRatio": 71.57, "topFiftyHolderRatio": 77.22, "topHundredHolderRatio": 81.7}}, "status": {"timestamp": "2021-07-31T08:46:21.047Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}