{"data": {"id": 5649, "name": "OZEETY", "symbol": "OZTG", "slug": "ozeety", "category": "coin", "description": "## What Is OZEETY (OZTG)?\nOZEETY (OZTG), the core of Flash Group ecosystem, it’s a proof-of-stake blockchain platform designed to deliver a “utility asset-pegged coin” with a reduced velocity, to enable mainstream usage. OZEETY fits perfectly with Flash Group’s mantra “Financial Inclusion and Beyond”. The OZEETY’s PoS Masternode and mobile node staking rewards is truly an exceptional safe DeFi yield farming solution.\nThe objectives and goals of this project are to make the OZEETY blockchain the cornerstone of the Flash Group’s end to end Fintech ecosystem, supported with real ground breaking hardware and software based solutions consisting of:\n*OZTCARD - Biometric, cold storage, all-in-one smart card\n*Flashcryptostation – A range of Crypto and Fiat based ATMs and Tabletop devices\n*Flashxchanger – A simple omnichannel based Fiat and Crypto exchange \n*Flashwallet – A simple mobile wallet for managing the fiat and crypto based digital banking, with a Pro wallet version under development\n*The OZEETY’s PoS Masternode and mobile node staking rewards corewallet\n*Adchain – The targeted client and ad campaign matching system that shares the revenue with the clients and charity\n*Green Gold extension to OZEETY – The full history on DLT about the gold journey from its ground to the end client.\nThe OZEETY ecosystem is the ultimate platform that enables the access to DLT and a safer asset pegged DeFi based yield farming to the mainstream population that is seeking for a holistic 360º wealth creation solution.\nFlash Group originally developed OZEETY (OZTG) in 2018 using Bitcoin, Dash and PIVX technologies. \nOZTG coin is designed to ensure that owners can participate in the operation of the network. Hence, those who hold the cryptocurrency receive staking rewards on a daily basis and they can also receive masternode rewards if they subscribe to it. These rewards are further accumulated on a daily compounded basis. They further have the right to vote on any proposed changes to the software.\nFlash Group chose to peg the coin with physical assets in order to create a use case for merchants into the acceptance of this coin, rather than the unpredictable cryptocurrency for daily transactions. This stability and predictability make the mainstream users more confident to adopt it. \nOZEETY is designed to be used on a daily basis, with a reduced risk of coin volatility. The growing community of over 50,000 members are now beginning to enjoy the true value of the utility of the OZTG coin and the Masternode staking related yield farming benefits.\n \n### Who Are the Founders of OZEETY?\n \nOZEETY was founded by Serge Maurice Lobreau, CEO & Founder of Flash Group and Sapian Group, as a pioneer in the first Gold Pegged ICO in 2017, raising $72M via an Asset Pegged token in May 2018. He is also Chairman and Founder of Sapian Group, the company that owns OZEETY’s blockchain with his Partner Mru Patel, CEO of Sapian Group and COO of Flash Group.\nIn an interview for Flashgroupnews, Serge Maurice Lobreau said that he got involved in cryptocurrencies back in 2010, when he was still working in the banking industry. DLT has been an “epiphany” for him when he started in mining and trading. After leaving his position in the financial banking industry, he worked for 3 years to complete his vision and further develop his solution. During his travels to South America, Asia and East Africa he witnessed numerous examples of NON financial inclusion that a significant part of humanity is facing.\nAs well as being a Fintech entrepreneur, Serge Maurice Lobréau is also involved in humanitarian actions through his foundation Flashcare. In 2020, his Holding company donated OZTG worth $250,000 to finance the creation of 10 solar solutions for isolated sites, in order to be able to provide drinkable water and solar energy. \n \n \n## What Makes OZEETY Unique?\nOZEETY is one of very few blockchains to use proof-of-stake consensus mechanism, which is more energy efficient than the proof-of-work algorithm relied upon by Bitcoin, along with an enhanced privacy based protocol implementation with a self-funding treasury system, ensuring its sustainability.\n \nOZEETY is further powered by a strong ecosystem with a mix of cutting edge hardware and software solutions especially the Flashwallet, Flashxchanger, OZTcard, and Flashcryptostation, to democratise the usage of the digital coin. The OZEETY Blockchain is unique in the industry due to the fact that, in addition to the hardware and software solution, it also has a Gold-pegged coin.\nIn 2021, OZEETY will upgrade and add an extra layer on top of its blockchain, to create a stable coin for the remittance and DeFi solutions. Serge Maurice Lobreau predicted that the future of our sector belongs to coins linked to a tangible asset that bring real disruption into society.\n#### Related Pages:\n\n[https://flashgroupnews.com/2020/09/18/oztg-coin-and-OZEETY-blockchain-proof-of-stake-with-yield-farming-is-bigger-than-defi/](https://flashgroupnews.com/2020/09/18/oztg-coin-and-OZEETY-blockchain-proof-of-stake-with-yield-farming-is-bigger-than-defi/)\n\n[https://blockleaders.io/the-future-of-digital-banking/\n](https://blockleaders.io/the-future-of-digital-banking/\n)\n\n[https://flashgroupnews.com/2020/08/20/i-think-that-cryptocurrencies-and-blockchain-are-the-future-brock-pierce/](https://flashgroupnews.com/2020/08/20/i-think-that-cryptocurrencies-and-blockchain-are-the-future-brock-pierce/)\n\n[https://flashgroupnews.com/2020/08/10/cryptomonial-engineering-a-new-paradigm-for-crypto-asset-owners/?preview_id=2261&preview_nonce=01e4678dc8&preview=true&_thumbnail_id=2262](https://flashgroupnews.com/2020/08/10/cryptomonial-engineering-a-new-paradigm-for-crypto-asset-owners/?preview_id=2261&preview_nonce=01e4678dc8&preview=true&_thumbnail_id=2262)\n \n### How Many OZEETY (OZTG) Coins Are There in Circulation?\nThere is a maximum supply of 730 Million OZTG — but at the time of writing, there was a circulating supply of about 667 Million. 3 rounds of public sales of OZEETY tokens were held between October 2017 and June 2018.\nOverall, about 30% of OZTG’s total supply went to the development project’s team, with the remaining 70% being split among investors.\n \n### How Is the OZEETY Network Secured?\nOZEETY is secured by design because of masternodes and nodes distribution. The POS consensus is energy efficient because less power is required to power the network. This is further supported by the privacy based protocol implementation with enhancements on the blockchain.\nThe incentive mechanism enables participants rights to receive rewards for their involvement, whether they are just staking OZTG coins or they are running a Masternode.\n \n### Where Can You Buy OZEETY (OZTG)?\nAs one of the few utility asset-pegged cryptocurrencies in the world, you will not find OZTG on many exchanges, because of the speculative mentality ruling those exchanges! You will find OZTG on FlashXchanger, which is an exchange dedicated to asset-backed/asset-pegged coins or any coin with tangible assets. It will also be available on a few other exchanges, with a different vision than the ones who govern major exchanges.\nIf you’re struggling to find a trading pair that unites OZTG with your local currency, check out OZEETY Discord channel HERE. Flash Group and Sapian Group truly are creating a complete ecosystem of hardware and software based solutions to enable Financial Inclusion and beyond whilst delivering several wealth creation and management products and services.\n", "dateAdded": "2020-06-01T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "36", "dateLaunched": "2018-01-01T00:00:00.000Z", "tags": [], "urls": {"website": ["https://www.ozeety.com/", "https://www.flashmoni.com/"], "technical_doc": ["https://drive.google.com/file/d/10tlNa7GwOlaV7ZD7ovmYaOLq5sLSwUlU/view"], "explorer": ["https://ozblock.org/api/block/276f44d587a2ad76242db2a612a8cf389be366fb15d9f4e2948dfda51810b721"], "source_code": ["https://github.com/flashgroupdevs"], "message_board": ["https://blog.flashgroup.io/an-update-report-from-the-chairman-and-ceo/", "https://blog.flashgroup.io/swap-oztg-coin-to-new-ozeetycore-wallet/"], "chat": ["https://discord.gg/UGfXFcnVG4"], "announcement": ["https://bitcointalk.org/index.php?topic=5151388.0"], "reddit": ["https://reddit.com/r/Flashmoni"], "twitter": ["https://twitter.com/Flashmoniltd"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.74544181225554, "priceChangePercentage24h": 39.995782, "priceChangePercentage7d": 57.027243}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.28343128582057, "priceChangePercentage24h": 10.70468806, "priceChangePercentage7d": 21.07822715}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04648050088819, "priceChangePercentage24h": 8.49025741, "priceChangePercentage7d": 20.1832646}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.35908126790556, "priceChangePercentage24h": 17.62468823, "priceChangePercentage7d": 26.6722992}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08874110765276, "priceChangePercentage24h": 9.25054566, "priceChangePercentage7d": 24.4659537}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.38924645481423, "priceChangePercentage24h": 7.02662009, "priceChangePercentage7d": 12.98402508}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.57815931560089, "priceChangePercentage24h": 7.39893119, "priceChangePercentage7d": 12.47051954}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12852805296196, "priceChangePercentage24h": 6.94291126, "priceChangePercentage7d": 13.79842973}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05238413493687, "priceChangePercentage24h": 4.52033131, "priceChangePercentage7d": 14.64970509}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:08:09.662Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}