{"data": {"id": 6780, "name": "Equilibrium EQ", "symbol": "EQ", "slug": "equilibrium-eq", "category": "coin", "description": "## What Is Equilibrium?\n\nEquilibrium is the first interoperable DeFi conglomerate — it is comprised of a comprehensive lending platform and a professional-grade cross-chain DEX. \n\n## EQ is the native utility token that is used for:\n\n* Collateral pledge for borrowing stablecoins and crypto assets\n* Bailout liquidity\n* Liquidity farming\n* Paying system fees\n* Accessing system governance\n\nEquilibrium tools include: \n\nNode-js API tools to interact with Equilibrium substrate e.g. query state and submit transactions. https://www.npmjs.com/package/@equilab/api\nBlock explorer to monitor network performance: https://equilibrium.subscan.io/ \nPolkadot.js wallet to aid with substrate debugging and network performance: https://polkadot.js.org/apps/#/explorer\n\n\n## How Many EQ Tokens Are There in Circulation?\n\nEquilibrium launched its mainnet and conducted a token generation event on November 12, 2020. The initial supply is 120 million EQ tokens, fully compatible across every smart-contract enabled blockchain bridged with Polkadot. According to the token release schedule there are 16% of the initial supply circulating as of beginning of April. EQ circulation will be increasing every year due to annual inflation of 2.5%.\n\n\n### Who Are the Founders of Equilibrium?\n\nAlex Melikhov is the founder and CEO of Equilibrium. Alex is an engineer in applied mathematics by training. Before blockchain, he was working on fintech projects. \n\nEquilibrium’s current team has been working together since 2017 building on Ethereum back in the day. In 2018, the team kicked off the development on EOS. In April 2019 the team launched the first decentralized EOS-based stablecoin as the first product of the Equilibrium’s product line, called EOSDT. Today EOSDT is the most liquid decentralized stablecoin and the biggest DeFi project on EOS, with over $14 million of total value locked in our smart contracts, and over 1,000 user positions generated.\n\nNow the team is developing on Polkadot to obtain true cross-chain interoperability and to turn Equilibrium into a full-fledged DeFi one-stop-shop. \n\n### Why is Equilibrium unique?\n\nOther than the fact that Equilibrium focuses on cross-chain functionality from the outset, it is the first DeFi conglomerate that is designed to deliver a unique user experience and to end market fragmentation. \n\nEquilibrium is based on a unique and innovative architecture and doesn’t replicate any of existing DeFI concepts and makes the system way more stable. Here are core components that implement this architecture and set Equilibrium apart from other DeFi projects:\n\n### A unique risk management system\n\nThis monitors the overall system liquidity in real-time across blockchains, starting from individual users’ multi-asset portfolios and aggregating them to follow overall system solvency. It’s constantly assessing system portfolio volatility, conditions of the bailout liquidity pool that is securing loans in the system, and risk profiles of particular user positions. \n\n### Programmatic interest rate\n\nMost DeFi lending applications either follow asset utilization or set interest via governance mechanisms. Equilibrium is the first DeFi project that takes a risk-based approach to borrowing cost assessment that is inherited from traditional finance. Practically it means that borrowers can enjoy flexible interest rates that can be adjusted by providing less volatile collateral or setting higher collateralization levels.\n \n### Bailouts are a proactive solution to bad debt\n\nMost DeFi projects liquidate a debt by way of auctions, but this isn’t as active and reliable a solution as it should be. That’s why Equilibrium has introduced the bailout mechanism and the associated user role of bailsman who provide liquidity to the bailout pool and efficiently secure loans in the system. In case of liquidations there are no forced auctions needed as debt obligations are simply transferred from defaulted borrowers to balsmen. So it doesn’t matter where the market is going. \n\n\n### Where Can I Buy EQ?\n\nUsers will be able to participate in the upcoming Parachain Lease Offering Phase 2 (crowdloan). Also, the team is in talks with major exchanges and expects EQ listings in Q2 2021. Read more details about Equilibrium’s PLO strategy here. Stay tuned for further updates, follow Equilibrium on Twitter and Telegram\n", "dateAdded": "2020-08-31T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "5529", "tags": [{"slug": "substrate", "name": "Substrate", "category": "PROPERTY"}, {"slug": "polkadot", "name": "Polkadot", "category": "PLATFORM"}, {"slug": "polkadot-ecosystem", "name": "Polkadot Ecosystem", "category": "PROPERTY"}], "urls": {"website": ["https://equilibrium.io/en/eq-token"], "technical_doc": [], "explorer": [], "source_code": ["https://github.com/equilibrium-eosdt"], "message_board": ["https://medium.com/equilibrium-eosdt", "https://www.linkedin.com/company/equilibrium-eosdt/"], "chat": ["https://t.me/equilibrium_eosdt_official"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/EquilibriumDeFi"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.85772503734395, "priceChangePercentage24h": 40.30756529, "priceChangePercentage7d": 57.90745062}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.29499070066937, "priceChangePercentage24h": 10.52326861, "priceChangePercentage7d": 21.67542856}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04647355788614, "priceChangePercentage24h": 8.57682717, "priceChangePercentage7d": 20.43140837}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36656520586486, "priceChangePercentage24h": 18.09072449, "priceChangePercentage7d": 27.22323593}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08980153241338, "priceChangePercentage24h": 10.56349231, "priceChangePercentage7d": 26.02438398}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.39082136530065, "priceChangePercentage24h": 7.02278986, "priceChangePercentage7d": 12.75426601}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.57970010316956, "priceChangePercentage24h": 7.61993043, "priceChangePercentage7d": 12.51452389}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12842553254554, "priceChangePercentage24h": 6.43732251, "priceChangePercentage7d": 13.71042985}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05648541496579, "priceChangePercentage24h": 4.73343012, "priceChangePercentage7d": 15.22292281}], "relatedExchanges": [], "isAudited": false, "distributions": [{"holder": "Foundation", "percentage": 45.0}, {"holder": "Private Sale", "percentage": 5.0}, {"holder": "Public Sale", "percentage": 35.0}, {"holder": "Team", "percentage": 15.0}]}, "status": {"timestamp": "2021-07-31T09:16:02.037Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}