{"data": {"id": 6830, "name": "KILT Protocol", "symbol": "KILT", "slug": "kiltprotocol", "category": "coin", "description": "## What Is KILT Protocol (KILT)?\n\nKILT bills itself as an open-source blockchain protocol for issuing verifiable, revocable, and anonymous claims-based credentials in[ Web 3.0](https://coinmarketcap.com/alexandria/article/what-is-web-3-0). In other words, it helps users prove their identities online while removing the need for companies to collect passwords and user data. The project was created partially to get the software industry involved in web3, along with other organizations desiring increased trust and data sovereignty. \n\nKILT is a simple protocol (comes with an easy JavaScript SDK) for creating, requesting, issuing, presenting, and validating digital credentials. With KILT, you can generate useful applications even if you don’t have skills in blockchain development. \n\n\n### What The KILT Protocol Offers\n\nKILT is a universal model that allows individuals, organizations, objects, and even AI to claim arbitrary attributes and validate them with trusted entities. Secondly, it provides access to a Trust Market for \"Attesters,\" which allows trusted organizations to attach prices to their attestation work and, as a result, get paid. And finally, the protocol provides mechanisms that allow claim holders to control their data. They have the option to store information and can choose what information they want to disclose and to whom.\n\n\n## Who Are the Founders of KILT Protocol?\n\nThe KILT Protocol was founded in 2018 and has been under development for over two years.\n\nThe main developer of the KILT Protocol is a German blockchain company BOTLabs. It is co-owned by Ingo Rübe, CEO of KILT. Rübe founded his first IT startup back in 1995. He is a founding member of the International Association for Trusted Blockchain Applications (INATBA), and has served as CTO for Hubert Burda Media, and was previously CIO for Axel Springer.\n\nMárton Csernai is the Lead Researcher & Product Owner at KILT Protocol. He is a specialist with a background in neuroscience, networking sciences, and telecommunications. He received his Master's degree in Electrical Engineering and earned a PhD in Computer Science from the Budapest University of Technology and Economics (BME). Csernai has strong analytical, technical, and programming skills.\n\nWilliam Freudenberger is another Product Owner and Blockchain Developer of KILT Protocol. He studied mathematics at the Technical University of Berlin, and now Freudenberger works at the node and protocol level.\n\nAntonio Antonino is a Software Engineer with a bachelor's degree in Cloud Computing from the Technical University of Berlin and Aalto University. Before KILT Protocol, he was an R&D software engineer at Ericsson Finland, where he worked with blockchain solutions.\n\nKaspersky Mail Jørgensen is the acting CFO at KILT. He has 20 years of experience in finance and compliance with Maersk, Nortel Networks, KPMG. Most importantly, he’s CFO of the Web3 Foundation and is also co-founder of the ComplyTo platform (European SMBs, which deals with GDPR).\n\n\n### What Makes KILT Protocol (KILT) Unique?\n\nKILT is a decentralized privacy management protocol that helps other organizations prove their online identity. One of the developers' goals is to support business models formed on trust, so it provides users with the functionality they need to create simple and complex trust solutions. The protocol allows the description and validation of characteristics (people, organizations, things) in a standardized way. Therefore, KILT can be characterized as a system for self-contained data, i.e., KILT establishes data sovereignty and gives users control over their data.\n\nKILT provides a baseline for verifiable credentials in Web 3.0. The project offers real accreditation in the digital world. Businesses can verify credentials and build trust. Thus, the system allows you to rely on a common standard, which is owned by all participants in the process. \n\nIt’s important to note the Kusama[ parachain](https://coinmarketcap.com/alexandria/article/what-are-parachains-2) provides the key functionality of KILT, including:\n\n\n\n* Block finalization and network protection (an additional security level); \n* Access to[ DIDs](https://coinmarketcap.com/alexandria/glossary/decentralized-identifier-did) (Decentralized Identifiers);\n* Verifiable Credentials via the Relay Chain to other parachain projects;\n* Provides powerful network effects specifically for the KILT blockchain; \n* Interoperability between parachains ([smart contracts](https://coinmarketcap.com/alexandria/glossary/smart-contract),[ oracles](https://coinmarketcap.com/alexandria/article/oracles-in-defi-101-a-deep-dive-by-tellor)).\n\n\n#### Related Pages:\n\nRead about[ Polkadot (DOT)](https://coinmarketcap.com/currencies/polkadot-new/) and[ Kusama (KSM)](https://coinmarketcap.com/currencies/kusama/) - \"Polkadot's wild cousin.\"\n\nWhat is Web 3.0? Where did Web 1.0 and 2.0 go? Let's figure it out with[ CMC Alexandria](https://coinmarketcap.com/alexandria/article/what-is-web-3-0).\n\nWhat is a Decentralized Identifier (DID)?[ Click here](https://coinmarketcap.com/alexandria/glossary/decentralized-identifier-did) and find out.\n\nWhat are Parachains?[ CMC’s tech deep dives](https://coinmarketcap.com/alexandria/article/what-are-parachains-2) are here to help.\n\nCheck the[ CoinMarketCap blog](https://coinmarketcap.com/alexandria/categories/blog) for the recent news and market insights.\n\n\n### How Many KILT Protocol (KILT) Coins Are There in Circulation?\n\nKILT is based on Parity Substrate. This means the KILT Protocol has its native coin (as well as its native blockchain). The project developers promise that in 2021 the KILT token will become an integral part of the protocol used to pay for transactions, fees for services, and other tasks.\n\nThe total supply is predicted to be 1 billion tokens, and the distribution of which will be as follows: \n\n40% of KILT tokens will be available for private sale before the official launch, and the remaining 60% will be reserved to reward network validators over time.\n\nThree options for using KILT were also announced in the form of staking rewards, platform fee payments, and network security (owners can stake tokens to secure the network).\n\n\n### How Is the KILT Protocol Network Secured?\n\nThe platform uses the Proof of Authority (PoA) algorithm. This algorithm is efficient in terms of energy consumption and speeds transactions. Transactions and blocks are validated by approved accounts. The approved validators run software that allows transactions to be placed in blocks (this process is automated).\n\nIn 2021, the developers will make a change from Proof of Authority to Proof of Stake. And the network will start using a[ PoS](https://coinmarketcap.com/alexandria/article/proof-of-work-vs-proof-of-stake) mechanism to select validators and nominators and maximize chain security.\n\nThe protocol is built on the Substrate platform, meaning KILT will allow all parachains and their users to manage personal data and accounts securely. The information can be transferred anonymously to third parties for seamless identity verification.\n\n\n## Where Can You Buy KILT Protocol (KILT)?\n\nAs of June 2021, the KILT token has not yet been released. It has been in development since 2018 and will be launched in 2021. However, in the future, users will be able to purchase KILT: by bonding tokens from the Kusama ([KSM](https://coinmarketcap.com/currencies/kusama/)) parachain network or waiting for a listing on an exchange like Binance.\n\nCoinMarketCap lists all major events in the crypto space[ here](https://coinmarketcap.com/events/) so you can stay informed. To learn more about buying cryptocurrencies, see our full[ guide](https://coinmarketcap.com/how-to-buy-bitcoin/).\n", "dateAdded": "2020-09-01T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "1864", "tags": [{"slug": "substrate", "name": "Substrate", "category": "PROPERTY"}, {"slug": "polkadot", "name": "Polkadot", "category": "PLATFORM"}], "urls": {"website": ["https://kilt.io/"], "technical_doc": [], "explorer": [], "source_code": ["https://github.com/KILTprotocol"], "message_board": [], "chat": ["https://t.me/KILTProtocolChat"], "announcement": ["https://medium.com/@KILT_Protocol"], "reddit": [], "twitter": ["https://twitter.com/Kiltprotocol"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.85772503734395, "priceChangePercentage24h": 40.30756529, "priceChangePercentage7d": 57.90745062}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.29499070066937, "priceChangePercentage24h": 10.52326861, "priceChangePercentage7d": 21.67542856}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04647355788614, "priceChangePercentage24h": 8.57682717, "priceChangePercentage7d": 20.43140837}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36656520586486, "priceChangePercentage24h": 18.09072449, "priceChangePercentage7d": 27.22323593}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08980153241338, "priceChangePercentage24h": 10.56349231, "priceChangePercentage7d": 26.02438398}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.39082136530065, "priceChangePercentage24h": 7.02278986, "priceChangePercentage7d": 12.75426601}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.57970010316956, "priceChangePercentage24h": 7.61993043, "priceChangePercentage7d": 12.51452389}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12842553254554, "priceChangePercentage24h": 6.43732251, "priceChangePercentage7d": 13.71042985}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05648541496579, "priceChangePercentage24h": 4.73343012, "priceChangePercentage7d": 15.22292281}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:16:22.745Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}