{"data": {"id": 6831, "name": "Laminar", "symbol": "Laminar", "slug": "laminar", "category": "coin", "description": "## What Is Laminar (Laminar)?\n\nLaminar is an open financial platform founded in 2019 that powers margin and synthetic assets trading. The platform is based on[ Ethereum](https://coinmarketcap.com/currencies/ethereum/) and uses[ DeFi](https://coinmarketcap.com/alexandria/article/what-is-decentralized-finance) building blocks and Flow Protocols to meet the community's needs.\n\nIn 2021, the Laminar developer team started to launch Flowchain using[ Substrate](https://coinmarketcap.com/alexandria/glossary/substrate) to scale to a high-performance retail chain. As a partner in the Polkadot ecosystem, Flowchain will contribute to this interoperable and scalable blockchain ecosystem. The Substrate-based Laminar Chain connects[ Polkadot](https://coinmarketcap.com/alexandria/author/polkadot) as a parachain in order to strengthen the overall security of Polkadot and the DeFi community.\n\nIn the early stages of its launch, Laminar received funding from the Web 3.0 Foundation, an organization that also sponsored[ Polkadot](https://coinmarketcap.com/currencies/polkadot-new/) and[ Kusama](https://coinmarketcap.com/currencies/kusama/). \n\n\n### Who Are the Founders of Laminar?\n\nLaminar was founded by the team behind the[ Acala Network](https://coinmarketcap.com/alexandria/article/what-is-acala) and[ Karura (KAR)](https://coinmarketcap.com/currencies/karura/). It consists of Ruitao Su, Bette Chen, and Bryan Chen.\n\nRuitao Su is currently co-founder of Acala and CEO of Laminar. He is a former CTO of Centrality, an award-winning software engineer, talented entrepreneur, investor, and advisor to technology companies and startups.\n\nBette Chen is a co-founder at Acala Network and COO at Laminar Protocol since 2019. She is a visionary product manager and skilled entrepreneur. Chen received academic degrees in Engineering (Software) and Business (MBA). She has impressive experience in management and leadership in the high-tech industry.\n\nBryan Chen is another co-founder of the Acala Network. He is also the co-founder and CTO of Laminar. Chen is an irreplaceable contributor to the Substrate codebase and a Polkadot Ambassador. \n\nAntonia Chen is Chief Economist at Laminar. Chen holds a Ph.D. in economics and is experienced in tech startups, microeconomics, mathematics research, and token economy design. \n\nErmal Kaleci holds the position of Senior Software Engineer at the company. Kaleci is a well-known KYC and mobile wallet App developer and an award-winning mobile developer as well.\n\n\n### What Makes Laminar (Laminar) Unique?\n\nLaminar is a decentralized financial protocol that creates an open and reliable trading platform for crypto traders and traditional financial market traders alike. The main goal of the project: to offer modern and competitive business models to financial service providers and strengthen the DeFi ecosystem in general. Here are the main points of development:\n\n\n\n* Synthetic Asset: Users can trade various financial assets and earn interest on their holdings. The effectiveness lies in the fact that traders block 100% of the value of an open position, and liquidity providers cover the risks.\n* Margin Trading: There is an option to open short and long positions with[ leverage](https://coinmarketcap.com/alexandria/glossary/leverage). The advantages are instant liquidity and limited risks for traders, and the protocol fixes the potential profit.\n* Money Market: An integrated option where the user can earn interest in the trading process. The interest rate is floating; it provides a profitability and liquidity guarantee.\n\nIt’s worth paying attention to the fact that Laminar offers decentralized margin trading. The platform opens up opportunities for conducting leveraged trading transactions on a decentralized basis and using synthetic digital assets.\n\nThe Flow Protocols offer the following features:\n\n\n\n* Instant Liquidity: Users trade against[ smart contracts](https://coinmarketcap.com/alexandria/glossary/smart-contract), which means there is instant and endless liquidity. This happens if the collateral ratio doesn’t fall below the specified liquidation threshold.\n* Asset Efficiency: Traders need to provide collateral in the amount of the value of the positions. The rest of the risks are taken by the liquidity providers who receive the transaction fees. In fact, even margin traders can trade against liquidity pools.\n* Environment for Trading Experience: Protocols provide transparent pricing and proper counterparty actions that are governed by both the protocol and the community.\n* Integrated Money Market: Financial assets deposited by traders and liquidity providers generate interest, which increases liquidity.\n\nLaminar Flow Protocols strive to be blockchain-independent. The platform enables both synthetic and margin trading, which helps to combat opaque pricing and price manipulation in financial markets.\n\n\n#### Related Pages:\n\nRead about[ Karura (KAR)](https://coinmarketcap.com/currencies/karura/) and[ Polkadot (DOT)](https://coinmarketcap.com/currencies/polkadot-new/).\n\nCoinMarketCap talks about the intricacies of Karura and Polkadot[ here](https://coinmarketcap.com/alexandria/article/what-is-karura).\n\nWhat is Acala? Take a deep dive into one of the Polkadot parachains with[ CMC Alexandria](https://coinmarketcap.com/alexandria/article/what-is-acala).\n\nWhat is Web 3.0? Learn about it[ here](https://coinmarketcap.com/alexandria/article/what-is-web-3-0). \n\nCheck the[ CoinMarketCap blog](https://coinmarketcap.com/alexandria/categories/blog) for product updates, partnerships, and announcements.\n\n\n## How Many Laminar (Laminar) Coins Are There in Circulation?\n\nAs of June 2021, Laminar[ ERC-20](https://coinmarketcap.com/alexandria/glossary/erc-20) tokens are not in circulation. Relevant information about the business plan of the cryptocurrency (tokenomics) is also not available. The confirmed specifics on the Initial Token Sale ([ICO](https://coinmarketcap.com/alexandria/glossary/initial-coin-offering-ico)) weren’t published on the official channels of the project, so the exact details (total supply of Laminar tokens and their distribution) are currently unknown.\n\n\n### How Is the Laminar Network Secured?\n\nLaminar supports the Ethereum smart contract implementation, which acts as a value gateway to fully utilize the DeFi Ethereum ecosystem, providing liquidity and trading diversity. On top of that, for maximum protection, the network uses a PoS ([proof-of-stake](https://coinmarketcap.com/alexandria/article/proof-of-work-vs-proof-of-stake)) mechanism, the significant advantages of which include security, reduced risk of centralization, and energy efficiency.\n\n\n## Where Can You Buy Laminar? \n\nAs of June 2021, the Laminar token isn’t listed on any exchanges, so there is no opportunity to buy or trade Laminar tokens at this time. However, stay informed and[ tap here](https://coinmarketcap.com/ico-calendar/) and find out the complete ICO calendar. \n\nBe sure to learn more about buying crypto — check our extensive[ guide](https://coinmarketcap.com/how-to-buy-bitcoin/). \n\nJust in case:[ Top DeFi Tokens by Market Capitalization.](https://coinmarketcap.com/view/defi/)", "dateAdded": "2020-09-01T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "623", "tags": [{"slug": "defi", "name": "DeFi", "category": "PROPERTY"}, {"slug": "substrate", "name": "Substrate", "category": "PROPERTY"}, {"slug": "polkadot", "name": "Polkadot", "category": "PLATFORM"}, {"slug": "polkadot-ecosystem", "name": "Polkadot Ecosystem", "category": "PROPERTY"}], "urls": {"website": ["https://laminar.one/"], "technical_doc": [], "explorer": [], "source_code": ["https://github.com/laminar-protocol"], "message_board": [], "chat": [], "announcement": ["https://medium.com/laminar"], "reddit": [], "twitter": ["https://twitter.com/laminarprotocol"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.85772503734395, "priceChangePercentage24h": 40.30756529, "priceChangePercentage7d": 57.90745062}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.29499070066937, "priceChangePercentage24h": 10.52326861, "priceChangePercentage7d": 21.67542856}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04647355788614, "priceChangePercentage24h": 8.57682717, "priceChangePercentage7d": 20.43140837}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36656520586486, "priceChangePercentage24h": 18.09072449, "priceChangePercentage7d": 27.22323593}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08980153241338, "priceChangePercentage24h": 10.56349231, "priceChangePercentage7d": 26.02438398}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.39082136530065, "priceChangePercentage24h": 7.02278986, "priceChangePercentage7d": 12.75426601}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.57970010316956, "priceChangePercentage24h": 7.61993043, "priceChangePercentage7d": 12.51452389}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12842553254554, "priceChangePercentage24h": 6.43732251, "priceChangePercentage7d": 13.71042985}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05648541496579, "priceChangePercentage24h": 4.73343012, "priceChangePercentage7d": 15.22292281}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:16:25.234Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "45", "credit_count": 0}}