{"data": {"id": 7105, "name": "Permission Coin", "symbol": "ASK", "slug": "permission-coin", "category": "coin", "description": "### What Is The Permission Coin? [ASK]\n“ASK” is the currency for permission. Its primary use case is to power a global digital ad system built on permissioned data and opt-in engagement. The project aims to offer an antidote to some of the most significant problems of Web 2.0 - surveillance capitalism, data exploitation and interruptive marketing - by enabling users to securely grant permission and monetize their data across the web, while providing an enterprise solution for marketers seeking better return on their ad spend.  \n\nGlobal privacy regulations, ad blockers, and dramatic changes in ad tech are forcing a new advertising model based on consent. By enabling marketers to build opt-in audiences and ask permission for engagement, and by ensuring users are rewarded for the data they volunteer to share, Permission sees ASK as foundational to helping tech platforms and marketers compete in Web 3.0. \n\nCurrently, users earn ASK by securely sharing their data and opting in to receive relevant ads and content. The experience is delivered primarily through declared data-sharing activities and engaging with video ads on Permission.io. Advertisers can also deploy ASK as an incentive mechanism on their own digital channels, driving loyalty and personalized ad campaigns. Additionally, the ability to earn and spend ASK via merchants on the Shopify platform is in the pipeline, with other major eCommerce platforms to follow. \n\nThe project’s other goals include deeper development of its proprietary technology, “Data Algebra,” for which it has been awarded 9 patents. The breakthrough technology can liquify data currently stored in silos and applications, making it possible for individuals to aggregate and monetize their full data set and for companies to gain permissioned visibility over the most comprehensive data sets possible. \n\n### Who Are The Founders of The Permission Coin?\n\nThe Permission Coin was founded by Charles Silver, Hunter Jensen, and Robin Bloor.\n\nCharles Silver is a veteran entrepreneur with a proven track record of growing successful businesses. A visionary in the dot-com era, Charles founded RealAge, a pioneer in using big data to connect advertisers and consumers on a permission basis. He grew RealAge to tens of millions of users and led the company to its acquisition by media giant Hearst. In addition to founding Permission.io, Charles co-founded Reality Shares, a SEC-registered investment adviser with 5 publicly traded ETFs, including the first publicly traded blockchain ETF, and Blockforce Capital, a multi-strategy digital assets hedge fund.  \n\nHunter Jensen is Permission.io’s CTO and has been at the forefront of the software industry for more than 20 years. An engineer with broad experience, Hunter founded and built a leading software development agency and has led teams that have released best-in-class products, including for Samsung, Salesforce, Cisco, Microsoft and other technology leaders. \n\nRobin Bloor, Co-founder and Chief Analyst of the renowned “Bloor Group,” is a respected IT analyst both in the U.K. and the U.S. Robin has consulted for the world’s leading tech companies, including IBM, Microsoft, Oracle and Teradata and is a well-known expert in all things big data, AI, and analytics. He is also a published author, having written eCommerce bestseller The Electronic Bazaar, which predicted the advent of personal data monetization. He also wrote The Common Sense of Cryptocurrency and co-authored The Algebra of Data. \nThe Permission team consists of more than 30 employees, board members, and strategic advisors.  \n\n### What Makes Permission Unique?\n\nAlthough many crypto projects tout data empowerment, most limit users’ ability to benefit from their data to a specific browser or application. Permission’s platform is constructed to help users securely grant permission and earn from their data across multiple channels and contexts. The coin is simple-to-use with earn and spend opportunities that are straightforward and transparent and that will evolve as the project’s network and permission-based economy matures. The vision for ASK is that users will put their data to work for their own benefit in a way that will easily blend into their daily lives.\n\nFundamental to this vision is Permission’s patented technology, which allows data stored in silos and applications to be integrated so that individuals can link and monetize their social, search, shopping data, any data that is stored in any database, to be queried as a single logical data store. \n\nThis is a huge differentiator because it enables users to truly take back ownership of their data so they can earn from it, putting individuals at the center of the data economy.  \n\nPermission launched the Permission Platform in August, 2020, and has achieved significant early growth, with ASK now held by over 300,000 unique wallets. \n\n#### Related Pages:\n\n[Discover Basic Attention Token (BAT)](https://coinmarketcap.com/currencies/basic-attention-token/) - a blockchain-based digital advertising platform.\n\nCheck out [Decentr (DEC)](https://coinmarketcap.com/currencies/decentr/) — a blockchain-powered web browser and web 3.0 portal.\n\nExplore [AdEx Network (ADX)](https://coinmarketcap.com/currencies/adx-net/) — a blockchain-powered advertising platform.\nGet ahead of the market with the largest news, analyses, and updates with the CoinMarketCap blog.\n\n### How many Permission Coins (ASK) are in circulation?\n\nhttps://permission.io/blog/primer-on-ask/\n\nThe Permission Coin has a circulating supply of 13386481798 ASK coins and the maximum total supply is 100 billion. \n\nOf this 100B, 40% are allocated to users, 25% are allocated to purchasers and supporters, 20% are allocated for developer incentives and advisors, and 15% are allocated to the team. \n\nThe large supply is meant to allow mass adoption by users around the world while still transacting in whole-number denominations, as opposed to decimal places.\n\n### How is the Permission Network Secured?\n\nASK transacts on the Permission Blockchain. The Permission Blockchain is a fork of Ethereum, so it's based on the Proof-of-Authority consensus and fully follows the Ethereum PoA protocol.\n \n### Where can I buy The Permission Coin (ASK)?\nThe top exchanges for trading in Permission Coin are currently [Bithumb Global](https://coinmarketcap.com/exchanges/bithumb-global/), and [ViteX](https://coinmarketcap.com/exchanges/vitex/). You can find others listed on [our crypto exchanges page](https://coinmarketcap.com/currencies/permission-coin/markets/).\n\n", "dateAdded": "2020-09-18T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T09:16:32.000Z", "watchCount": "5637", "launchPrice": 0.000717294, "tags": [], "selfReportedTags": ["Marketing", "Retail", "AI & Big Data", "Loyalty", "E-commerce"], "selfReportedCirculatingSupply": "13386481798", "urls": {"website": ["https://permission.io/"], "technical_doc": ["https://cdn.permission.io/about/Permission-Foundation-Technical-Whitepaper.pdf"], "explorer": ["https://explorer.permission.io/"], "source_code": [], "message_board": ["https://medium.com/permissionio/primer-on-ask-total-and-circulating-supply-ed8a90a1a59a"], "chat": ["https://telegram.me/permission_io", "https://www.linkedin.com/company/permission-io/"], "announcement": ["https://medium.com/permissionio"], "reddit": ["https://reddit.com/r/PermissionIO"], "twitter": ["https://twitter.com/permissionIO"]}, "volume": 315518.39289046, "volumeChangePercentage24h": 32.5213, "statistics": {"price": 0.00180467730494, "priceChangePercentage1h": 0.06047669, "priceChangePercentage24h": -0.67416828, "priceChangePercentage7d": -4.21351136, "priceChangePercentage30d": -10.23109911, "priceChangePercentage60d": -29.79393765, "priceChangePercentage90d": -62.25028865, "marketCap": 24158279.89, "marketCapChangePercentage24h": -0.6742, "fullyDilutedMarketCap": 180467730.49, "fullyDilutedMarketCapChangePercentage24h": 28.79, "circulatingSupply": 13386481798.0, "totalSupply": 100000000000.0, "marketCapDominance": 0.0015, "rank": 604, "roi": 151.41284459, "low24h": 0.00180136, "high24h": 0.00182619, "low7d": 0.00177188, "high7d": 0.00189156, "low30d": 0.00177188, "high30d": 0.00210989, "low90d": 0.00177188, "high90d": 0.00544942, "low52w": 0.00016487, "high52w": 0.0112486, "lowAllTime": 0.00016487, "highAllTime": 0.0112486, "lowAllTimeChangePercentage": 994.61, "highAllTimeChangePercentage": -83.96, "lowAllTimeTimestamp": "2021-02-04T14:24:08.000Z", "highAllTimeTimestamp": "2021-03-09T02:48:13.000Z", "lowYesterday": 0.00180173, "highYesterday": 0.00182619, "openYesterday": 0.00181976, "closeYesterday": 0.00182126, "priceChangePercentageYesterday": 0.08, "volumeYesterday": 305473.08, "turnover": 0.01306047, "ytdPriceChangePercentage": 754.5683}, "relatedCoins": [{"id": 90, "name": "Dimecoin", "slug": "dimecoin", "price": 2.83568655e-06, "priceChangePercentage24h": -23.67920327, "priceChangePercentage7d": 2.52253557}, {"id": 1958, "name": "TRON", "slug": "tron", "price": 0.06386132305882, "priceChangePercentage24h": 5.91741662, "priceChangePercentage7d": 13.5019715}, {"id": 1478, "name": "DECENT", "slug": "decent", "price": 0.00690479071708, "priceChangePercentage24h": -11.56480904, "priceChangePercentage7d": 20.69884828}, {"id": 2700, "name": "Celsius", "slug": "celsius", "price": 6.19069387573764, "priceChangePercentage24h": 6.59730243, "priceChangePercentage7d": 3.94356679}, {"id": 6615, "name": "Love Coin", "slug": "love-coin", "price": 0.00089904339475, "priceChangePercentage24h": 7.36078625, "priceChangePercentage7d": 21.73980281}, {"id": 5034, "name": "Kusama", "slug": "kusama", "price": 199.890331304512, "priceChangePercentage24h": 8.11441867, "priceChangePercentage7d": 13.28579484}, {"id": 7048, "name": "Wing", "slug": "wing", "price": 17.61119257743106, "priceChangePercentage24h": 6.15686663, "priceChangePercentage7d": 11.82840319}, {"id": 4172, "name": "Terra", "slug": "terra-luna", "price": 11.24179773229508, "priceChangePercentage24h": 7.86233008, "priceChangePercentage7d": 43.24426972}, {"id": 1808, "name": "OMG Network", "slug": "omg", "price": 4.41490323587111, "priceChangePercentage24h": 10.98510006, "priceChangePercentage7d": 19.98103746}], "relatedExchanges": [{"id": 489, "name": "Bithumb Global", "slug": "bithumb-global"}, {"id": 433, "name": "Bitrue", "slug": "bitrue"}, {"id": 756, "name": "ViteX", "slug": "vitex"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T09:18:16.720Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "8", "credit_count": 0}}