{"data": {"id": 7793, "name": "PREOS", "symbol": "PAG", "slug": "preos", "category": "token", "description": "publity AG brings \"digital twin\" of the PREOS share onto the Blockchain\r\n\r\n \r\n\r\n- First tokenisation of shares of a listed company worldwide\r\n\r\n- Public offer based on securities prospectus as of 24 November 2020\r\n\r\n- Subscription starting from one token possible - signal effect for financial centre Germany\r\n\r\n- Thomas Olek, CEO, of publity AG: \"A milestone in the international real estate industry. We make real estate digital and investable for everyone, no matter the location or infrastructure\".\r\n\r\nFrankfurt/Main (24.11.2020) - The real estate investor PREOS Global Office Real Estate & Technology AG (PREOS) is the world's first listed company whose shares are digitally securitised by a Blockchain-based \"digital twin\" (token). The tokens will be issued by the PREOS parent company publity AG by way of a public offering in Germany and Austria on the basis of a securities prospectus approved by the German Federal Financial Supervisory Authority (BaFin) on 23 November 2020. They will also be issued by way of an international private placement. The offer includes 50 million PREOS tokens. This is the world's largest tokenisation project in the real estate industry. In a first step, publity AG has already tokenised PREOS shares with a market value of around EUR 230 million, which corresponds to a token number of 25 million. The medium to long-term goal is a total token volume of EUR 1 billion.\r\n\r\nInvestors will be able to invest in the PREOS Token as of 24 November 2020, irrespective of their location and entirely digitally. The initial issue price per PREOS token is EUR 9.25 (XETRA closing price of the PREOS share on 23 November 2020). The PREOS token is based on the Ethereum Blockchain and guarantees essential shareholder rights. Each PREOS token corresponds to one PREOS share. The token holder has a digitally deposited non-cash asset on the Blockchain and can exchange his token for a conventional PREOS share at any time. The tokenised shares, which provide the same dividend and voting rights at the Shareholders' Meeting of PREOS as all other PREOS shares, are held in custody by a collateral trustee.\r\n\r\nThe PREOS token can be subscribed online at www.preos-token.de. The securities prospectus applicable to the public offering was published on 24 November 2020 on publity AG's website (www.publity.de) in the \"Investor Relations\" section. In this context, the information listed below under \"Disclaimer\" must be observed.\r\n\r\nOlek: \"We are opening a new chapter on the capital market.\"\r\n\r\nThe PREOS shares required for the transaction originate from the stake of the Frankfurt-based publity AG, which currently holds around 86 percent of the PREOS shares. From an economic point of view, the sale of the tokens backed by PREOS shares is thus similar to a public re-placement of PREOS shares by publity AG. Thomas Olek, founder, CEO and majority shareholder of publity AG: \"We are opening a new chapter with this tokenisation on the capital market and in the real estate sector alike. The real estate industry and the financial markets must and will become even more digital - PREOS and publity are pioneers in this respect and are taking investors on this exciting journey. We thus make real estate digitally and globally investable. We are targeting a volume of EUR 1 billion for the PREOS token in the medium to long term\".\r\n\r\nBy issuing the PREOS token on the Ethereum Blockchain, publity AG intends to emphasise its technological pioneering role and broaden the PREOS shareholder base by addressing new investor groups, says Nils von Schoenaich-Carolath, Director Treasury & Digital Assets of publity AG and project manager for the PREOS token. \"With the issuance of a digital twin of the PREOS share, we have in several aspects broken new ground. Not only are we the first company to issue a digital twin of a listed share by way of a public offering. The offer is also based on an innovative trustee system, granting extensive rights to the token holders. We believe that the PREOS token will be an important step in the further expansion of the Blockchain technology in the capital market context\".\r\n\r\nComprehensive money laundering concept presented\r\n\r\nThe money laundering concept developed in collaboration with the Frankfurt securities trading bank Bankhaus Scheich and submitted to the BaFin in conjunction with the creation of the PREOS token platform sets new standards. This concept ensures that the token can only be traded by investors who have gone through a comprehensive identification process carried out by Bankhaus Scheich. With the tokenised trustee structure new legal territory on the product side was entered. Concurrently, the structure had to be coordinated with several regulatory partners in parallel in order to implement the PREOS platform. The project was legally accompanied by the cooperation of Raschke von Knobelsdorff Heiser (RKH) and Schnittker Möllmann Partners (SMP). The technical service provider is micobo, which designed the PREOS platform for the PREOS tokens.\r\n\r\nAbout PREOS Global Office Real Estate & Technology AG\r\n\r\nPREOS is an active real estate investor focused on office properties. The focus of acquisitions is on Core - Plus office properties and properties with development potential in Frankfurt and in the future other European financial centres. Value creation is generated by targeted asset management measures. The corporate strategy is to significantly expand the real estate portfolio through acquisitions in the coming years and to extend the average holding periods of properties. Based on its decision to focus exclusively on the acquisition of high-priced premium properties in top locations in German and European cities, PREOS transferred 89.9% of the share capital to GORE German Office Real Estate AG (GORE) in the summer of this year in its formerly wholly owned subsidiary PREOS Immobilien GmbH. The latter focuses on the acquisition of low- to medium-priced office properties. Since then, PREOS has held a stake of around 59.9% of GORE's share capital. The balance sheet effects of the transaction on the IFRS consolidated figures are presented in the securities prospectus for the public offering as part of the pro forma financial information, whereby only the fair value of GORE's assets as at the last balance sheet date of 30 June 2020 has been included. Future planned earnings figures have not been taken into account. For reasons of precaution, this valuation approach could also be retained for the preparation of the HGB annual financial statements of PREOS as of 31 December 2020, as a result of which the valuation of the 59.9% stake in GORE would be significantly lower than the EUR 179.8 million previously expected by PREOS. The PREOS share (ISIN DE000A2LQ850) is listed in the m:access over-the-counter segment of the Munich Stock Exchange (PAG.MU) and on Xetra (PAG.DE). The company headquarters of PREOS is recently located in Leipzig, as of January 2021 it will be in Frankfurt.\r\n\r\nAbout publity AG\r\n\r\npublity AG (\"publity\") is an asset manager and investor specialised in office real estate in Germany. The company covers the core of the value chain from the acquisition to the development and the sale of real estate. With over 1,100 transactions in the past seven years, publity is one of the most active players in the real estate market. Currently, the company manages a portfolio with a value of over five billion euros. publity is characterized by a sustainable network in the real estate industry and in the Work-Out departments of financial institutions. In recent years, publity has digitalised the German office real estate market, with the result that its subsidiary PREOS possesses all the information on 9,500 relevant properties in the most important locations at all times. Thus the company achieves advantages both in the letting of the areas and in the search for buyers and salesmen of real estates.\r\n\r\nWith very good access to investment funds, publity handles transactions rapidly with a highly efficient process and proven partners. On a case-by-case basis, publity participates as co-investor in joint venture transactions to a limited extent. The shares of publity AG (ISIN DE0006972508) are traded on the Scale segment of Deutsche Börse.", "dateAdded": "2020-11-26T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "14", "dateLaunched": "2020-11-23T00:00:00.000Z", "tags": [], "urls": {"website": ["http://www.preos-token.com", "http://www.preos.de"], "technical_doc": ["https://www.publity.org/wp-content/uploads/2020/11/publity_AG_Token_Wertpapierprospekt_20201123_final.pdf"], "explorer": ["https://etherscan.io/address/0x101ae894e76c669C6747f767b33E0E480943Fa0E"], "source_code": ["https://github.com/github"], "message_board": [], "chat": [], "announcement": ["https://www.dgap.de/dgap/News/corporate/publity-brings-digital-twin-the-preos-share-onto-the-blockchain/?companyID=383864&newsID=1410163"], "reddit": [], "twitter": []}, "platforms": [{"contractId": 1027, "contractAddress": "0x101ae894e76c669C6747f767b33E0E480943Fa0E", "contractPlatform": "Ethereum", "contractPlatformId": 1, "contractChainId": 1, "contractRpcUrl": ["https://bsc-dataseed1.binance.org", "https://bsc-dataseed.binance.org/", "https://bsc-dataseed1.binance.org:443"], "contractNativeCurrencyName": "Ethereum", "contractNativeCurrencySymbol": "ETH", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://etherscan.io", "contractExplorerUrl": "https://etherscan.io/token/0x101ae894e76c669C6747f767b33E0E480943Fa0E", "contractDecimals": 0, "platformCryptoId": 1027}], "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.4142405085966, "priceChangePercentage24h": 39.40132645, "priceChangePercentage7d": 56.29818176}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.19025425555578, "priceChangePercentage24h": 10.60828525, "priceChangePercentage7d": 20.85457927}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04636580400442, "priceChangePercentage24h": 8.56343826, "priceChangePercentage7d": 20.079306}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36619492238694, "priceChangePercentage24h": 18.60011598, "priceChangePercentage7d": 27.28992627}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08939589389104, "priceChangePercentage24h": 10.21413653, "priceChangePercentage7d": 25.5853101}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.37749105860163, "priceChangePercentage24h": 5.98969144, "priceChangePercentage7d": 12.04240371}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.59875390084219, "priceChangePercentage24h": 8.25836053, "priceChangePercentage7d": 12.55699482}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12851761045328, "priceChangePercentage24h": 6.47784079, "priceChangePercentage7d": 13.48145477}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04959422730686, "priceChangePercentage24h": 4.42251835, "priceChangePercentage7d": 14.2575898}], "relatedExchanges": [], "wallets": [{"id": 9022, "name": "Trust Wallet", "tier": 1, "url": "https://www.trustwallet.com/", "chains": "ETH", "types": "app,trade", "introduction": "", "star": 2.0, "security": 3.0, "easyToUse": 3.0, "decentration": true, "focusNumber": 0, "rank": 1000008, "logo": "9022.png", "multipleChain": true}, {"id": 9025, "name": "MetaMask", "tier": 1, "url": "https://metamask.io/", "chains": "ETH,ETZ", "types": "pc", "introduction": "", "star": 1.0, "security": 2.0, "easyToUse": 4.0, "decentration": false, "focusNumber": 0, "rank": 1000013, "logo": "9025.png", "multipleChain": true}], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:23:05.531Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}