{"data": {"id": 7869, "name": "RedChillies", "symbol": "REDC", "slug": "redchillies", "category": "token", "description": "RedChillies is a gaming platform built on Zilliqa blockchain that utilizes ZRC-2 token REDC. It has defined four types of users in its platform: Game Developer, Game Host, Game Player and Game Governor.\n\nRedChillies operates in REDC token with circular tokenomics and max supply of 2 millions REDC tokens. REDC is a ZRC-2 compliant fungible token which will primarily act as a gas fee to host any games. Every hosted game will normally cost 1 to 10 REDC tokens and every game-result will only reward 2 REDC tokens. RedChillies are distributed from prize pool to max 4 parties (Game Developer, Game Host, Game Player and Game Governor); thus maintaining inflation rate and implementing fair distribution of token supply.\n\n**Game Developer**: RedChillies will provide efficient tools for game developers to integrate web-based games with Zilliqa blockchain in near future. Initial phase 0 will focus on game developments curated by the core team to stabilize the system. There will be 5 games in Phase 0 as Bet Games, Ludo Dice, Poker, Racing and Shooter. RedChillies will open its gaming platform for game developers in Phase 1. There will be no impact in REDC tokenomics while transitioning from Phase 0 to Phase 1. For every game played, the developer of that game receives 10% of prize pool amount in Phase 0 and 1; 8% of prize pool amount from Phase 2.\n\n**Game Host**: Each game available in RedChillies platform needs to be hosted by the user to make it available for players to join the game. Instances of games are thus created by users themselves to become the Game Host by paying 1 REDC token. Game Hosts are rewarded with 10% of the prize pool in each hosted game in Phase 0 and 1; 8% of prize pool amount from Phase 2. For any hosted game which fails to start or receive players will suffer the loss of 1 REDC token.\n\n**Game Player**: Anyone having Zil tokens can participate in any hosted game which is not yet started. Game players need to bet at least 50 Zil tokens via ZilPay wallet. Winners of each game are rewarded 80% of the prize pool amount. For any game betted which fails to start, players will be refunded for betted Zil.\n\n**Game Governor**: We want to make RedChillies - a community driven project by Phase 2. Holders of REDC tokens will have voting power from Phase 2. Each of the game results will need a \"verification\" vote before rewards can be claimed. Voting power counteracts any attackers or events who/which dishonestly or unfortunately influence the game results. Anyone with more than 1000 REDC tokens will have voting power and those who participate are called Game Governor. Game governor of each game will receive 4% of the prize pool amount.\n\n\nMinting(Phases)\tGame Reward Locked(Involved Parties)\t1,000,000(Token Supply (REDC))\t50%(Percentage Own)\n\nMinting\tExchanges\t600,000\t30%\n\nMinting\tMarketing\t100,000\t5%\n\nMinting\tTeam Development\t300,000\t15%\n\nMax Supply\t2,000,000\t100%\n\nREDC charged from hosting of each game is stored in a Treasury Contract for a month. On 1st of every month, Leaderboard Wallet receives these (2 * number of games played last month) REDC from Treasury + Reward Wallet. From Leaderboard Wallet:\n\na) Top 10 players are rewarded with these 60% REDC tokens based on ranking.\n\nb) Highest better from a single game gets 10% REDC tokens.\n\nc) Biggest winner from a single game gets 10% REDC tokens.\n\nd) Most games playing wallet receive 10% REDC tokens.\n\ne) Random players will also get 10% REDC tokens.\n\n", "dateAdded": "2020-12-06T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "38", "dateLaunched": "2020-10-04T00:00:00.000Z", "tags": [], "urls": {"website": ["https://zilchill.com/"], "technical_doc": ["https://github.com/RedChillies-Core/RedChillies-IP/blob/main/Whitepaper.md"], "explorer": ["https://viewblock.io/zilliqa/address/zil14jmjrkvfcz2uvj3y69kl6gas34ecuf2j5ggmye"], "source_code": ["https://github.com/RedChillies-Core"], "message_board": [], "chat": [], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/_redchillies"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.4142405085966, "priceChangePercentage24h": 39.40132645, "priceChangePercentage7d": 56.29818176}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.19025425555578, "priceChangePercentage24h": 10.60828525, "priceChangePercentage7d": 20.85457927}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04636580400442, "priceChangePercentage24h": 8.56343826, "priceChangePercentage7d": 20.079306}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36619492238694, "priceChangePercentage24h": 18.60011598, "priceChangePercentage7d": 27.28992627}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08939589389104, "priceChangePercentage24h": 10.21413653, "priceChangePercentage7d": 25.5853101}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.37749105860163, "priceChangePercentage24h": 5.98969144, "priceChangePercentage7d": 12.04240371}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.59875390084219, "priceChangePercentage24h": 8.25836053, "priceChangePercentage7d": 12.55699482}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12851761045328, "priceChangePercentage24h": 6.47784079, "priceChangePercentage7d": 13.48145477}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04959422730686, "priceChangePercentage24h": 4.42251835, "priceChangePercentage7d": 14.2575898}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:23:38.577Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "5", "credit_count": 0}}