{"data": {"id": 7966, "name": "4Bulls", "symbol": "4B", "slug": "4bulls", "category": "token", "description": "Introduction\r\n\r\n4Bulls is a unique software that is designed to empower retail “traders” and retail “investors” by\r\nallowing both to connect to external crypto exchanges (e.g. Binance, Coinbase Pro, etc.) via API\r\nand automate trades with 4Bulls’ high-power trading automation tools and copy trading tools.\r\n\r\nFor Traders\r\n\r\nRegardless of your choice of a crypto exchange, 4Bulls allows you to fully be in charge of the game and automate any of your desired trading strategies.\r\n \r\nExample: With 4Bulls, you can automate any Fibonacci strategy simply by drawing the fib retracement tool on the graph and placing logic (orders) on each of the levels. With 4Bulls, you can also program the software to jump into a trade for you when, for example, there is a break through an ascending/descending triangle. \r\n\r\nThere are no limitations with 4Bulls’ high-power trading tools. You will be able to automate your buy/sell/stop-loss order placements and create any complex logic with the drag-and-drop trading automation instruments.\r\n \r\nIn addition to the above-mentioned trading automation tools, our platform is powered with the copy trading functionality. A successful retail trader will be able to trade outside capital (in a semi-decentralized manner via API) for a remuneration fee that he or she chooses. A successful retail “trader” (“copy trade leader”) will be able to onboard retail “investors” (“copy trade followers”) who choose to connect to him or her.\r\n\r\nFor Investors\r\n\r\nUnlike retail “traders,” retail “investors” do not need any knowledge of retail trading. All that a retail “investor” needs to have is an account on an external crypto exchange with funds available for trading. With the 4Bulls copy trade feature, retail “investors” will be able to connect to successful “traders,” give limited access to the “traders” to indirectly manage the “investors’” accounts on external crypto exchanges (e.g. Binance, Coinbase Pro, etc.) via API, and allow the “traders” to indirectly manage the trading process on behalf of these “investors.” A retail “trader” with retail “investors” as followers will be able to trade his or her followers’ funds for a remuneration fee that the “trader” determines in advance.\r\n\r\nWhat Is So Special About 4B?\r\n\r\n• 4B is designed to be an irreplaceable backbone of the 4Bulls platform.\r\n• 4B has a limited supply of 1,000,000,000 tokens (only 10% of tokens are reserved\r\nfor the company; this 10% is locked for 5 years after token launch). The rest of the\r\ntokens are in circulating supply. The company is not in control of these assets.\r\n• No airdrops, staking, and other inflation-causing activities are offered or will ever\r\nbe offered by 4Bulls. 4B is purely a utility token designed to bring transparency\r\nand efficiency to the 4Bulls platform in the near future.\r\n• In some countries, the utility of the token may include rewards, payments, and\r\nfees. It especially applies to those countries where fiat options are not available.\r\n• The utility of 4B will increase with the number of new features and functions\r\navailable on the 4Bulls platform.\r\n\r\nLegal\r\n\r\n4Bulls adheres to all legal guidelines. At this moment, 4Bulls is neither a crypto exchange nor a digital wallet. We do not store our users’ money. The 4Bulls platform is merely a software that offers trading automation tools and that allows users to connect to their external crypto exchanges via API and trade directly on those external exchanges. In the future, upon integrating the 4Bulls token (4B) in the 4Bulls platform and ecosystem, all 4Bulls users will be required to go through the KYC (Know Your Customer) process in order to comply with anti-terrorism and anti-money-laundering (AML) laws.\r\n\r\nWhy Having A Token Is Essential\r\n\r\nThe 4Bulls token (4B) is essential for several reasons. The platform offers transparency via blockchain tech, and the platform’s activities require the use of distributed ledger technology. Some activities that are established between “traders” and “investors” require consensus. The mission of 4Bulls is to create a united hub for retail “traders” and retail “investors.” To make sure that every voice in our community is heard, we want to implement the governance model into the voting process of the platform. Thus, the key utility purpose of 4B will be governance. For consensus, we need smart contracts in place, as this will allow us to properly establish such connections.\r\n\r\nThe 4Bulls Team\r\n \r\nThe 4Bulls team consists of experienced software engineers and entrepreneurs. We have helped Silicon Valley and international startups grow from the ground up. This is not our first big journey.\r\n \r\nThe founder of 4Bulls, Ivan Kv, has helped over a dozen blockchain-related projects rise up and succeed in the field of distributed ledgers. Ivan was a founder of KV LLC, a boutique tech marketing agency based in Silicon Valley which has helped high-end technology brands establish more dominance in their fields. Ivan has been a co-organizer of large blockchain-related conferences and forums in San Francisco, Los Angeles, and Las Vegas. Additionally, Ivan is recognized as a serious retail trader and retail investor with an impressive following on YouTube.\r\n\r\n4Bulls’ Ultimate Mission\r\n\r\n4Bulls is here to make the finance world a fairer place for all participants involved. It’s time for retail “traders” and retail “investors” to connect directly without institutional investors being involved. Institutional investors should no longer monopolize the market. And capital should directly benefit those who own it. There is a legal way to directly connect “traders” with “investors.”\r\n \r\nWe are building a community of retail “traders” and retail “investors,” where retail “traders” can get access to trading automation tools and additional capital and retail “investors” can get access to unique investment opportunities in a decentralized manner with the potential for high ROIs.", "dateAdded": "2020-12-12T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "17", "dateLaunched": "2020-01-21T00:00:00.000Z", "tags": [], "urls": {"website": ["https://www.4bulls.com", "https://www.4bulls.com/whitepaper"], "technical_doc": ["https://www.4bulls.com/whitepaper"], "explorer": ["https://etherscan.io/token/0x43b72464a93687dc2f14d5e49086e641d011b890", "https://ethplorer.io/address/0x43b72464a93687dc2f14d5e49086e641d011b890"], "source_code": ["https://git.4bulls.com/4bulls/"], "message_board": ["https://www.4bulls.com/blog/"], "chat": [], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/4BullsTeam"]}, "platforms": [{"contractId": 1027, "contractAddress": "0x43b72464a93687dc2f14d5e49086e641d011b890", "contractPlatform": "Ethereum", "contractPlatformId": 1, "contractChainId": 1, "contractRpcUrl": ["https://bsc-dataseed1.binance.org", "https://bsc-dataseed.binance.org/", "https://bsc-dataseed1.binance.org:443"], "contractNativeCurrencyName": "Ethereum", "contractNativeCurrencySymbol": "ETH", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://etherscan.io", "contractExplorerUrl": "https://etherscan.io/token/0x43b72464a93687dc2f14d5e49086e641d011b890", "contractDecimals": 18, "platformCryptoId": 1027}], "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.3612195944546, "priceChangePercentage24h": 39.17601351, "priceChangePercentage7d": 55.88343741}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.18921099005988, "priceChangePercentage24h": 10.51699415, "priceChangePercentage7d": 20.73821455}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04643961244019, "priceChangePercentage24h": 8.73678066, "priceChangePercentage7d": 20.27032434}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.36150489443973, "priceChangePercentage24h": 19.04359337, "priceChangePercentage7d": 26.91891534}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08923299177811, "priceChangePercentage24h": 10.13388567, "priceChangePercentage7d": 25.32644123}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.37066222076509, "priceChangePercentage24h": 5.82115157, "priceChangePercentage7d": 11.57259827}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.59324173267264, "priceChangePercentage24h": 8.40116572, "priceChangePercentage7d": 12.41037007}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12853834341231, "priceChangePercentage24h": 6.49322954, "priceChangePercentage7d": 13.50599815}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.0508112068182, "priceChangePercentage24h": 4.59825653, "priceChangePercentage7d": 14.24542066}], "relatedExchanges": [], "wallets": [{"id": 9022, "name": "Trust Wallet", "tier": 1, "url": "https://www.trustwallet.com/", "chains": "ETH", "types": "app,trade", "introduction": "", "star": 2.0, "security": 3.0, "easyToUse": 3.0, "decentration": true, "focusNumber": 0, "rank": 1000008, "logo": "9022.png", "multipleChain": true}, {"id": 9025, "name": "MetaMask", "tier": 1, "url": "https://metamask.io/", "chains": "ETH,ETZ", "types": "pc", "introduction": "", "star": 1.0, "security": 2.0, "easyToUse": 4.0, "decentration": false, "focusNumber": 0, "rank": 1000013, "logo": "9025.png", "multipleChain": true}], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:24:21.459Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}