{"data": {"id": 8646, "name": "Mina", "symbol": "MINA", "slug": "mina", "category": "coin", "description": "## What Is Mina Protocol?\n\nMina Protocol is a minimal “succinct blockchain” built to curtail computational requirements in order to run DApps more efficiently. Mina has been described as the world’s lightest blockchain since its size is designed to remain constant despite growth in usage. Furthermore, it remains balanced in terms of security and decentralization. The project was rebranded from Coda Protocol to Mina in October 2020. \n\nTo learn more about this project, check out our deep dive of [Mina Protocol](https://coinmarketcap.com/alexandria/article/what-is-mina-protocol).\n\nThe Mina network has a size of only 22 KB, which is miniscule when compared to Bitcoin’s 300 GB blockchain.\n\n\n## What Is Mina Protocol’s Main Objective?\n\nMina is working on achieving an efficient distributed payment system that enables users to natively verify the platform right from the genesis block. Its technical whitepaper calls this a “succinct blockchain.”\n\nThe protocol uses Zero-Knowledge Succinct Non-Interactive Arguments of Knowledge (zk-SNARKs), a cryptographic proof that enables someone to authenticate information without revealing said information. However, enabling a user to trace the platform back to its genesis block can be impractical in a large network. As such, Mina incrementally computes SNARKS that concentrate only on the last few blocks — meaning that end-users check that zk-SNARK-compressed proof, instead of a block’s entire transaction history. \n\n\nAt the heart of Mina protocol is MINA, its native currency, which functions as a utility coin and medium of exchange.\n\n\n## How Does Mina Protocol Function?\n\nMina is similar to Bitcoin, apart from how it handles transactions, but also employs the account model used in Ethereum.\n\nIn this respect, the difference between Bitcoin and Ethereum is that the state of the Bitcoin blockchain contains a list of unspent coins, while Ethereum’s state is made up of account balances.\n\nMina, on the other hand, uses a prover (or snarker, if you will), an equivalent of a miner, to ensure each block commits to the state. \n\nMina employs the Ouroboros Samasika, a type of PoS mechanism specially designed for succinct decentralized networks since it provides bootstrapping from a genesis block.\n\nSuccinct blockchains contain two major functions: verify and update. Verification touches on consensus, blockchain summary and blocks, while the update function interacts with consensus and chain summary.\n\nApart from the above implementations, the project uses a parallel scan state to optimize transaction processing speed, which works by grouping unproven blocks and assigning the process to parallel provers.\n\n\n## Major Mina Protocol Participants\n\nMina is all about revolutionizing the current blockchain landscape where most platforms have verifiers such as miners/stakers and light clients who act as third parties when verifying transactions.\n\n\nMina takes a different approach by having multiple participants, each handling a specific function on the decentralized network.\n\n\nThe three major roles include verifiers, block producers and snarkers.\n\n\n* Verifiers\n* Verifiers interact with zk-SNARKS that deal with certifying the consensus information. Each Mina protocol user is considered a verifier, provided that their devices can handle a 22 KB chain and withstand a few milliseconds of processing time. \n\n\n## Block Producers\n\nBlock producers take the form of stakers or miners and earn block rewards and transaction fee payments. Interestingly, the protocol doesn’t slash incentives that go to block producers. This category of participants allows Mina users to delegate their coins to them.  \n\n\n\nApart from bundling transactions into blocks, block producers also have to SNARK an equivalent number of previously committed trades as failure to do so during block production would lead to incomplete blocks and other nodes rejecting their validity. \n\n\nIf a block producer wants to incorporate 10 transactions on the chain, they must also SNARK trades from the front of the queue. However, they have the option to produce the SNARK or use those generated by a special group of participants called snarkers.\n\n\n‍## Snarkers\n\nSnarkers, also known as provers, produce zk-SNARKs used in verifying transactions. \n\nBlock producers pay snarkers from the overall transaction fees they receive for adding new blocks. However, to qualify for the fees, they have to post bids. Note that a snarker’s zk-SNARK needs to be used in a block while the block producer who uses it is responsible for incentivizing the snarker.\n\n\nThis creates a business economy where multiple snarkers can post bids tied to the same transaction. Block producers, on the other hand, are in for the profits and will choose the bid with the lowest fees. Consequently, snarkers are challenged to produce low-cost SNARKS.\n\n\n## How Transactions Happen On Mina\n\nThe process starts with a user initiating a transaction, after which the trade goes to the mempool, a pool of valid but unconfirmed transactions.\n\nNext, snarkers take over by making proofs or SNARKS. The process follows with the selection of a block producer (BP) to bundle transactions into a block. Note that a BP sifts through the mempool for profitable transactions.\n\nThen, the BP chooses a SNARK according to the rules in the consensus mechanism. \n\nNote that a block producer scans through the bids for the lowest-priced SNARK. In addition, recently added transactions have an updated SNARKS order book.\n\nNext, it’s time to incorporate the SNARKS in a block, then add the block to the chain and update the network. Snarked transactions are removed from the chain to help keep the size of the protocol constant.\n\nThen, the block producer upgrades the protocol’s zk-SNARKS.\n\nFinally, the new block becomes immutably part of the chain.\n", "dateAdded": "2021-03-02T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T09:27:47.000Z", "watchCount": "73360", "tags": [{"slug": "pos", "name": "PoS", "category": "CONSENSUS_ALGORITHM"}, {"slug": "zero-knowledge-proofs", "name": "Zero Knowledge Proofs", "category": "PROPERTY"}, {"slug": "staking", "name": "Staking", "category": "PROPERTY"}, {"slug": "coinbase-ventures-portfolio", "name": "Coinbase Ventures Portfolio", "category": "PROPERTY"}, {"slug": "polychain-capital-portfolio", "name": "Polychain Capital Portfolio", "category": "PROPERTY"}, {"slug": "platform-token", "name": "Platform Token", "category": "PROPERTY"}], "urls": {"website": ["https://minaprotocol.com/"], "technical_doc": ["https://minaprotocol.com/docs"], "explorer": ["https://minaexplorer.com/", "https://hubble.figment.io/mina/chains/mainnet", "https://minascan.org", "https://mina.staketab.com/"], "source_code": ["https://github.com/MinaProtocol/mina"], "message_board": ["https://minaprotocol.com/blog", "https://medium.com/@minaprotocol"], "chat": ["https://discord.com/invite/Vexf4ED", "http://bit.ly/MinaTelegram"], "announcement": [], "reddit": ["https://reddit.com/r/MinaProtocol"], "twitter": ["https://twitter.com/MinaProtocol"]}, "volume": 11219742.27392326, "volumeChangePercentage24h": 77.322, "statistics": {"price": 1.66353635912414, "priceChangePercentage1h": 0.02309339, "priceChangePercentage24h": 22.12726063, "priceChangePercentage7d": 22.91010889, "priceChangePercentage30d": 15.37924943, "priceChangePercentage60d": -55.22045997, "priceChangePercentage90d": 0.0, "marketCap": 308086883.54, "marketCapChangePercentage24h": 22.4859, "fullyDilutedMarketCap": 1370928584.66, "fullyDilutedMarketCapChangePercentage24h": 0.0, "circulatingSupply": 185199969.84003925, "totalSupply": 824104972.0, "marketCapDominance": 0.0189, "rank": 129, "low24h": 1.3527677, "high24h": 1.67758683, "low7d": 1.24921182, "high7d": 1.67758683, "low30d": 0.92328276, "high30d": 1.67758683, "low90d": 0.92328276, "high90d": 5.44963482, "low52w": 0.92328276, "high52w": 5.44963482, "lowAllTime": 0.92328276, "highAllTime": 5.44963482, "lowAllTimeChangePercentage": 80.18, "highAllTimeChangePercentage": -69.47, "lowAllTimeTimestamp": "2021-07-21T02:37:20.000Z", "highAllTimeTimestamp": "2021-06-03T10:01:06.000Z", "lowYesterday": 1.3527677, "highYesterday": 1.49622274, "openYesterday": 1.3648117, "closeYesterday": 1.49306283, "priceChangePercentageYesterday": 9.4, "volumeYesterday": 7421950.69, "turnover": 0.03641746, "ytdPriceChangePercentage": 0.0}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.21356672108635, "priceChangePercentage24h": 39.95855789, "priceChangePercentage7d": 55.25780336}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.19525149091612, "priceChangePercentage24h": 11.16343854, "priceChangePercentage7d": 20.81102233}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04647594642417, "priceChangePercentage24h": 9.67128092, "priceChangePercentage7d": 20.11950625}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.3445933676189, "priceChangePercentage24h": 17.7671529, "priceChangePercentage7d": 26.02682465}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08933243867596, "priceChangePercentage24h": 11.03883388, "priceChangePercentage7d": 25.23742777}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.34491286064716, "priceChangePercentage24h": 5.48938733, "priceChangePercentage7d": 11.14705257}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.58967922291401, "priceChangePercentage24h": 9.54296389, "priceChangePercentage7d": 13.21669204}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12832738754273, "priceChangePercentage24h": 7.47824973, "priceChangePercentage7d": 13.02483051}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.05168326672731, "priceChangePercentage24h": 5.04058774, "priceChangePercentage7d": 14.01418947}], "relatedExchanges": [{"id": 294, "name": "OKEx", "slug": "okex"}, {"id": 42, "name": "HitBTC", "slug": "hitbtc"}, {"id": 302, "name": "Gate.io", "slug": "gate-io"}, {"id": 407, "name": "DigiFinex", "slug": "digifinex"}, {"id": 300, "name": "BitZ", "slug": "bitz"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T09:29:12.339Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}