{"data": {"id": 8916, "name": "Internet Computer", "symbol": "ICP", "slug": "internet-computer", "category": "coin", "description": "## What is the Internet Computer (ICP)?\n\nThe Internet Computer is the world’s first blockchain that runs at web speed with unbounded capacity. It also represents the third major blockchain innovation, alongside Bitcoin and Ethereum — a blockchain computer that scales smart contract computation and data, runs them at web speed, processes and stores data efficiently, and provides powerful software frameworks to developers. By making this possible, the Internet Computer enables the complete reimagination of software — providing a revolutionary new way to build tokenized internet services, pan-industry platforms, decentralized financial systems, and even traditional enterprise systems and websites.\nThe project was founded in October 2016 by Dominic Williams, and attracted notable interest from the crypto community. DFINITY raised a total of $121 million from contributors such as Andreessen Horowitz, Polychain Capital, SV Angel, Aspect Ventures, Electric Capital, ZeroEx, Scalar Capital, and Multicoin Capital, and several notable early Ethereum supporters. In 2018, over 50,000 registerter participants received ICP utility tokens in an airdrop. On December 18, 2020, DFINITY launched the alpha mainnet of the Internet Computer. In a final step towards decentralization, on May 10, 2021, DFINITY launched the Internet Computer into the public domain. This major milestone means that the internet now functions as a decentralized global computer — marked by the release of all of the Internet Computer’s source code into the public domain, as well as ICP utility token allowing tens of thousands of community members to govern the Internet Computer network.\n\nTo learn more about this project, check out our deep dive of [Internet Computer](https://coinmarketcap.com/alexandria/article/what-is-dfinity-icp).\n\n## Who Is The Founder of the Internet Computer?\nDominic Williams is the Founder and Chief Scientist of DFINITY. He is a crypto theoretician, responsible for inventing Threshold Relay, Probabilistic Slot Consensus, and other novel crypto techniques, serial entrepreneur, and early member of the Bitcoin and Ethereum technical communities. Previously, he was President and CTO of String Labs, an incubator for venture-backed crypto projects, early pioneer of DeFi at Mirror Labs, and Founder and CEO of Fight My Monster, a MMO game for children that scaled to millions of users. He also founded several startups such as System7, Airdocs and Smartdrivez. Graduated King’s College London 1st in Class in Computer Science.\n\n## What is the DFINITY Foundation?\nThe Internet Computer was incubated and launched by the DFINITY Foundation, a not-for profit scientific research organization based in Zurich, Switzerland, comprised of the world’s top cryptographers and distributed systems and programming language experts, with nearly 100,000 academic citations and 200 patents collectively. Notable technologists at DFINITY include:\n* Jan Camenisch, PhD (VP of Research) - world-renowned cryptographer &amp; privacy researcher, led IBM’s Cryptography / Research department for 19 years\n* Andreas Rossberg, PhD (Principal Engineer and Researcher) - the co-creator of WebAssembly and former team lead for the Google Chrome V8 engine\n* Ben Lynn, PhD (Sr Staff Engineer and Researcher) - world-renowned cryptographer and Google Engineer, the “L” in BLS cryptography, the key signature system being used in Ethereum 2.0\n* Jens Groth, PhD (Principal Researcher) - world-renowned cryptographer, known for pioneering non-interactive zero knowledge proofs\n* Timo Hanke, PhD (Principal Researcher) - creator of AsicBoost, one of the few proven algorithmic optimizations for Bitcoin mining\n* Paul Liu, PhD (Staff Engineer) - architected Intel’s Haskell compiler and received his PhD under Paul Hudak, a key designer of Haskell\n* Johan Georg Granström, PhD (Director of Engineering) - former Sr Staff Software Engineer at Google responsible for scaling YouTube system infrastructure\nAfter public launch on May 10, 2021, the DFINITY Foundation will now be one of many organizations committed to improving and maintaining the Internet Computer network.\n\n## What Makes the Internet Computer Unique?\n\nThe purpose of the Internet Computer is to extend the public internet, so it can also be the world’s compute platform. Today, the internet is a network that connects everybody and everything, but systems and services currently run from private infrastructure.\nThe scientific breakthrough behind the Internet Computer is Chain Key Technology, which encompasses dozens of advanced technology such as novel Consensus, Non-Interactive Distributed Key Generation (NI-DKG), Network Nervous System (NNS), Internet Identity, etc.\nChain Key Technology consists of a set of cryptographic protocols that orchestrate the nodes that make up the Internet Computer. It is one of the fundamental breakthroughs behind the Internet Computer, enabling it to have a single public key. This is a huge advantage because it allows any device, including smart watches and mobile phones, to verify the authenticity of artifacts from the Internet Computer. In contrast, this is not possible for traditional blockchains.\nThe single public key is just the tip of the iceberg: Chain Key Technology is the engine that drives the Internet Computer and makes its operation possible. It allows for adding new nodes to form new subnets to scale the network infinitely; replacing faulty or crashed nodes with new ones without ever stopping; reviving subnets even if too many nodes within have failed; and upgrading the Internet Computer Protocol seamlessly, allowing the network to fix bugs and add new features.\nThe DFINITY R&D team has invented a new noninteractive key resharing protocol. Each of the old signers only needs to broadcast a single message to the new signers. To ensure that this is done securely, many concepts from advanced cryptography are utilized, including encryption with forward secrecy and noninteractive zero-knowledge proofs. Because it is noninteractive, the way the key resharing protocol operates is ideal for an asynchronous environment, and the benefits include key preservation. Throughout the lifetime of a subnet, it is known by a single public key, and the other parties on the Internet Computer do not have to keep track of changing public keys.\n\n## Who Runs the Nodes in the Internet Computer Network?\nAt Genesis on May 10, 2021, the Internet Computer is supported by 48 independent data centers — located across North America, Europe, and Asia — running 1,300 nodes. The network will continue to grow exponentially to support the next generation of mega dapps, with 123 data centers running 4,300 nodes scheduled by the end of the year, and eventually thousands of data centers running millions of nodes to support the decade-long building out of the Open Internet.\nImportantly, anyone can become a node provider, interested parties apply for a Data Center ID (DCID) to the Network Nervous System (NNS), procure specialized machine nodes, install the ICP protocol, and connects to the Internet Computer network.\n\n## How Fast is the Internet Computer Network?\nThe scientific breakthrough called Chain Key Technology allows the Internet Computer to run at web speed — where query calls execute in milliseconds, and update calls take 1-2 seconds to finalize. More importantly, at Genesis, the Internet Computer will have a block rate of 2.5 blocks per second (bps), then quickly to an industry leading bps of 10.3 bps, and ~1,000 bps by end of the year.\nIn the case of an open version of Reddit running on the Internet Computer, when a user browses the forum, customized views of the hosted content would be formulated and served into their web browser by the execution of query calls, which run in milliseconds on a nearby node, providing a fantastic user experience. But when a user wishes to occasionally make a post, or provide a tip of tokens to the author of a post, this would involve update calls, which would take 1–2 seconds.\n\n## What Does the ICP Token Do?\n\nICP are native utility tokens that play three key roles in the network:\n\n* Facilitating Network Governance: ICP tokens can be locked to create neurons that participate in network governance by voting, through which they can earn economic rewards.\n* Production of Cycles for Compute: ICP provides a source store of value that can be converted into cycles; which power computation in the role of fuel that is burned when it is used. The NNS converts ICP to cycles at a variable rate, so chosen to ensure users of the network can always create new cycles at approximately constant cost in real terms, such that the cost of acquiring fuel is predictable.\n* Rewarding Participants: The network mints new ICP to reward and incentivize those playing important roles that enable the network to function, including: a) the provision of voting rewards to those participating in governance, b) the provision of voting rewards; to those operating the node machines hosting the network, and c) other miscellaneous activities.\n\n## What Do Cycles Do?\nCycles power computation in the role of fuel. They also have a constant value over the long-term, which contrasts with ICP, whose value will naturally vary over time. Moreover, Cycles will be pegged to the SDR, which is a logical currency unit defined by the International Monetary Fund, and 1 SDR worth of ICP can be converted into exactly one trillion Cycles to power computation.\n\n## What Do Neurons Do?\nA neuron locks a balance of ICP utility tokens and enables its owner to participate in network governance, through which they can earn voting rewards.\n\n## Who Are the Natural Buyers for ICP Tokens?\n* Token Holders who want to participate in network governance and earn voting rewards\n* Developers who need to convert ICP tokens into Cycles to pay for computation\n\n## ICP Token Supply and Tokenomics?\nThere will be 469,213,710 ICP tokens at Genesis.\nCirculating supply depends on the dynamics of the market. However, it is approximated to be 26% at Genesis.\nGenesis Initial State Token Allocations\n\n\n* Early contributors: 9.50%\n* Seed donations: 24.72%\n* Strategic: 7.00%\n* Presale: 4.96%\n* Strategic partnerships: 3.79%\n* Community airdrop: 0.80%\n* Initial community and developer grants: 0.48%\n* Node operators: 0.22%\n* Internet Computer Association: 4.26%\n* Team members: 18.00%\n* Advisors and other third-party token holders: 2.40%\n* DFINITY Foundation: 23.86%\n\n## How Does the Internet Computer Network Nervous System Work for Voting?\nThe NNS works by receiving proposals and deciding to adopt or reject them based on voting activity by neurons; that network participants have created. Neurons are also used by participants to submit new proposals. After submission, proposals are either adopted or rejected, which can happen almost immediately or after some delay, depending on how the totality of neurons vote.\n\n## Who Might List the Internet Computer?\nCoinbase, Huobi and OKEx have announced they will list Internet Computer utility tokens (ICP) when the Internet Computer launches on May 10 at 9AM PT / May 11 12AM China Time. \n\n## What Are The Prominent Projects In The Internet Ecosystem?\nThe Internet Computer launched with several high profile entrepreneurs and applications being built on it. These include:\n\n### DeFi\n* Enso Finance – Decentralized exchange that has raised $5mn\n* Tacen – A high-performance non-custodial exchange that has raised $2.5mn\n* SailFish – A gateway to open financial services\n\n### Social\n* Distrikt – A decentralized, professional social media network. It is the Open LinkedIn application shown off by DFINITY in Davos at WEF 2020 that is now being taken to market\n* OpenChat – An open version of your standard chat app that is not owned by a large tech corporation\n* CanCan – An open version of TikTok that shows the scalability and power of the Internet Computer\n* Capsule – A decentralized social media platform which is safe from censorship that has raised $1.5mn\n\n### Infrastructure\n* Fleek – Allows easy building of open web sites and applications. 14,000 websites already running\nPan-Industry Platforms\n* Origyn – A pan-industry platform for tracking the provenance of luxury goods, starting with luxury watches", "dateAdded": "2021-03-23T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T09:29:25.000Z", "watchCount": "178454", "dateLaunched": "2021-03-21T00:00:00.000Z", "tags": [{"slug": "platform", "name": "Platform", "category": "PROPERTY"}, {"slug": "distributed-computing", "name": "Distributed Computing", "category": "PROPERTY"}, {"slug": "polychain-capital-portfolio", "name": "Polychain Capital Portfolio", "category": "PROPERTY"}, {"slug": "exnetwork-capital-portfolio", "name": "Exnetwork Capital Portfolio", "category": "PROPERTY"}], "urls": {"website": ["https://dfinity.org"], "technical_doc": ["https://sdk.dfinity.org/docs/interface-spec/index.html"], "explorer": ["http://dfinityexplorer.org/"], "source_code": ["https://github.com/dfinity"], "message_board": ["https://medium.com/dfinity", "https://thereboot.com"], "chat": ["https://forum.dfinity.org", "https://t.me/DFinity"], "announcement": [], "reddit": ["https://reddit.com/r/dfinity"], "twitter": ["https://twitter.com/dfinity"]}, "volume": 219620927.98409447, "volumeChangePercentage24h": 2.7724, "statistics": {"price": 41.9618760443882, "priceChangePercentage1h": 1.82084615, "priceChangePercentage24h": 9.14317208, "priceChangePercentage7d": 22.38691313, "priceChangePercentage30d": -7.13331381, "priceChangePercentage60d": -61.55779721, "priceChangePercentage90d": 0.0, "marketCap": 5744547829.56, "marketCapChangePercentage24h": 9.1432, "fullyDilutedMarketCap": 19689087537.35, "fullyDilutedMarketCapChangePercentage24h": -3.14, "circulatingSupply": 136899213.55, "totalSupply": 471546472.5435788, "maxSupply": 469213710.0, "marketCapDominance": 0.3532, "rank": 21, "roi": 0.0, "low24h": 38.70051656, "high24h": 42.21085846, "low7d": 37.61967861, "high7d": 48.10708316, "low30d": 27.14294852, "high30d": 50.80014962, "low90d": 20.08352634, "high90d": 737.201, "low52w": 20.08352634, "high52w": 737.201, "lowAllTime": 20.08352634, "highAllTime": 737.201, "lowAllTimeChangePercentage": 108.94, "highAllTimeChangePercentage": -94.31, "lowAllTimeTimestamp": "2021-06-14T09:43:51.000Z", "highAllTimeTimestamp": "2021-05-10T16:03:06.000Z", "lowYesterday": 38.42525895, "highYesterday": 42.69738911, "openYesterday": 41.26241515, "closeYesterday": 42.15314812, "priceChangePercentageYesterday": 2.16, "volumeYesterday": 237668877.25, "turnover": 0.03823119, "ytdPriceChangePercentage": 0.0}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.10734945164149, "priceChangePercentage24h": 39.3258385, "priceChangePercentage7d": 55.07822279}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.20228456848141, "priceChangePercentage24h": 11.01863901, "priceChangePercentage7d": 20.8715583}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04646938435769, "priceChangePercentage24h": 9.59242332, "priceChangePercentage7d": 20.13094411}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34819853481682, "priceChangePercentage24h": 18.69811924, "priceChangePercentage7d": 26.29735003}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08917632064107, "priceChangePercentage24h": 10.856402, "priceChangePercentage7d": 25.12439624}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.34449767575729, "priceChangePercentage24h": 6.37764688, "priceChangePercentage7d": 11.10600251}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.59340021063595, "priceChangePercentage24h": 9.79388358, "priceChangePercentage7d": 13.28813508}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12833740050694, "priceChangePercentage24h": 7.57892734, "priceChangePercentage7d": 13.12853881}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04992025559031, "priceChangePercentage24h": 5.2087894, "priceChangePercentage7d": 13.72992738}], "relatedExchanges": [{"id": 270, "name": "Binance", "slug": "binance"}, {"id": 294, "name": "OKEx", "slug": "okex"}, {"id": 710, "name": "Tokocrypto", "slug": "tokocrypto"}, {"id": 102, "name": "Huobi Global", "slug": "huobi-global"}, {"id": 513, "name": "Bitget", "slug": "bitget"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T09:31:07.821Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "9", "credit_count": 0}}