{"data": {"id": 9091, "name": "CPCoin", "symbol": "CPC", "slug": "cpcoin", "category": "coin", "description": "What is the CryptoPerformance Token (CPCoin - CPC)?\r\n\r\nCPCoin is our signature coin and it was created to advance the CryptoPerformance ecosystem, aka CPC. It is an integral part of the crypto market advancing CryptoPerformance platform. The coins represent ownership and continue growth of our ever-expanding community. The CPCoin advances our unique ecosystem and has multiple functions that keep CPCoins in constant circulation. \r\n\r\nCPCoin is a peer-to-peer digital currency, without connections to traditional banking institutions or third party involvement. Like Bitcoin, there is no physical money exchanging hands, only a public ledger of digital files as they transfer from one account to another. These records are timestamped, and distributed to an entire network of people, making it nearly impossible to manipulate or hack. This is a unique security feature that normal computer files do not have. \r\n\r\nCPCoin is based on the Infinity Economics platform, a decentralized autonomous organization (or DAO) and we are proud to be building our CPCoin on this secure network. CPCoin is 100% proof of stake cryptocurrency and the price is regulated by supply and demand. As of now, a total of 250 million pieces are in circulation, starting with zero.\r\n\r\nCPCoin is the native utility token that is used for:\r\n\r\nPaying for transaction and all fees that arise on the CP platform, such as purchases, transfers, swaps and withdrawals, are covered by the CPCoin.  In addition, the CPC is also used for in-store payments on the CryptoPerformance platform.\r\n\r\n\r\nWhat makes the CPCoin unique?\r\n\r\nThere was no ICO with pre-launches to collect user funds, instead CPCoins are automatically circulated and immediately available in your wallet.\r\n\r\nThe entire investment in development, founding from the CPCoin, funding worldwide  companies, financial licenses, compliance, marketing and much more was financed by the founders themselves from their own resources.\r\n\r\nAn immediately 100% functioning ecosystem was created. All fees incurred on the CryptoPerfromance platform are processed fully automatically via CPCoin. The fees create a constant movement and thus a permanent market demand. The same as Perpetual Motion Machine.\r\n\r\nThe CPCoin also has a simple White Paper that is easy to understand for every people.\r\n\r\nCrypto performance users also get a Advantage program, whereby daily CPCs are received by holding the coins on the CP platform.\r\n\r\nThe CPC has its own [Securwallet] (https://securewallet.cpcoin.io/) and its own [Block Explorer] (https://www.explorer.cpcoin.io). \r\n\r\nCPCoin is based on the Infinity Economics platform, a decentralized autonomous organization (or DAO).\r\n\r\n\r\n## How many CPCoins are there in circulation?\r\n\r\nCPCoin launched in CryptoPerfromance platform on November 10, 2020 with 250 million CPC tokens created at genesis wallet. 50% Secondary distribution and launch incentives – 125 million CPC . The  secondary distribution will insert monthly tokens to the market (Monthly 1,25% - 3,125 million, more information in the whitepaper) The secondary distribution can vary depending on market demand and thus shorten or lengthen the time. 20% Ecosystem Development grants with the issue of promotion - 50.000.000 CPC . The Ecosystem Development grants used for promotion like advantage program, cashback, Referral benefits and other incentives. For development purposes, any tokens can be brought into the market in advance. 15% Consumer Protection Fund – 37,5 million CPC . The Consumer Protection Fund is frozen until Dec. 31, 2022. 15% Team and Founders – 37,5 million CPC. At the start, 15 million CPC were distributed to team and partners. The remaining coins are frozen until Dec. 31, 2021\r\n\r\n\r\nWho are the Founders of CPCoin?\r\n\r\nThe CPCoin was created by the founders Horst Stäbler and Giuseppe Rimola, who both have extensive crypto experience.\r\n\r\nThe two met in summer 2017 on a business trip \"Event on the Circuit Mallorca Llucmajor\". From this point on, a close friendship developed as they both have the same interests for the crypto market.\r\nThey have worked together on more ICOs to bring innovative cryptocurrencies to market. Unfortunately, it is very difficult for coins to be established on the market after an ICO.\r\n\r\nTroubled by this difficult and opaque market, a solution was worked on immediately. The question that arose was; How do you advance the crypto market and make it easier, better and faster for inexperienced users? This is why Crypto-Performance and the CPCoin was created.\r\n\r\n\r\nWhere can I buy CPCoins (CPC)?\r\n\r\nAs a native coin of the CryptoPerformance Platform, the CPC can be bought there. In addition, a holding program is offered, which is called the CPC Advantage Program, as advantage CPCoins are issued daily to hold the coins. The advantage is that the held CPCoins do not have to be blocked, but are freely available at any time. The detailed explanation is clearly defined in the white paper.\r\n\r\nCPC is available for trading on a growing number of exchanges, with cryptocurrency and [stablecoin] (https://coinmarketcap.com/alexandria/article/what-is-a-stablecoin) pairs currently available.\r\n\r\n[Bitmart] (https://coinmarketcap.com/exchanges/bitmart/) and [P2PB2B] (https://coinmarketcap.com/exchanges/P2PB2B/) offers the pairs [Bitcoin] (https://coinmarketcap.com/currencies/bitcoin/) (BTC) and [Tether](https://coinmarketcap.com/currencies/tether/) (USDT) as of November 2020, while [Alterdice] (https://coinmarketcap.com/exchanges/Alterdice/) and Exrates also offers [Ethereum] (https://coinmarketcap.com/exchanges/exrates/)(https://coinmarketcap.com/currencies/ethereum/) (ETH).\r\n\r\nNew to cryptocurrency? Read CoinMarketCap’s [easy guide](https://coinmarketcap.com/how-to-buy-bitcoin/) to buying Bitcoin or any other token.\r\n\r\n\r\nCryptoPerformance - The platfrom\r\n\r\nCryptoPerformance,  is an independent and user-friendly Cryptocurrency platform that is regulated with a Financial licence to buy and hold various digital assets.\r\nOn the website, you can buy, Hold, sell and trade bitcoin, ether and other digital assets. Whether you’re looking to go to the next level and upscale your crypto investing strategy, or are still trying to wrap your head around what cryptocurrency really means.\r\n\r\nWe are committed to growing and expanding the crypto community worldwide, by making crypto technology available to everyone.\r\n\r\nAt CryptoPerformance we cover all things crypto. Our site also provides a comprehensive guide to all the complex information that an eager beginner would need, in order to confidently start investing, to create a Digital Asset portfolio.\r\n\r\nOur unique selling point, is making the purchase of different coins quick and easy for everyone, we are able to keep up with the most active traders.\r\n\r\nOur advanced system is designed to process multiple transactions at the same time, giving you the flawless experience you’re looking for. And as for privacy and safety of your information, we provide the highest standards of security, so you can rest assured knowing that your digital assets are protected.\r\n\r\nIn addition, a special average program is offered to expand your crypto  portfolio. Through the regular weekly purchase of different coins, we provide strategies on how to become a profitable crypto trader. \r\n\r\nBecause  the future belongs to blockchain technology and it’s growing community, we are dedicated to growing our platform and expanding our reach with every transaction.", "dateAdded": "2021-04-01T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T09:30:38.000Z", "watchCount": "710", "dateLaunched": "2020-11-09T00:00:00.000Z", "tags": [], "urls": {"website": ["https://www.cpcoin.io", "https://securewallet.cpcoin.io/"], "technical_doc": ["https://crypto-performance.net/pdfs/whitepaper_ENG.pdf"], "explorer": ["https://www.explorer.cpcoin.io"], "source_code": [], "message_board": [], "chat": ["https://t.me/CPCoinOfficial"], "announcement": [], "reddit": [], "twitter": []}, "volume": 5503903.41286409, "volumeChangePercentage24h": -13.0351, "statistics": {"price": 3.95567493655151, "priceChangePercentage1h": -0.81767454, "priceChangePercentage24h": -2.98902473, "priceChangePercentage7d": -10.62109151, "priceChangePercentage30d": -43.60208305, "priceChangePercentage60d": -22.77653204, "priceChangePercentage90d": 56.17245614, "marketCap": 0.0, "marketCapChangePercentage24h": 0.0, "fullyDilutedMarketCap": 988918734.14, "fullyDilutedMarketCapChangePercentage24h": -0.47, "circulatingSupply": 0.0, "totalSupply": 0.0, "maxSupply": 250000000.0, "marketCapDominance": 0.0, "rank": 2635, "low24h": 3.94126166, "high24h": 4.20687718, "low7d": 3.34692762, "high7d": 4.64785927, "low30d": 3.34692762, "high30d": 7.18222123, "low90d": 2.37953685, "high90d": 9.42847619, "low52w": 1.21615585, "high52w": 9.42847619, "lowAllTime": 1.21615585, "highAllTime": 9.42847619, "lowAllTimeChangePercentage": 225.26, "highAllTimeChangePercentage": -58.05, "lowAllTimeTimestamp": "2021-04-01T21:39:09.000Z", "highAllTimeTimestamp": "2021-06-26T09:02:11.000Z", "lowYesterday": 3.99049405, "highYesterday": 4.26223368, "openYesterday": 4.21651201, "closeYesterday": 4.15905363, "priceChangePercentageYesterday": -1.36, "volumeYesterday": 6550402.39, "ytdPriceChangePercentage": 0.0}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.20596070703804, "priceChangePercentage24h": 39.35940442, "priceChangePercentage7d": 55.24084746}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.19114339442229, "priceChangePercentage24h": 10.69777669, "priceChangePercentage7d": 20.65727245}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04648861272948, "priceChangePercentage24h": 9.36404118, "priceChangePercentage7d": 20.13881818}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34805398178444, "priceChangePercentage24h": 18.39425772, "priceChangePercentage7d": 26.32931142}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08875576355692, "priceChangePercentage24h": 9.96926562, "priceChangePercentage7d": 24.34873985}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.33694404096231, "priceChangePercentage24h": 5.74846408, "priceChangePercentage7d": 10.91282617}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.61083613829526, "priceChangePercentage24h": 9.8597277, "priceChangePercentage7d": 15.30706896}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12824428571171, "priceChangePercentage24h": 7.41160033, "priceChangePercentage7d": 13.03728572}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04939216366166, "priceChangePercentage24h": 4.77179605, "priceChangePercentage7d": 13.43524148}], "relatedExchanges": [{"id": 215, "name": "P2PB2B", "slug": "p2pb2b"}, {"id": 406, "name": "BitMart", "slug": "bitmart"}], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T09:32:21.490Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}