{"data": {"id": 9190, "name": "ADAM Oracle", "symbol": "ADAM", "slug": "adam-oracle", "category": "coin", "description": "## What Is ADAMoracle (ADAM)?\n\nADAMoracle is the first cross-chain decentralized oracle that supports wide-area node quotations. It can provide smart contract developers with comprehensive tools and data, as well as a safer and more convenient overall oracle solution. ADAMoracle will promote the development of rich business formats such as lending, asset synthesis, and prediction markets by connecting real-world data and blockchain systems.\n\n### Who Are the Founders of ADAMoracle?\n\nAhmed Ebrahim is ADAMoracle's Founder and CEO ,Ahmed has an in-depth understanding of financial planning, accounting, analytics, and investments. He holds an MBA in International Finance and Investment. He has been awarded by China Development Bank in 2018. And have successfully invested in several blockchain projects.\nChristopher Quet is ADAMoracle's CMO, who graduated in International Trading in Lyon University, France, after studying in electronics. Christopher has operated and developed business in over 80 countries throughout his 22 years of experience, developing partnerships, and unique customized solutions. Christopher has a proven ability to adapt to a given market, with a strong sales, marketing, and team management experience, Christopher has successfully established and managed a network of international subsidiaries.\nOlga Petrovska is ADAMoracle's COO ,who is originally from Ukraine, where she studied English and Literature at the Uman State Linguistic University. With 2 brothers, falling in IT, Olga decided to take the path of business.After some years of experience working abroad for various international corporations, first in USA and in the United Arab Emirates for the last 8 years, Olga became an expert in blockchain related projects. With a strong believe that technology serves for the better, “blockchain has become the cutting-edge innovation that will lead global major industries into the future era”.\n\n### What Makes ADAMoracle Unique?\n\nWide-area node: global node network deployment to realize unbounded interstellar network computing.\nDistributed data sources: data interconnection and interoperability to realize automated distributed storage.\nLow threshold: a quotation system that everyone can participate in by connecting multi-types of servers.\nSecurity: involved massive security hardware to avoid related attacks.\nHigh scalability: Compatible with many blockchain technology development frameworks,  a developer-friendly collaborative ecosystem.\nHigh accuracy: with an oracle performance evaluation system to achieve accurate quotation.\nReal-time price acquisition: Real-time monitoring of multiple data sources, offline aggregation and online quotation, realizing quick data transmission.\nDAO governance: Provides functions such as new members joining, proposals, voting, governance, etc., with high flexibility and transparency.\n\n### How Many ADAMracle (ADAM) Coins Are There in Circulation?\n\nThe total ADAM token supply for sale will be 100,000,000 ADAM. According to the network’s whitepaper,\nMining output 60%, used for ADAMoracles’s Computing Nodes.\nLiquidity mining 9% , the liquidity is 6 million, and the single currency pledge is 3 million. The release is completed in 96 weeks, and the decrease is 10% every four week.\nCommunity contributors 5%, It is used for the mining rewards of the main node and the backup node and the payment of the fees for the various proposals initiated by the community.\nPresale 16%, There are three rounds,seed round, private placement round, and public placement round.\nCommunity operation 5%, used for various community operation activities such as community airdrops.\nMarket operation, 5%, used for market cooperation, team operation, etc, and,\nTeam reservation, 5%.\n\n### News\n\nhttps://cryptodaily.co.uk/2021/06/what-should-we-expect-from-adamoracle\nhttp://markets.financialcontent.com/stocks/news/read/41428623\nhttps://www.cryptocnn.top/unprecedented-economic-model-why-adamoracle-opened-the-oracle-3-0-era/ ", "dateAdded": "2021-04-09T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "157", "launchPrice": 0.5, "tags": [{"slug": "oracles", "name": "Oracles", "category": "PROPERTY"}, {"slug": "dao", "name": "DAO", "category": "PROPERTY"}, {"slug": "yield-farming", "name": "Yield farming", "category": "PROPERTY"}], "urls": {"website": ["https://www.adamoracle.io/"], "technical_doc": [], "explorer": ["https://www.oklink.com/"], "source_code": [], "message_board": [], "chat": ["https://t.me/adamoracleEnglish", "https://t.me/adamoracleChinese"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/kkms38"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.24166129120971, "priceChangePercentage24h": 39.34272879, "priceChangePercentage7d": 55.14597679}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.05945464255914, "priceChangePercentage24h": 9.72068904, "priceChangePercentage7d": 19.69674765}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04646020423439, "priceChangePercentage24h": 9.24519143, "priceChangePercentage7d": 19.93829757}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34543127132665, "priceChangePercentage24h": 18.10634214, "priceChangePercentage7d": 26.07975349}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08848357044107, "priceChangePercentage24h": 9.68926522, "priceChangePercentage7d": 23.90068823}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.33655507262923, "priceChangePercentage24h": 5.51260811, "priceChangePercentage7d": 10.6367239}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.6049363775859, "priceChangePercentage24h": 9.53740765, "priceChangePercentage7d": 15.20416456}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12785422107494, "priceChangePercentage24h": 6.99760207, "priceChangePercentage7d": 12.70459243}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04698230570444, "priceChangePercentage24h": 4.32158169, "priceChangePercentage7d": 12.92562492}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:33:00.495Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "7", "credit_count": 0}}