{"data": {"id": 9324, "name": "BunkerBits", "symbol": "BUNKER", "slug": "bunkerbits", "category": "token", "description": "Our mission, our future.\r\n\r\nWelcome to all readers, take a seat and get ready to learn about our legacy, our mission, our future.\r\n\r\nBunkerBits is the creation from Zoomers, crypto enthusiasts born between 1997–2012, the reason we point out this, is just because every new generation will be different from the last one.\r\n\r\nAs the first social generation to have grown up with access to the Internet and portable digital technology from a young age, members of Generation Z have been dubbed «digital natives»\r\nAround the world, members of Generation Z are spending more time on their electronic devices and less time reading books than before, Generation Z is quite young and is mostly enrolled in college and universities. Not possessing as much buying power as Generation Y, Generation Z’s investment in cryptocurrencies is almost half the investment dedicated by Generation Y. \r\nDespite having less participation than millennials, our generation will be driving the crypto markets and blockchain ecosystems into the future.\r\nThe equation says Zoomers = Future\r\nWe don’t trust centralized infrastructures, we are the generation in the world with not an ample supply of funds but quality education and knowledge.\r\nThis century is revolving around technology, several changes in the environment are expected but where and when?\r\nBunkerBits is the place for that, Zoomers is the most large generation and we aim to build with the whole world, this is a question of cooperation, initiative and effort but the most important is cooperation\r\nThis is the moment to start building and working for a long term future.\r\nFrom our side we are looking at a future with a mentor, a person to look at and see if your doing good, a person with sufficient knowledge to remake the world.\r\nElon Musk.\r\nSomeone asked him, what people should work on?\r\nElon: Well, first of all, I think if somebody is doing something that is useful to the rest of society, I think that’s a good thing. It doesn’t have to change the world. If you’re doing something that has high value to people and frankly even if it’s something…if it’s just a little game or, you know, the system improvement in photo sharing or something, if it has a small amount of good for a large number of people, I mean I think that’s fine. Stuff doesn’t need to change the world just to be good.\r\nBunkerBits is not only a token or a community, BunkerBits is a meaning of working for the future and make it useful, something that makes you wake up with something fun.\r\nThere is many things yet to accomplish as a project but our idea will keep for the rest of our life, remember this is not only a token, this is the meaning of the future.", "dateAdded": "2021-04-20T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "4", "dateLaunched": "2021-04-09T00:00:00.000Z", "launchPrice": 1.5, "tags": [], "urls": {"website": ["https://bunkerbits.com/"], "technical_doc": [], "explorer": ["https://bscscan.com/address/0xcf0ab2809feca548d9f1fd7ed4782e37b79faf51"], "source_code": [], "message_board": ["https://medium.com/@BunkerBitstoken/our-mission-our-future-13b2aee8b3f6"], "chat": [], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/bunkerbits"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.39573307597338, "priceChangePercentage24h": 39.99695168, "priceChangePercentage7d": 55.65196276}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.13951826462414, "priceChangePercentage24h": 10.41720606, "priceChangePercentage7d": 20.23403521}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04642130446666, "priceChangePercentage24h": 9.47479612, "priceChangePercentage7d": 19.76378252}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34543127132665, "priceChangePercentage24h": 18.10634214, "priceChangePercentage7d": 26.07975349}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08809375205785, "priceChangePercentage24h": 9.47012283, "priceChangePercentage7d": 23.20479819}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.3365804189963, "priceChangePercentage24h": 5.72571723, "priceChangePercentage7d": 10.81210172}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.61551425760311, "priceChangePercentage24h": 9.84200543, "priceChangePercentage7d": 15.02118715}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12756201108951, "priceChangePercentage24h": 6.48873139, "priceChangePercentage7d": 12.44700682}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04698230570444, "priceChangePercentage24h": 4.32158169, "priceChangePercentage7d": 12.92562492}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:34:03.285Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}