{"data": {"id": 9371, "name": "COINsolidation", "symbol": "CUAG", "slug": "coinsolidation", "category": "token", "description": "## What Is COINsolidation (CUAG)?\r\n\r\nCOINsolidation CUAG  – (Consolidated Universal Address Genesis) implement a set of algorithms (processes) to consolidate cryptographic addresses and help their administration, as well as implement shipping security and extension to the financial market to use it with a legal approach in the use of the addresses that are currently managed.\r\n\r\nThe processes to consolidate the private key of addresses of different blockchains, currently used in the financial area (cryptocurrencies), applications and various sectors. \r\n\r\nWe propose algorithms (processes) the first one we call oneCKey (one Consolidated prívate Key) is applied to consolidate private keys (One private key for addresses of different blockchain technologies). This is used to create more efficient private key management systems. This system is in sets of series to be, the first Series A1 or \"Genesis\" series we apply oneCKey on the Bitcoin and Ethereum blockchains with a ratio of 1:2 (one private key to generate two addresses) and later we will have Series AX and BX where there will be ratios of 1:N (one private key for N-addresses). \r\n\r\nThe A3 series applies to 18 cryptocurrencies and 2 tokens. This would be a 1:20 ratio (one consolidated private key for common use in 20 address) \r\n\r\nWe use another algorithm called CUA (Consolidated Universal Address) for the creation of universal addresses that we will call consolidated addresses. The CUA algorithm is broken down into three types of address consolidation which are; CUA \"Consolidated Universal Address\" an address formed from Cryptocurrency with Cryptocurrency, DAC \"Direct Address Consolidated\" an address formed from Token with Token and the HAC \"Hybrid Address Consolidated\" an address formed from Token with Cryptocurrency. We use this consolidation of pairs of addresses to send addresses of different blockchain consolidated in a single address applying different security processes to ensure its delivery in any medium, as well as the ease of only sending one address for each pair of addresses that we consolidate.\r\n\r\nThe other algorithm we have the new IBAC (International Bank Address Coin), this is the mapping of any IBAN account (International Bank Account Number). We created the first Bitcoin addresses based on the IBAN, these are the first Bitcoin addresses with \"Legal Identification\" in the financial sector worldwide. Each IBAN has its respective unique IBAC (address).\r\n\r\nThe above algorithms are implemented using PQC (Post-Quantum Cryptography) security since we anticipate in the near future the risks of the quantum computing area.\r\n\r\n\r\n## How Many CUAG Tokens Are There in Circulation?\r\n\r\nCOINsolidation CUAG will be launch its mainnet Ethereum on April 30, 2021 with 30 billion CUAG tokens created. Token distribution; 70% token sale, advisors 10%, partners 5%, exchanges market 1.5%, marketing 5%, COINsolidation foundation 0.5%, blockly developer communities 0.5%, development and research of quantum computing 1.5% and team and development 10%. See the whipaper.\r\n\r\n\r\n\r\n### Who Are the Founders of COINsolidation CUAG?\r\n\r\nCOINsolidation is the brainchild of developer Guillermo Vidal and businessman Angel Morales, both of whom have extensive experience in programming and businesses in emerging technologies.\r\n\r\nGuillermo Vidal is experienced development and implementation of blockchain (private & public) applying innovation technology \"Quantum Computing\".\r\n\r\nHe planned, developed and led the blockchain project - \"Mini BlocklyChain\" the first mini blockchain for smartphone, as well as the Mini PQC (Post-Quantum Cryptography) libraries and hardware using quantum technology as Mini QRNG (Mini Quantum Random Number Generator). \r\n\r\nhttps://github.com/openqbit-diy/MiniBlocklyChain\r\nhttps://github.com/openqbit-diy/MiniPQC\r\nhttps://github.com/openqbit-diy/MiniQRNG\r\n\r\n*Creator and developer of the algorithm oneCKey - (One Consolidated Private Key)\r\n*Development in quantum consensus and algorithm \"CUA\" - Consolidated Universal Address for crytocurrencies.\r\n\r\nGuillermo is CEO and Founder company OpenQbit.com dedicated to Quantum Computing (Hardware and software low cost).\r\n\r\n+25 years’ experience in computer systems (Research, development, implementations, administration, sales systems).\r\n\r\n*Bachelor's degree Systems engineering. \r\n*Software Quantum Computer degree. \r\n*Master of Business Administration - MBA.\r\n\r\n\r\nAngel is a pioneer in the Blockchain project, he has served as a manager in the corporate world achieving implementations focused on mobility and digital transformation in the private and public sectors through multidisciplinary teams.\r\n\r\nDirect negotiations with world brands such as Oracle, IBM, HP, EMC, VMware and more.\r\n\r\n* More than 20 years of experience in information technology and innovation.\r\n\r\n*Bachelor`s degree Telecommunications engineering.\r\n*Studies of Senior Business Management\r\n*Master in Information Technologies\r\n\r\n\r\n### What makes us unique?\r\n\r\nWe are implementing new algorithms to make the address management of different blockchain technologies more efficient, in this first stage using our algorithm (application) oneCkey can manage with a single private key 20 addresses of different types of cryptocurrencies. We also implement the CUA (Consolidated Universal Address) algorithm that creates an address from a couple of addresses, this will help us to safely send addresses by referring to a single address, another solution we propose is the creation of a mapping of how many bank IBANs (International Bank Account Number) to an IBAC (International Bank Address Coin) to give legality and identity to cryptocurrency addresses.\r\n\r\n\r\n### Where Can I Buy COINsolidation (CUAG)?\r\n\r\nWe will have our own application where users can directly buy the Token in the first three initial sales stages.\r\n\r\nLater we will be in different Exchanges.\r\n\r\nCUAG will be available for trading on a growing number of exchanges, with cryptocurrency and tokens\r\n\r\nExample:\r\n\r\n[Binance] \r\n[Huobi Global] \r\n[Bitcoin] \r\n[Coinbase] \r\n[Kraken]", "dateAdded": "2021-04-20T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "7", "dateLaunched": "2021-04-29T00:00:00.000Z", "launchPrice": 0.01, "tags": [], "urls": {"website": ["http://www.coinsolidation.org", "http://www.coinsolidation.io"], "technical_doc": ["https://github.com/coinsolidation/whitepaper/blob/main/EN%20-%20WhitePaperTecnicoComplete.pdf"], "explorer": ["https://etherscan.io", "https://ethplorer.io"], "source_code": ["https://github.com/coinsolidation/source"], "message_board": ["https://medium.com/@COINsolidation"], "chat": ["https://t.me/COINsolidationToken"], "announcement": ["https://bitcointalk.org/index.php?topic=5328643.0"], "reddit": [], "twitter": ["https://twitter.com/ecoinsolidation"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.39573307597338, "priceChangePercentage24h": 39.99695168, "priceChangePercentage7d": 55.65196276}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.13951826462414, "priceChangePercentage24h": 10.41720606, "priceChangePercentage7d": 20.23403521}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04642130446666, "priceChangePercentage24h": 9.47479612, "priceChangePercentage7d": 19.76378252}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34543127132665, "priceChangePercentage24h": 18.10634214, "priceChangePercentage7d": 26.07975349}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08809375205785, "priceChangePercentage24h": 9.47012283, "priceChangePercentage7d": 23.20479819}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.3365804189963, "priceChangePercentage24h": 5.72571723, "priceChangePercentage7d": 10.81210172}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.61551425760311, "priceChangePercentage24h": 9.84200543, "priceChangePercentage7d": 15.02118715}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12756201108951, "priceChangePercentage24h": 6.48873139, "priceChangePercentage7d": 12.44700682}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04698230570444, "priceChangePercentage24h": 4.32158169, "priceChangePercentage7d": 12.92562492}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:34:24.289Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "8", "credit_count": 0}}