{"data": {"id": 9406, "name": "Penky", "symbol": "PENKY", "slug": "penky", "category": "token", "description": "Penky is a blockchain-based social betting platform that allows players to buy celebrity NFTs and bet on concrete events related to their public and private life.\n\nPENKY is the native utility token that is used for:\n\n* Fees for processing transactions into the Penky betting platform.\n\n* Trading Penky NFT's  in the Penky Marketplace.\n\n* Swapping with the PENKY GOVERNANCE, thus obtaining the right to vote and the right to receive rewards from the Penky Platform. \n\nPenky Platform launched its token in May 2021 with 7.2 million PENKY created at genesis. 200,000 PENKY is the 2021 max circulating supply, 200,000 additional supply will be unlocked every May 15th starting from 2022. There will be no additional supply over years.\n\nPENKY is the brainchild of anon developers who have delegated to Penky's DAO any economic and structural decisions of the project, allowing the creation of a genuine decentralized ecosystem governed by the users of Penky Platform and by the holders of PENKY.\n\nGeneral info about PENKY:\n\nBetting is a three trillion dollar industry involving one in four people. However, the online sector is marred by a lack of transparency and creativity that penalizes players thus creating an interesting opportunity for Penky: the first social betting platform based on blockchain technology that allows players to buy celebrity NFTs and bet on concrete events. related to their public life.\n\nPenky enhances three key aspects in an innovative way: Players, NFT technology and Decentralization.\n\nIn recent years, betting has transformed from a social and engaging pastime to a risky and solitary activity, in which each player is alone in front of the house or - worse - to opaque software. Penky revolutionizes this paradigm by bringing the players themselves to the center of attention, where they become a cohesive and active community that decides and shares every phase of the game: from the choice of characters to the formulation of the bet, from the proclamation of the winner to the division of profit from the platform.\n\nPenky's Celebrity NFTs - a universe that represents sportsmen, actors, musicians, politicians and influencers - are the tool through which you can bet on the performances and events of famous people from around the world. Through the purchase of celebrity NFTs and betting applied to their real life, Penky has tokenized the emotional connection between celebrities and players, creating an identity overlap that engages the user personally and throughout the gaming process. NFT ownership and related bets are not just an investment plan, but a whole new way for fans to express their passion for celebrities and lose or win with them.\n\nThe entire betting platform is completely decentralized and managed by smart contracts on sidechain Matic. Ultimately, there is no centralized management that can in any way control the Bank: in fact it is fully governed - both on the decision-making and on the administrative level - by the holders of Penky's token governance who divide all the profits generated by the bets on a weekly   basis. Penky therefore transforms investors and players into the platform's sole shareholders, guaranteeing incorruptibility through the entire project.\n\nIn conclusion, Penky is a self-managed platform by the players themselves who autonomously create new NFTs, new bets, validate the outcome of concluded bets and earn 100% of the fees generated by the platform weekly. A unique model that is unprecedented, a project with the aim of transforming betting into a social and fun experience, definitely opposing the current gaming platforms that tend to isolate the player in order to take advantage of their weaknesses.\n\n", "dateAdded": "2021-04-21T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "4", "dateLaunched": "2021-02-28T00:00:00.000Z", "tags": [], "urls": {"website": ["https://penky.io"], "technical_doc": ["https://penky.io/wp-content/uploads/2021/07/Penky-Whitepaper.pdf"], "explorer": ["https://polygonscan.com/token/0x3a35e98cc7390a15d458bb85f9a12823e2ef25ed"], "source_code": [], "message_board": [], "chat": ["https://t.me/penkyOfficial"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/penkyofficial"]}, "platforms": [{"contractId": 3890, "contractAddress": "0x3a35e98cc7390a15d458bb85f9a12823e2ef25ed", "contractPlatform": "Polygon", "contractPlatformId": 25, "contractChainId": 137, "contractRpcUrl": ["https://rpc-mainnet.maticvigil.com"], "contractNativeCurrencyName": "MATIC", "contractNativeCurrencySymbol": "MATIC", "contractNativeCurrencyDecimals": 18, "contractBlockExplorerUrl": "https://polygonscan.com", "contractExplorerUrl": "https://polygonscan.com/token/0x3a35e98cc7390a15d458bb85f9a12823e2ef25ed", "contractDecimals": 18, "platformCryptoId": 3890}], "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.51961028446848, "priceChangePercentage24h": 40.05897643, "priceChangePercentage7d": 55.08756307}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.09993818062774, "priceChangePercentage24h": 9.86982167, "priceChangePercentage7d": 19.75462837}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04639215361782, "priceChangePercentage24h": 9.13811962, "priceChangePercentage7d": 19.76587648}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34600204194768, "priceChangePercentage24h": 18.31417693, "priceChangePercentage7d": 25.96994307}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08817176397124, "priceChangePercentage24h": 9.22152403, "priceChangePercentage7d": 23.30137851}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.33359854728193, "priceChangePercentage24h": 5.66084021, "priceChangePercentage7d": 10.68392023}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.62329345078651, "priceChangePercentage24h": 9.8204927, "priceChangePercentage7d": 15.27014225}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12773403744909, "priceChangePercentage24h": 6.63156837, "priceChangePercentage7d": 12.11450108}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04584695150604, "priceChangePercentage24h": 4.05885686, "priceChangePercentage7d": 12.83521981}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:34:37.202Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}