{"data": {"id": 9543, "name": "BICONOMY", "symbol": "TBD", "slug": "biconomy", "category": "token", "description": "What Is BICONOMY (TBD)?\n\n[Biconomy](https://coinmarketcap.com/currencies/biconomy/) is a relayer infrastructure network and a transaction superhighway for[ Web 3.0](https://coinmarketcap.com/alexandria/article/what-is-web-3-0) designed to reduce friction between blockchain applications and end-users. Thus, the startup is helping blockchain developers simplify the onboarding and transaction experience for Web 3.0 projects. The Biconomy team is focused on improving the user experience of decentralized applications to make it easier to work with Web 3.0, which will possibly lead to mass adoption of the product.\n\nThe Biconomy relay network consists of a software development kit (SDK) and a dashboard. Its task is to alleviate the difficulties associated with opening a wallet, buying cryptocurrency, storing private keys, and paying for gas.\n\nOn May 4, 2021, the beta version of the core infrastructure was launched. The platform provides gasless interoperability with decentralized application protocols ([DApps](https://coinmarketcap.com/alexandria/glossary/decentralized-applications-dapps)). It also removes the technical barriers to the wider use of DApps and enables developers to manage application users effectively. So far, Biconomy is focused on interacting with Ethereum-based projects, but it can be used with any blockchain.\n\nThe current Biconomy infrastructure is built on Ethereum (Ropsten, Kovan, and Rinkeby as testnets),[ Matic](https://coinmarketcap.com/currencies/polygon/) Network (testnet and mainnet),[ Binance Smart Chain](https://coinmarketcap.com/alexandria/article/what-is-binance-smart-chain) (testnet and mainnet), Xdai (mainnet), Arbitrum (mainnet), Moonbeam (mainnet), and Ava Labs (testnet).\n\nIn January 2021, Biconomy raised $ 1.5 million in a seed funding round led by Eden Block. In addition, eight more investors participated in the round, including blockchain-focused venture capital firm Fenbushi Capital, cryptocurrency exchange Binance, and Digital Asset Capital Management Inc. (DACM).\n\nWho Are the Founders of BICONOMY?\n\nAll three co-founders of Biconomy (Ahmed Al-Balaghi, Sachin Tomar, and Aniket Jindal) gathered together for the first time in early 2019. \n\nAhmed Al-Balaghi holds the position of CEO. On top of that, he's Founder and Co-Host of Encrypted Podcast (MENA's largest podcast dedicated to fintech, blockchain and crypto assets). Al-Balaghi graduated with a degree from the Queen Mary University of London studying Economics and Mathematics. Later, he earned a scholarship to study Mandarin at Fudan University. Prior to Biconomy, Al-Balaghi worked for Viewfin, a leading Chinese blockchain company. He also has experience working with Citibank, Dow Jones, and Ofgem.\n\nSachin Tomar is CTO of the company. He is a skilled blockchain developer who leads the technical architecture of Biconomy. Tomar studied at Dr. B.R. Ambedkar National Institute of Technology Jalandhar. He has more than eight years of experience in IT, and he also worked with Samsung and Makemytrip.\n\nAditya Khanduri is Head of Marketing (previously the Head of Growth at Cryptio), and Divya Nailwal works as a Full Stack Developer (formerly of TCS & Home Credit).\n\nLast but not least, Aniket Jindal is the COO of Biconomy. Jindal is an Angel investor in the Indian blockchain space. He is a true crypto expert with diverse backgrounds in marketing, investing, and operations. \n\nWhat Makes BICONOMY (TBD) Unique?\n\nWeb 3.0 applications, also called DApps, are built on decentralized peer-to-peer ([P2P](https://coinmarketcap.com/alexandria/glossary/peer-to-peer-p2p)) networks like[ Ethereum](https://coinmarketcap.com/currencies/ethereum/). As you may know, many DApps have complex registration processes. This leads to a slow onboarding process, which can frustrate users. There is also fee volatility and network congestion, and these factors tend to make[ DApps](https://coinmarketcap.com/alexandria/glossary/decentralized-applications-dapps) fail.\n\nFor such cases, the plug-n-play Biconomy platform was created. It allows users to bypass all the difficulties mentioned above. It simplifies the user-facing processes and interacts with the blockchain by ensuring transactions are executed reliably. Since 2020, the company has already managed to cooperate with Matic Network, Curve Finance, Idle Finance, Perpetual Protocol, and Decentral Games.\n\nBiconomy attempts to eliminate the heavy friction that is present at the level of cryptographic transactions. This action results in productive outcomes in the expansion of the market and increases activity. All this happens thanks to powerful[ APIs](https://coinmarketcap.com/alexandria/glossary/api) and SDKs that use the concept of meta-transactions to save developers both time and effort.\n\nRelated Pages:\n\nRead about[ Ethereum (ETH)](https://coinmarketcap.com/currencies/ethereum/) and[ Polygon (MATIC)](https://coinmarketcap.com/currencies/polygon/).\n\n[Ethereum vs. Ethereum Classic](https://coinmarketcap.com/alexandria/article/ethereum-vs-ethereum-classic)\n\nWhat are Decentralized Applications (DApps)?[ Click here](https://coinmarketcap.com/alexandria/glossary/decentralized-applications-dapps) and learn more.\n\nWhat is Web 3.0? It’s time to find out with[ CMC Alexandria](https://coinmarketcap.com/alexandria/article/what-is-web-3-0).\n\nImprove your knowledge of cryptocurrency. Check out the[ CoinMarketCap blog](https://coinmarketcap.com/alexandria/categories/blog).\n\nHow Many TBD Are In Circulation?\n\nAs of mid-June 2021, the creators have not announced exact release dates for the token or published any roadmap. According to the team, the process of revision is still underway. Information will appear in portions over the next three to four months. The project is in the growth phase and will launch from a multi-chain repeater protocol. Eventually, the Biconomy token aims to bring together thousands of stakeholders to simplify Web 3.0. \n\nHow Is the BICONOMY Network Secured?\n\nThe project is based on blockchain and uses[ smart contracts](https://coinmarketcap.com/alexandria/glossary/smart-contract). What’s more, all Biconomy smart contracts have been audited by multiple developers. The platform doesn't manage or save user's private keys, which means hackers don't have any possibility to withdraw users' tokens from the platform.\n\nWhere Can You Buy BICONOMY (TBD)?\n\nAs of June 2021, you cannot trade Biconomy tokens on any major exchange. Moreover, there is no confirmed information on the upcoming[ ICO](https://coinmarketcap.com/alexandria/glossary/initial-coin-offering-icohttps://coinmarketcap.com/alexandria/glossary/initial-coin-offering-ico) of the token. However, you can always stay up-to-date with the CMC[ crypto calendar](https://coinmarketcap.com/events/). You can find a detailed guide for purchasing crypto[ here](https://coinmarketcap.com/how-to-buy-bitcoin/).\n\nIn conclusion, learn about how to keep your crypto safe. Check out our[ series of tips and resources](https://coinmarketcap.com/alexandria/article/how-to-keep-your-crypto-safe).", "dateAdded": "2021-05-03T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "401", "dateLaunched": "2019-06-04T00:00:00.000Z", "tags": [], "urls": {"website": ["https://biconomy.io"], "technical_doc": [], "explorer": [], "source_code": [], "message_board": [], "chat": ["https://t.me/biconomy", "https://t.me/biconomy"], "announcement": [], "reddit": [], "twitter": ["https://twitter.com/biconomy"]}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.51961028446848, "priceChangePercentage24h": 40.05897643, "priceChangePercentage7d": 55.08756307}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.09993818062774, "priceChangePercentage24h": 9.86982167, "priceChangePercentage7d": 19.75462837}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04639215361782, "priceChangePercentage24h": 9.13811962, "priceChangePercentage7d": 19.76587648}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34600204194768, "priceChangePercentage24h": 18.31417693, "priceChangePercentage7d": 25.96994307}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08817176397124, "priceChangePercentage24h": 9.22152403, "priceChangePercentage7d": 23.30137851}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.33359854728193, "priceChangePercentage24h": 5.66084021, "priceChangePercentage7d": 10.4943706}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.62329345078651, "priceChangePercentage24h": 9.8204927, "priceChangePercentage7d": 15.27014225}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12773403744909, "priceChangePercentage24h": 6.63156837, "priceChangePercentage7d": 12.11450108}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04584695150434, "priceChangePercentage24h": 4.05885686, "priceChangePercentage7d": 12.84051332}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:35:37.832Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}