{"data": {"id": 9632, "name": "UMI", "symbol": "UMI", "slug": "umi", "category": "coin", "description": "## What is UMI? \n \nUMI is a decentralized payment blockchain network with an open source code. It allows you to make almost instant and absolutely free transactions around the world. The UMI cryptocurrency is used as a unit of accounting within the network. \n \nUMI is a fully featured blockchain platform developed from scratch that supports the creation and execution of smart contracts. The UMI blockchain is built on the unique Proof-of-Authority (PoA) consensus algorithm where master nodes and validator nodes are responsible for network performance. \n \nUMI is a unique cryptocurrency issued via staking based on a smart contract. Thanks to this innovative approach, network participants can unite in structures and generate new coins at a rate of up to 40% per month, simply by holding them in their wallets.\n \n## How does UMI work? \n \nThe UMI blockchain is public meaning that all transactions are transparent, cannot be forged or canceled. Moreover, the UMI network code is published on GitLab and is available for audit. \n \nUMI code on GitLab — https://gitlab.com/umitop/umi-master.  \n \nBitcoin and the vast majority of other cryptocurrency blockchains use the Proof-of-Work (PoW), Proof-of-Stake (PoS) consensus algorithms or their derivatives (for example, Delegated Proof-of-Stake, DPoS). This approach significantly limits their throughput and creates commission costs. \n \nUMI chose a completely different path. The heart of the network is the innovative Proof-of-Authority (PoA) technology. It ensures almost instant transactions and safe operation of the network without commission costs. \n \nThe UMI cryptocurrency bypasses the main problems inherent in the PoW and PoS algorithms: \n\n\nMaster nodes are responsible for generating new blocks. They are \"master\" nodes because special ultra-high requirements are applied to them in terms of network speed and bandwidth.\n\n\nValidator nodes support the network checking the blocks for correctness and ruling out forgery. A validator node can be launched by any UMI user, thereby making the network even more decentralized, secure and reliable.\n\n\nBesides, any network participant has the opportunity to launch a light node that allows you to view and send transactions without downloading the entire blockchain history. \n \nUse of master nodes allows us to significantly increase the bandwidth of the UMI network and, accordingly, the speed of transfers in it. \n \nNo one has the opportunity to connect to the master nodes and somehow influence their work because they work anonymously and their location is unknown to anyone. At the same time, the master nodes are distributed throughout the planet to ensure maximum decentralization and avoid the creation of a single point of failure. An attempt to create a block by another node is automatically rejected by the network. This ensures maximum security, protecting UMI from any kind of attacks. \n \nThus, PoA completely eliminates the possibility of fraud and hacking. This ensures that users ' coins will always be safe. \n \n## What makes UMI unique?\n \nThe initial PoA model does not imply either forging or mining since users are prohibited from creating new blocks for security reasons. On the one hand, this is a good thing — there is no need to purchase powerful and expensive equipment and install special software. On the other hand, users cannot be encouraged to maintain network performance which is a significant drawback. Thus, there is no mining or its alternatives in other cryptocurrencies using PoA, but there is in UMI. \n \nThe UMI network uses an improved version of this technology which relies on its advantages while also eliminating its drawbacks. Mining and forging has been replaced by an innovative staking technology based on a smart contract and used to reward users. \n \nThe unique Proof-of-Authority model with smart contract staking not only ensures maximum security of the UMI network, but also implies generous rewards for users. \n \nUMI advantages\n \nAlmost instant transactions without commissions. Bandwidth of the UMI network is up to 65,536 transactions per second. This is several thousand times more than Bitcoin. This is more than VISA or Mastercard. \n \nSafety and reliability. UMI is a fully decentralized blockchain network protected from hacks, leaks, unauthorized changes, 51% attacks, Nothing-at-Stake, third-party interference, DDoS attacks (spam transactions) and other vulnerabilities. A user who has a mnemonic phrase fully owns their coins. \n \nSupport for smart contracts. UMI is a fully featured blockchain platform that allows you to create and execute smart contracts of any complexity.\n \nStaking based on a smart contract at a rate of up to 40% per month. Each UMI user can either create their own staking structure, or join an existing one and multiply their coins at a rate of up to 40% per month. At the same time, UMI coins are not locked for staking, and only the user always has access to them. The reward for staking is awarded every second in the 24/7/365 mode. \n \nThe leading crypto-media wrote more about UMI advantages, including:\n \nCryptoPotato — https://cryptopotato.com/umi-blockchain-ecosystem-of-instant-visa-like-payments-with-zero-fees/\nBitcoinist — https://bitcoinist.com/umi-blockchain-ecosystem-instant-transfers-smart-contracts-and-profitable-staking/\nNewsBTC — https://www.newsbtc.com/press-releases/umi-blockchain-ecosystem-instant-transfers-smart-contracts-and-profitable-staking/\nBitnovosti — https://bitnovosti.com/2020/10/30/blokchejn-ekosistema-umi-mgnovennye-perevody-mnogofunktsionalnye-smart-kontrakty-vygodnyj-stejking/\nDeCenter — https://decenter.org/ru/blokchein-ekosistema-umi\n \n## Who created UMI?\n \nUMI was created by an anonymous and completely independent development team at its own expense. As was the case with Bitcoin, the creators of UMI are anonymous. This is done for the network to be as decentralized as possible. There is no single entity that someone could influence and thus harm the UMI network. \n \nOngoing development and future plans\n \nAt the moment, UMI is actively entering the DeFi market. The coin was tokenized in four popular blockchains — Ethereum, Binance Smart Chain, Polygon and TRON, and also added to popular decentralized exchanges:\n \nUniswap (Ethereum) — https://app.uniswap.org/#/swap?outputCurrency=0x46943113ae84e732bb510b5f7686d8b76ff56774\nPancakeSwap (Binance Smart Chain) — https://exchange.pancakeswap.finance/#/swap?outputCurrency=0x46943113ae84e732bb510b5f7686d8b76ff56774\nQuickSwap (Polygon) — https://quickswap.exchange/#/swap?outputCurrency=0x10Adf16a60F0020477c70473D6EA595D9bc29372\nJustSwap (TRON) — https://justswap.io/#/home?tokenAddress=TDH9sTjrxgrL8oogwMYw4Lq8UK25pTfp3d&type=swap\n ", "dateAdded": "2021-05-07T00:00:00.000Z", "status": "active", "notice": "", "latestUpdateTime": "2021-07-31T09:34:29.000Z", "watchCount": "3926", "dateLaunched": "2020-05-31T00:00:00.000Z", "tags": [], "urls": {"website": ["https://umi.top"], "technical_doc": ["https://bitcointalk.org/index.php?topic=5252661"], "explorer": ["https://blockchain.umi.top/"], "source_code": ["https://blockchain.umi.top/"], "message_board": ["https://medium.com/@umi_top", "https://www.youtube.com/c/UMITop"], "chat": ["https://t.me/umi_news_ru", "https://www.facebook.com/umi.top.official"], "announcement": ["https://www.instagram.com/umi.top"], "reddit": [], "twitter": ["https://twitter.com/UMITOP"]}, "volume": 3463.03715789, "volumeChangePercentage24h": 4.151, "statistics": {"price": 0.2631, "priceChangePercentage1h": 0.76599004, "priceChangePercentage24h": -20.29687973, "priceChangePercentage7d": -35.03703704, "priceChangePercentage30d": 0.0, "priceChangePercentage60d": 0.0, "priceChangePercentage90d": 0.0, "marketCap": 0.0, "marketCapChangePercentage24h": 0.0, "fullyDilutedMarketCap": -0.26, "fullyDilutedMarketCapChangePercentage24h": 0.0, "circulatingSupply": 0.0, "totalSupply": 0.0, "maxSupply": -1.0, "marketCapDominance": 0.0, "rank": 4384, "low24h": 0.2606, "high24h": 0.3289, "low7d": 0.2606, "high7d": 0.425, "low30d": 0.23, "high30d": 0.7698, "low90d": 0.23, "high90d": 0.7698, "low52w": 0.23, "high52w": 0.7698, "lowAllTime": 0.23, "highAllTime": 0.7698, "lowAllTimeChangePercentage": 14.39, "highAllTimeChangePercentage": -65.82, "lowAllTimeTimestamp": "2021-07-20T02:19:06.000Z", "highAllTimeTimestamp": "2021-07-09T08:55:05.000Z", "lowYesterday": 0.3002, "highYesterday": 0.356, "openYesterday": 0.356, "closeYesterday": 0.3002, "priceChangePercentageYesterday": -15.67, "volumeYesterday": 0, "ytdPriceChangePercentage": 0.0}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.39418097354959, "priceChangePercentage24h": 39.61504098, "priceChangePercentage7d": 54.64102459}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.09450221285637, "priceChangePercentage24h": 9.74123592, "priceChangePercentage7d": 19.57655165}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04637312830973, "priceChangePercentage24h": 9.16897009, "priceChangePercentage7d": 19.60169553}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34158907038751, "priceChangePercentage24h": 17.96859664, "priceChangePercentage7d": 25.45374901}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08818206532414, "priceChangePercentage24h": 9.25459586, "priceChangePercentage7d": 23.29653032}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.32871798462683, "priceChangePercentage24h": 5.53167644, "priceChangePercentage7d": 10.36993021}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.61976789833727, "priceChangePercentage24h": 9.95234354, "priceChangePercentage7d": 15.109801}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12744835094317, "priceChangePercentage24h": 6.38050551, "priceChangePercentage7d": 11.86473009}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04507747416068, "priceChangePercentage24h": 4.01797293, "priceChangePercentage7d": 12.73429399}], "relatedExchanges": [], "isAudited": false, "holders": {}}, "status": {"timestamp": "2021-07-31T09:36:15.618Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}