{"data": {"id": 9940, "name": "Cretaceous", "symbol": "CTS", "slug": "cretaceous", "category": "token", "description": "Cretaceous is a decentralized incubator that funds promising projects to utmostly explore their potential by leveraging the investment power of our community, in this way to render token an exclusive function. Its technology leadership tops among its counterparts.\r\nIt aims to Take the lead in helping build the financial infrastructure on the chain, designing an on-chain funds by community members, of community members, for community members.\r\nCTS’s vision has never been limited to a certain point, but a way of thinking about the market, users, products, and even the entire ecology under the exchange of valuations such as blockchain, big data and cloud computing.\r\nVertically build an empowering community, and use the dynamic chain of the incubator to fully integrate the ecologically reactive low-field energy users. In the future, it will be considered to sink into each chain by O2O mirroring.\r\nCTS technicians enable interactive processing of full-analysis data, processing and analysis of proprietary data network topics, research and development of network physical layer applications, and deep penetration of users. It will ensure that every logic is a perfect closed loop, and through negative adjustment and static filling, a permanent connection is completed in the occasion of the appearance of CTS.\r\nFor the traditional financial market, venture capital activity is an industry that integrates into the blood of the market. Public fund companies, trust companies, asset management companies, and related banks, securities, insurance and other institutions are all players and participants in this activity to pursue profits. The DeFi process to reshape the financial system in the encryption world currency, the venture capital from crypocurrency incubators apparently is also an important component.\r\nHowever, compared with the mature traditional financial market, the fast-paced and high-yield nature of the DeFi market today has made investors’ pursuit of capital utilization and liquidity convenience to the extreme. For surging projects, the inability to get enough funds and resources makes their tokens less attractive to DeFi investors. Cretaceous is keenly aware of this market pain point, and through the design of tokenization of the venture capital on the chain, it has become a DeFi project incubator.", "dateAdded": "2021-05-19T00:00:00.000Z", "status": "untracked", "notice": "", "latestUpdateTime": "", "watchCount": "9", "dateLaunched": "2021-05-09T00:00:00.000Z", "tags": [], "urls": {"website": ["https://cretaceous.space"], "technical_doc": [], "explorer": [], "source_code": [], "message_board": [], "chat": [], "announcement": [], "reddit": [], "twitter": []}, "relatedCoins": [{"id": 1376, "name": "Neo", "slug": "neo", "price": 47.20183531244782, "priceChangePercentage24h": 39.13616826, "priceChangePercentage7d": 53.95596503}, {"id": 6636, "name": "Polkadot", "slug": "polkadot-new", "price": 16.11344337944072, "priceChangePercentage24h": 10.18449042, "priceChangePercentage7d": 19.48248837}, {"id": 109, "name": "DigiByte", "slug": "digibyte", "price": 0.04627457717797, "priceChangePercentage24h": 8.91135231, "priceChangePercentage7d": 19.45883406}, {"id": 1817, "name": "Voyager Token", "slug": "voyager-token", "price": 2.34617322631426, "priceChangePercentage24h": 18.30909192, "priceChangePercentage7d": 25.55452378}, {"id": 3077, "name": "VeChain", "slug": "vechain", "price": 0.08821362409385, "priceChangePercentage24h": 9.42255504, "priceChangePercentage7d": 23.13615696}, {"id": 1567, "name": "Nano", "slug": "nano", "price": 4.32662201481798, "priceChangePercentage24h": 4.95126771, "priceChangePercentage7d": 10.27161668}, {"id": 7226, "name": "Injective Protocol", "slug": "injective-protocol", "price": 6.69640107233936, "priceChangePercentage24h": 11.40482406, "priceChangePercentage7d": 16.5160507}, {"id": 2062, "name": "Aion", "slug": "aion", "price": 0.12783130067915, "priceChangePercentage24h": 6.95747271, "priceChangePercentage7d": 12.47362042}, {"id": 3890, "name": "Polygon", "slug": "polygon", "price": 1.04646931829133, "priceChangePercentage24h": 4.2717338, "priceChangePercentage7d": 12.71622843}], "relatedExchanges": [], "isAudited": false}, "status": {"timestamp": "2021-07-31T09:38:24.317Z", "error_code": "0", "error_message": "SUCCESS", "elapsed": "6", "credit_count": 0}}